    
[{
    "number": "002",
    "name": "al-Baqarah",
    "verse": ["بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ",
                    "الٓـمّٓ ۚ﴿۱﴾",
                    "ذٰلِکَ  الۡکِتٰبُ لَا رَیۡبَ ۚۖۛ فِیۡہِ ۚۛ ہُدًی  لِّلۡمُتَّقِیۡنَ ۙ﴿۲﴾",
                    "الَّذِیۡنَ یُؤۡمِنُوۡنَ بِالۡغَیۡبِ وَ یُقِیۡمُوۡنَ الصَّلٰوۃَ وَ  مِمَّا رَزَقۡنٰہُمۡ  یُنۡفِقُوۡنَ ۙ﴿۳﴾",
                    "وَ الَّذِیۡنَ یُؤۡمِنُوۡنَ بِمَاۤ  اُنۡزِلَ اِلَیۡکَ وَ مَاۤ اُنۡزِلَ مِنۡ قَبۡلِکَ ۚ وَ بِالۡاٰخِرَۃِ ہُمۡ یُوۡقِنُوۡنَ ؕ﴿۴﴾",
                    "اُولٰٓئِکَ عَلٰی ہُدًی مِّنۡ رَّبِّہِمۡ ٭ وَ اُولٰٓئِکَ ہُمُ  الۡمُفۡلِحُوۡنَ ﴿۵﴾",
                    "اِنَّ الَّذِیۡنَ  کَفَرُوۡا سَوَآءٌ  عَلَیۡہِمۡ ءَاَنۡذَرۡتَہُمۡ  اَمۡ  لَمۡ  تُنۡذِرۡہُمۡ لَا یُؤۡمِنُوۡنَ ﴿۶﴾",
                    "خَتَمَ اللّٰہُ عَلٰی قُلُوۡبِہِمۡ وَ عَلٰی سَمۡعِہِمۡ ؕ  وَ عَلٰۤی اَبۡصَارِہِمۡ غِشَاوَۃٌ ۫ وَّ لَہُمۡ عَذَابٌ عَظِیۡمٌ ٪﴿۷﴾",
                    "وَ مِنَ النَّاسِ مَنۡ یَّقُوۡلُ اٰمَنَّا بِاللّٰہِ وَ بِالۡیَوۡمِ الۡاٰخِرِ وَ مَا ہُمۡ بِمُؤۡمِنِیۡنَ ۘ﴿۸﴾",
                    "یُخٰدِعُوۡنَ اللّٰہَ وَ الَّذِیۡنَ اٰمَنُوۡا ۚ وَ مَا یَخۡدَعُوۡنَ  اِلَّاۤ  اَنۡفُسَہُمۡ وَ مَا یَشۡعُرُوۡنَ ؕ﴿۹﴾",
                    "فِیۡ قُلُوۡبِہِمۡ مَّرَضٌ ۙ فَزَادَہُمُ  اللّٰہُ  مَرَضًا ۚ  وَ لَہُمۡ عَذَابٌ اَلِیۡمٌۢ  ۬ۙ بِمَا کَانُوۡا یَکۡذِبُوۡنَ ﴿۱۰﴾",
                    "وَ اِذَا قِیۡلَ لَہُمۡ لَا تُفۡسِدُوۡا فِی الۡاَرۡضِ ۙ  قَالُوۡۤا اِنَّمَا نَحۡنُ مُصۡلِحُوۡنَ ﴿۱۱﴾",
                    "اَلَاۤ اِنَّہُمۡ ہُمُ الۡمُفۡسِدُوۡنَ وَ لٰکِنۡ لَّا یَشۡعُرُوۡنَ ﴿۱۲﴾",
                    "وَ  اِذَا قِیۡلَ لَہُمۡ اٰمِنُوۡا کَمَاۤ اٰمَنَ النَّاسُ قَالُوۡۤا اَنُؤۡمِنُ کَمَاۤ اٰمَنَ السُّفَہَآءُ ؕ اَلَاۤ اِنَّہُمۡ ہُمُ  السُّفَہَآءُ  وَ لٰکِنۡ لَّا  یَعۡلَمُوۡنَ ﴿۱۳﴾",
                    "وَ  اِذَا لَقُوا الَّذِیۡنَ اٰمَنُوۡا قَالُوۡۤا اٰمَنَّا ۚۖ وَ  اِذَا خَلَوۡا اِلٰی شَیٰطِیۡنِہِمۡ ۙ قَالُوۡۤا اِنَّا مَعَکُمۡ ۙ اِنَّمَا نَحۡنُ مُسۡتَہۡزِءُوۡنَ ﴿۱۴﴾",
                    "اَللّٰہُ یَسۡتَہۡزِئُ بِہِمۡ وَ یَمُدُّہُمۡ  فِیۡ طُغۡیَانِہِمۡ یَعۡمَہُوۡنَ ﴿۱۵﴾",
                    "اُولٰٓئِکَ الَّذِیۡنَ اشۡتَرَوُا الضَّلٰلَۃَ بِالۡہُدٰی ۪  فَمَا رَبِحَتۡ تِّجَارَتُہُمۡ وَ مَا کَانُوۡا مُہۡتَدِیۡنَ ﴿۱۶﴾",
                    "مَثَلُہُمۡ کَمَثَلِ الَّذِی اسۡتَوۡقَدَ نَارًا ۚ  فَلَمَّاۤ اَضَآءَتۡ مَا حَوۡلَہٗ ذَہَبَ اللّٰہُ بِنُوۡرِہِمۡ وَ تَرَکَہُمۡ فِیۡ ظُلُمٰتٍ لَّا یُبۡصِرُوۡنَ ﴿۱۷﴾",
                    "صُمٌّۢ  بُکۡمٌ عُمۡیٌ فَہُمۡ لَا یَرۡجِعُوۡنَ ﴿ۙ۱۸﴾",
                    "اَوۡ کَصَیِّبٍ مِّنَ السَّمَآءِ فِیۡہِ ظُلُمٰتٌ وَّ رَعۡدٌ وَّ بَرۡقٌ ۚ یَجۡعَلُوۡنَ اَصَابِعَہُمۡ فِیۡۤ  اٰذَانِہِمۡ مِّنَ الصَّوَاعِقِ حَذَرَ الۡمَوۡتِ ؕ وَ اللّٰہُ مُحِیۡطٌۢ بِالۡکٰفِرِیۡنَ ﴿۱۹﴾",
                    "یَکَادُ الۡبَرۡقُ یَخۡطَفُ اَبۡصَارَہُمۡ ؕ کُلَّمَاۤ اَضَآءَ لَہُمۡ مَّشَوۡا فِیۡہِ ٭ۙ وَ اِذَاۤ اَظۡلَمَ عَلَیۡہِمۡ قَامُوۡا ؕ وَ لَوۡ شَآءَ اللّٰہُ  لَذَہَبَ بِسَمۡعِہِمۡ وَ اَبۡصَارِہِمۡ ؕ اِنَّ اللّٰہَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿٪۲۰﴾",
                    "یٰۤاَیُّہَا النَّاسُ اعۡبُدُوۡا رَبَّکُمُ الَّذِیۡ خَلَقَکُمۡ وَ الَّذِیۡنَ مِنۡ قَبۡلِکُمۡ لَعَلَّکُمۡ تَتَّقُوۡنَ ﴿ۙ۲۱﴾",
                    "الَّذِیۡ جَعَلَ لَکُمُ الۡاَرۡضَ فِرَاشًا وَّ السَّمَآءَ بِنَآءً ۪ وَّ اَنۡزَلَ مِنَ السَّمَآءِ مَآءً  فَاَخۡرَجَ بِہٖ مِنَ الثَّمَرٰتِ رِزۡقًا لَّکُمۡ ۚ فَلَا تَجۡعَلُوۡا لِلّٰہِ اَنۡدَادًا وَّ اَنۡتُمۡ تَعۡلَمُوۡنَ ﴿۲۲﴾",
                    "وَ اِنۡ کُنۡتُمۡ فِیۡ رَیۡبٍ مِّمَّا نَزَّلۡنَا عَلٰی عَبۡدِنَا فَاۡتُوۡا بِسُوۡرَۃٍ مِّنۡ مِّثۡلِہٖ ۪ وَ ادۡعُوۡا شُہَدَآءَکُمۡ مِّنۡ دُوۡنِ اللّٰہِ  اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۲۳﴾",
                    "فَاِنۡ لَّمۡ تَفۡعَلُوۡا وَ لَنۡ تَفۡعَلُوۡا فَاتَّقُوا النَّارَ الَّتِیۡ وَقُوۡدُہَا النَّاسُ وَ الۡحِجَارَۃُ  ۚۖ اُعِدَّتۡ لِلۡکٰفِرِیۡنَ ﴿۲۴﴾",
                    "وَ بَشِّرِ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ اَنَّ لَہُمۡ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ ؕ  کُلَّمَا رُزِقُوۡا مِنۡہَا مِنۡ ثَمَرَۃٍ رِّزۡقًا ۙ قَالُوۡا ہٰذَا الَّذِیۡ رُزِقۡنَا مِنۡ قَبۡلُ ۙ وَ اُتُوۡا بِہٖ مُتَشَابِہًا ؕ وَ لَہُمۡ فِیۡہَاۤ اَزۡوَاجٌ مُّطَہَّرَۃٌ ٭ۙ وَّ ہُمۡ فِیۡہَا خٰلِدُوۡنَ ﴿۲۵﴾",
                    "اِنَّ اللّٰہَ لَا یَسۡتَحۡیٖۤ اَنۡ یَّضۡرِبَ مَثَلًا مَّا بَعُوۡضَۃً فَمَا فَوۡقَہَا ؕ فَاَمَّا الَّذِیۡنَ اٰمَنُوۡا فَیَعۡلَمُوۡنَ اَنَّہُ الۡحَقُّ مِنۡ رَّبِّہِمۡ ۚ وَ اَمَّا الَّذِیۡنَ کَفَرُوۡا فَیَقُوۡلُوۡنَ مَا ذَاۤ  اَرَادَ  اللّٰہُ بِہٰذَا مَثَلًا ۘ یُضِلُّ بِہٖ کَثِیۡرًا ۙ وَّ یَہۡدِیۡ بِہٖ کَثِیۡرًا ؕ وَ مَا یُضِلُّ بِہٖۤ  اِلَّا الۡفٰسِقِیۡنَ ﴿ۙ۲۶﴾",
                    "الَّذِیۡنَ یَنۡقُضُوۡنَ عَہۡدَ  اللّٰہِ مِنۡۢ بَعۡدِ مِیۡثَاقِہٖ ۪ وَ یَقۡطَعُوۡنَ مَاۤ اَمَرَ اللّٰہُ بِہٖۤ  اَنۡ یُّوۡصَلَ وَ یُفۡسِدُوۡنَ فِی الۡاَرۡضِ ؕ اُولٰٓئِکَ ہُمُ الۡخٰسِرُوۡنَ ﴿۲۷﴾",
                    "کَیۡفَ تَکۡفُرُوۡنَ بِاللّٰہِ وَ کُنۡتُمۡ اَمۡوَاتًا فَاَحۡیَاکُمۡ ۚ ثُمَّ یُمِیۡتُکُمۡ ثُمَّ یُحۡیِیۡکُمۡ ثُمَّ  اِلَیۡہِ تُرۡجَعُوۡنَ ﴿۲۸﴾",
                    "ہُوَ الَّذِیۡ خَلَقَ لَکُمۡ مَّا فِی الۡاَرۡضِ جَمِیۡعًا ٭ ثُمَّ اسۡتَوٰۤی اِلَی السَّمَآءِ فَسَوّٰٮہُنَّ سَبۡعَ سَمٰوٰتٍ ؕ وَ ہُوَ بِکُلِّ شَیۡءٍ عَلِیۡمٌ ﴿٪۲۹﴾",
                    "وَ  اِذۡ قَالَ رَبُّکَ لِلۡمَلٰٓئِکَۃِ اِنِّیۡ جَاعِلٌ فِی الۡاَرۡضِ خَلِیۡفَۃً ؕ قَالُوۡۤا اَتَجۡعَلُ فِیۡہَا مَنۡ یُّفۡسِدُ فِیۡہَا وَ یَسۡفِکُ الدِّمَآءَ ۚ وَ نَحۡنُ نُسَبِّحُ بِحَمۡدِکَ وَ نُقَدِّسُ لَکَ ؕ قَالَ اِنِّیۡۤ اَعۡلَمُ مَا لَا تَعۡلَمُوۡنَ ﴿۳۰﴾",
                    "وَ عَلَّمَ اٰدَمَ الۡاَسۡمَآءَ کُلَّہَا ثُمَّ عَرَضَہُمۡ عَلَی الۡمَلٰٓئِکَۃِ ۙ فَقَالَ اَنۡۢبِـُٔوۡنِیۡ بِاَسۡمَآءِ ہٰۤؤُلَآءِ اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۳۱﴾",
                    "قَالُوۡا سُبۡحٰنَکَ لَا عِلۡمَ لَنَاۤ اِلَّا مَا عَلَّمۡتَنَا ؕ اِنَّکَ اَنۡتَ الۡعَلِیۡمُ الۡحَکِیۡمُ ﴿۳۲﴾",
                    "قَالَ یٰۤاٰدَمُ اَنۡۢبِئۡہُمۡ بِاَسۡمَآئِہِمۡ ۚ فَلَمَّاۤ اَنۡۢبَاَہُمۡ بِاَسۡمَآئِہِمۡ ۙ قَالَ اَلَمۡ اَقُلۡ لَّکُمۡ اِنِّیۡۤ  اَعۡلَمُ غَیۡبَ السَّمٰوٰتِ وَ الۡاَرۡضِ ۙ وَ اَعۡلَمُ مَا تُبۡدُوۡنَ وَ مَا کُنۡتُمۡ تَکۡتُمُوۡنَ ﴿۳۳﴾",
                    "وَ اِذۡ قُلۡنَا لِلۡمَلٰٓئِکَۃِ اسۡجُدُوۡا لِاٰدَمَ فَسَجَدُوۡۤا  اِلَّاۤ  اِبۡلِیۡسَ ؕ اَبٰی وَ اسۡتَکۡبَرَ ٭۫ وَ  کَانَ مِنَ الۡکٰفِرِیۡنَ ﴿۳۴﴾",
                    "وَ قُلۡنَا یٰۤاٰدَمُ اسۡکُنۡ اَنۡتَ وَ زَوۡجُکَ الۡجَنَّۃَ وَ کُلَا مِنۡہَا رَغَدًا حَیۡثُ شِئۡتُمَا ۪ وَ لَا تَقۡرَبَا ہٰذِہِ الشَّجَرَۃَ فَتَکُوۡنَا مِنَ الظّٰلِمِیۡنَ ﴿۳۵﴾",
                    "فَاَزَلَّہُمَا الشَّیۡطٰنُ عَنۡہَا فَاَخۡرَجَہُمَا مِمَّا کَانَا فِیۡہِ ۪ وَ قُلۡنَا اہۡبِطُوۡا بَعۡضُکُمۡ لِبَعۡضٍ عَدُوٌّ ۚ وَ لَکُمۡ فِی الۡاَرۡضِ مُسۡتَقَرٌّ  وَّ مَتَاعٌ اِلٰی  حِیۡنٍ ﴿۳۶﴾",
                    "فَتَلَقّٰۤی اٰدَمُ مِنۡ رَّبِّہٖ کَلِمٰتٍ فَتَابَ عَلَیۡہِ ؕ اِنَّہٗ ہُوَ  التَّوَّابُ الرَّحِیۡمُ ﴿۳۷﴾",
                    "قُلۡنَا اہۡبِطُوۡا مِنۡہَا جَمِیۡعًا ۚ فَاِمَّا یَاۡتِیَنَّکُمۡ مِّنِّیۡ ہُدًی فَمَنۡ تَبِعَ ہُدَایَ فَلَا خَوۡفٌ عَلَیۡہِمۡ  وَ لَا ہُمۡ یَحۡزَنُوۡنَ ﴿۳۸﴾",
                    "وَ الَّذِیۡنَ  کَفَرُوۡا وَ کَذَّبُوۡا بِاٰیٰتِنَاۤ اُولٰٓئِکَ اَصۡحٰبُ النَّارِ ۚ ہُمۡ فِیۡہَا خٰلِدُوۡنَ ﴿٪۳۹﴾",
                    "یٰبَنِیۡۤ  اِسۡرَآءِیۡلَ اذۡکُرُوۡا نِعۡمَتِیَ الَّتِیۡۤ اَنۡعَمۡتُ عَلَیۡکُمۡ وَ اَوۡفُوۡا بِعَہۡدِیۡۤ اُوۡفِ بِعَہۡدِکُمۡ ۚ وَ اِیَّایَ فَارۡہَبُوۡنِ ﴿۴۰﴾",
                    "وَ اٰمِنُوۡا بِمَاۤ اَنۡزَلۡتُ مُصَدِّقًا لِّمَا مَعَکُمۡ وَ لَا تَکُوۡنُوۡۤا اَوَّلَ کَافِرٍۭ بِہٖ ۪ وَ لَا تَشۡتَرُوۡا بِاٰیٰتِیۡ ثَمَنًا قَلِیۡلًا ۫ وَّ اِیَّایَ فَاتَّقُوۡنِ ﴿۴۱﴾",
                    "وَ لَا تَلۡبِسُوا الۡحَقَّ بِالۡبَاطِلِ وَ تَکۡتُمُوا الۡحَقَّ وَ اَنۡتُمۡ تَعۡلَمُوۡنَ ﴿۴۲﴾",
                    "وَ اَقِیۡمُوا الصَّلٰوۃَ وَ اٰتُوا الزَّکٰوۃَ وَ ارۡکَعُوۡا مَعَ الرّٰکِعِیۡنَ ﴿۴۳﴾",
                    "اَتَاۡمُرُوۡنَ النَّاسَ بِالۡبِرِّ وَ تَنۡسَوۡنَ اَنۡفُسَکُمۡ وَ اَنۡتُمۡ تَتۡلُوۡنَ الۡکِتٰبَ ؕ اَفَلَا تَعۡقِلُوۡنَ ﴿۴۴﴾",
                    "وَ اسۡتَعِیۡنُوۡا بِالصَّبۡرِ وَ الصَّلٰوۃِ ؕ وَ اِنَّہَا لَکَبِیۡرَۃٌ اِلَّا عَلَی الۡخٰشِعِیۡنَ ﴿ۙ۴۵﴾",
                    "الَّذِیۡنَ یَظُنُّوۡنَ اَنَّہُمۡ مُّلٰقُوۡا رَبِّہِمۡ وَ اَنَّہُمۡ  اِلَیۡہِ رٰجِعُوۡنَ ﴿٪۴۶﴾",
                    "یٰبَنِیۡۤ  اِسۡرَآءِیۡلَ اذۡکُرُوۡا نِعۡمَتِیَ الَّتِیۡۤ اَنۡعَمۡتُ عَلَیۡکُمۡ وَ اَنِّیۡ فَضَّلۡتُکُمۡ عَلَی الۡعٰلَمِیۡنَ ﴿۴۷﴾",
                    "وَ اتَّقُوۡا یَوۡمًا لَّا تَجۡزِیۡ نَفۡسٌ عَنۡ نَّفۡسٍ شَیۡئًا وَّ لَا یُقۡبَلُ مِنۡہَا شَفَاعَۃٌ وَّ لَا یُؤۡخَذُ مِنۡہَا عَدۡلٌ وَّ لَا ہُمۡ یُنۡصَرُوۡنَ ﴿۴۸﴾",
                    "وَ اِذۡ نَجَّیۡنٰکُمۡ مِّنۡ اٰلِ فِرۡعَوۡنَ یَسُوۡمُوۡنَکُمۡ سُوۡٓءَ الۡعَذَابِ یُذَبِّحُوۡنَ اَبۡنَآءَکُمۡ وَ یَسۡتَحۡیُوۡنَ نِسَآءَکُمۡ ؕ وَ فِیۡ ذٰلِکُمۡ بَلَآ ءٌ  مِّنۡ رَّبِّکُمۡ عَظِیۡمٌ ﴿۴۹﴾",
                    "وَ اِذۡ فَرَقۡنَا بِکُمُ الۡبَحۡرَ فَاَنۡجَیۡنٰکُمۡ وَ اَغۡرَقۡنَاۤ  اٰلَ فِرۡعَوۡنَ وَ اَنۡتُمۡ تَنۡظُرُوۡنَ ﴿۵۰﴾",
                    "وَ اِذۡ وٰعَدۡنَا مُوۡسٰۤی اَرۡبَعِیۡنَ لَیۡلَۃً ثُمَّ اتَّخَذۡتُمُ الۡعِجۡلَ مِنۡۢ بَعۡدِہٖ وَ اَنۡتُمۡ ظٰلِمُوۡنَ ﴿۵۱﴾",
                    "ثُمَّ عَفَوۡنَا عَنۡکُمۡ مِّنۡۢ بَعۡدِ ذٰلِکَ لَعَلَّکُمۡ تَشۡکُرُوۡنَ ﴿۵۲﴾",
                    "وَ اِذۡ اٰتَیۡنَا مُوۡسَی الۡکِتٰبَ وَ الۡفُرۡقَانَ لَعَلَّکُمۡ تَہۡتَدُوۡنَ ﴿۵۳﴾",
                    "وَ اِذۡ قَالَ مُوۡسٰی لِقَوۡمِہٖ یٰقَوۡمِ  اِنَّکُمۡ ظَلَمۡتُمۡ اَنۡفُسَکُمۡ بِاتِّخَاذِکُمُ الۡعِجۡلَ فَتُوۡبُوۡۤا اِلٰی بَارِئِکُمۡ فَاقۡتُلُوۡۤا اَنۡفُسَکُمۡ ؕ ذٰلِکُمۡ خَیۡرٌ  لَّکُمۡ عِنۡدَ بَارِئِکُمۡ ؕ فَتَابَ عَلَیۡکُمۡ ؕ اِنَّہٗ ہُوَ التَّوَّابُ الرَّحِیۡمُ ﴿۵۴﴾",
                    "وَ اِذۡ قُلۡتُمۡ یٰمُوۡسٰی لَنۡ نُّؤۡمِنَ لَکَ حَتّٰی نَرَی اللّٰہَ جَہۡرَۃً فَاَخَذَتۡکُمُ الصّٰعِقَۃُ وَ اَنۡتُمۡ تَنۡظُرُوۡنَ ﴿۵۵﴾",
                    "ثُمَّ بَعَثۡنٰکُمۡ مِّنۡۢ بَعۡدِ مَوۡتِکُمۡ لَعَلَّکُمۡ تَشۡکُرُوۡنَ ﴿۵۶﴾",
                    "وَ ظَلَّلۡنَا عَلَیۡکُمُ الۡغَمَامَ وَ اَنۡزَلۡنَا عَلَیۡکُمُ الۡمَنَّ وَ السَّلۡوٰی ؕ کُلُوۡا مِنۡ طَیِّبٰتِ مَا رَزَقۡنٰکُمۡ ؕ وَ مَا ظَلَمُوۡنَا وَ لٰکِنۡ کَانُوۡۤا اَنۡفُسَہُمۡ یَظۡلِمُوۡنَ ﴿۵۷﴾",
                    "وَ  اِذۡ قُلۡنَا ادۡخُلُوۡا ہٰذِہِ الۡقَرۡیَۃَ فَکُلُوۡا مِنۡہَا حَیۡثُ شِئۡتُمۡ رَغَدًا وَّ ادۡخُلُوا الۡبَابَ سُجَّدًا وَّ قُوۡلُوۡا حِطَّۃٌ نَّغۡفِرۡ لَکُمۡ خَطٰیٰکُمۡ ؕ وَ سَنَزِیۡدُ الۡمُحۡسِنِیۡنَ ﴿۵۸﴾",
                    "فَبَدَّلَ الَّذِیۡنَ ظَلَمُوۡا قَوۡلًا غَیۡرَ الَّذِیۡ قِیۡلَ لَہُمۡ فَاَنۡزَلۡنَا عَلَی الَّذِیۡنَ ظَلَمُوۡا رِجۡزًا مِّنَ السَّمَآءِ بِمَا کَانُوۡا یَفۡسُقُوۡنَ ﴿٪۵۹﴾",
                    "وَ اِذِ اسۡتَسۡقٰی مُوۡسٰی لِقَوۡمِہٖ فَقُلۡنَا اضۡرِبۡ بِّعَصَاکَ الۡحَجَرَ ؕ فَانۡفَجَرَتۡ مِنۡہُ اثۡنَتَاعَشۡرَۃَ عَیۡنًا ؕ قَدۡ عَلِمَ کُلُّ اُنَاسٍ مَّشۡرَبَہُمۡ ؕ کُلُوۡا وَ اشۡرَبُوۡا مِنۡ رِّزۡقِ اللّٰہِ وَ لَا تَعۡثَوۡا فِی الۡاَرۡضِ مُفۡسِدِیۡنَ ﴿۶۰﴾",
                    "وَ  اِذۡ قُلۡتُمۡ یٰمُوۡسٰی لَنۡ نَّصۡبِرَ عَلٰی طَعَامٍ وَّاحِدٍ فَادۡعُ لَنَا رَبَّکَ یُخۡرِجۡ لَنَا مِمَّا تُنۡۢبِتُ الۡاَرۡضُ مِنۡۢ بَقۡلِہَا وَ قِثَّآئِہَا وَ فُوۡمِہَا وَ عَدَسِہَا وَ بَصَلِہَا ؕ قَالَ اَتَسۡتَبۡدِلُوۡنَ الَّذِیۡ ہُوَ اَدۡنٰی بِالَّذِیۡ ہُوَ خَیۡرٌ ؕ اِہۡبِطُوۡا مِصۡرًا فَاِنَّ لَکُمۡ مَّا سَاَلۡتُمۡ  ؕ وَ ضُرِبَتۡ عَلَیۡہِمُ الذِّلَّۃُ  وَ الۡمَسۡکَنَۃُ ٭ وَ بَآءُوۡ بِغَضَبٍ مِّنَ اللّٰہِ ؕ ذٰلِکَ بِاَنَّہُمۡ کَانُوۡا یَکۡفُرُوۡنَ بِاٰیٰتِ اللّٰہِ وَ یَقۡتُلُوۡنَ النَّبِیّٖنَ بِغَیۡرِ الۡحَقِّ ؕ ذٰلِکَ بِمَا عَصَوۡا وَّ کَانُوۡا یَعۡتَدُوۡنَ ﴿٪۶۱﴾",
                    "اِنَّ الَّذِیۡنَ اٰمَنُوۡا وَ الَّذِیۡنَ ہَادُوۡا وَ النَّصٰرٰی وَ الصّٰبِئِیۡنَ مَنۡ اٰمَنَ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ وَ عَمِلَ صَالِحًا فَلَہُمۡ اَجۡرُہُمۡ عِنۡدَ رَبِّہِمۡ ۪ۚ وَ لَا خَوۡفٌ عَلَیۡہِمۡ وَ لَا ہُمۡ یَحۡزَنُوۡنَ ﴿۶۲﴾",
                    "وَ اِذۡ اَخَذۡنَا مِیۡثَاقَکُمۡ وَ رَفَعۡنَا فَوۡقَکُمُ الطُّوۡرَ ؕ خُذُوۡا مَاۤ اٰتَیۡنٰکُمۡ بِقُوَّۃٍ وَّ اذۡکُرُوۡا مَا فِیۡہِ لَعَلَّکُمۡ تَتَّقُوۡنَ ﴿۶۳﴾",
                    "ثُمَّ تَوَلَّیۡتُمۡ مِّنۡۢ بَعۡدِ ذٰلِکَ ۚ فَلَوۡ لَا فَضۡلُ اللّٰہِ عَلَیۡکُمۡ وَ رَحۡمَتُہٗ لَکُنۡتُمۡ مِّنَ  الۡخٰسِرِیۡنَ ﴿۶۴﴾",
                    "وَ لَقَدۡ عَلِمۡتُمُ  الَّذِیۡنَ اعۡتَدَوۡا مِنۡکُمۡ فِی السَّبۡتِ فَقُلۡنَا لَہُمۡ کُوۡنُوۡا قِرَدَۃً خٰسِئِیۡنَ ﴿ۚ۶۵﴾",
                    "فَجَعَلۡنٰہَا نَکَالًا لِّمَا بَیۡنَ یَدَیۡہَا وَ مَا خَلۡفَہَا وَ مَوۡعِظَۃً  لِّلۡمُتَّقِیۡنَ ﴿۶۶﴾",
                    "وَ اِذۡ قَالَ مُوۡسٰی لِقَوۡمِہٖۤ  اِنَّ اللّٰہَ یَاۡمُرُکُمۡ اَنۡ تَذۡبَحُوۡا بَقَرَۃً ؕ قَالُوۡۤا اَتَتَّخِذُنَا ہُزُوًا ؕ قَالَ اَعُوۡذُ بِاللّٰہِ اَنۡ اَکُوۡنَ مِنَ  الۡجٰہِلِیۡنَ ﴿۶۷﴾",
                    "قَالُوا ادۡعُ لَنَا رَبَّکَ یُبَیِّنۡ لَّنَا مَا ہِیَ ؕ قَالَ  اِنَّہٗ یَقُوۡلُ  اِنَّہَا بَقَرَۃٌ لَّا فَارِضٌ وَّ لَا بِکۡرٌ ؕ عَوَانٌۢ بَیۡنَ ذٰلِکَ ؕ فَافۡعَلُوۡا مَا تُؤۡمَرُوۡنَ ﴿۶۸﴾",
                    "قَالُوا ادۡعُ لَنَا رَبَّکَ یُبَیِّنۡ لَّنَا مَا لَوۡنُہَا ؕ قَالَ  اِنَّہٗ یَقُوۡلُ  اِنَّہَا بَقَرَۃٌ صَفۡرَآءُ ۙ فَاقِعٌ لَّوۡنُہَا تَسُرُّ النّٰظِرِیۡنَ ﴿۶۹﴾",
                    "قَالُوا ادۡعُ لَنَا رَبَّکَ یُبَیِّنۡ لَّنَا مَا ہِیَ ۙ اِنَّ الۡبَقَرَ تَشٰبَہَ عَلَیۡنَا ؕ وَ  اِنَّاۤ اِنۡ شَآءَ  اللّٰہُ  لَمُہۡتَدُوۡنَ ﴿۷۰﴾",
                    "قَالَ اِنَّہٗ یَقُوۡلُ  اِنَّہَا بَقَرَۃٌ لَّا ذَلُوۡلٌ تُثِیۡرُ الۡاَرۡضَ وَ لَا تَسۡقِی الۡحَرۡثَ ۚ مُسَلَّمَۃٌ لَّا شِیَۃَ فِیۡہَا ؕ قَالُوا الۡـٰٔنَ جِئۡتَ بِالۡحَقِّ ؕ فَذَبَحُوۡہَا وَ مَا کَادُوۡا یَفۡعَلُوۡنَ ﴿٪۷۱﴾",
                    "وَ اِذۡ قَتَلۡتُمۡ نَفۡسًا فَادّٰرَءۡتُمۡ فِیۡہَا ؕ وَ اللّٰہُ مُخۡرِجٌ مَّا کُنۡتُمۡ تَکۡتُمُوۡنَ ﴿ۚ۷۲﴾",
                    "فَقُلۡنَا اضۡرِبُوۡہُ بِبَعۡضِہَا ؕ کَذٰلِکَ یُحۡیِ اللّٰہُ  الۡمَوۡتٰی ۙ وَ یُرِیۡکُمۡ اٰیٰتِہٖ لَعَلَّکُمۡ تَعۡقِلُوۡنَ ﴿۷۳﴾",
                    "ثُمَّ قَسَتۡ قُلُوۡبُکُمۡ مِّنۡۢ بَعۡدِ ذٰلِکَ فَہِیَ کَالۡحِجَارَۃِ اَوۡ اَشَدُّ قَسۡوَۃً ؕ وَ  اِنَّ مِنَ الۡحِجَارَۃِ لَمَا یَتَفَجَّرُ  مِنۡہُ الۡاَنۡہٰرُ ؕ وَ اِنَّ مِنۡہَا لَمَا یَشَّقَّقُ فَیَخۡرُجُ مِنۡہُ الۡمَآءُ ؕ وَ اِنَّ مِنۡہَا لَمَا یَہۡبِطُ مِنۡ خَشۡیَۃِ اللّٰہِ  ؕوَ مَا اللّٰہُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ ﴿۷۴﴾",
                    "اَفَتَطۡمَعُوۡنَ اَنۡ یُّؤۡمِنُوۡا لَکُمۡ وَ قَدۡ کَانَ فَرِیۡقٌ مِّنۡہُمۡ یَسۡمَعُوۡنَ کَلٰمَ اللّٰہِ ثُمَّ یُحَرِّفُوۡنَہٗ مِنۡۢ بَعۡدِ مَا عَقَلُوۡہُ وَ ہُمۡ یَعۡلَمُوۡنَ ﴿۷۵﴾",
                    "وَ اِذَا لَقُوا الَّذِیۡنَ اٰمَنُوۡا قَالُوۡۤا اٰمَنَّا   ۚۖ وَ اِذَا خَلَا بَعۡضُہُمۡ  اِلٰی بَعۡضٍ قَالُوۡۤا اَتُحَدِّثُوۡنَہُمۡ بِمَا فَتَحَ اللّٰہُ عَلَیۡکُمۡ لِیُحَآجُّوۡکُمۡ بِہٖ عِنۡدَ رَبِّکُمۡ ؕ اَفَلَا تَعۡقِلُوۡنَ ﴿۷۶﴾",
                    "اَ وَ لَا یَعۡلَمُوۡنَ اَنَّ اللّٰہَ یَعۡلَمُ مَا یُسِرُّوۡنَ وَ مَا یُعۡلِنُوۡنَ ﴿۷۷﴾",
                    "وَ مِنۡہُمۡ اُمِّیُّوۡنَ لَا یَعۡلَمُوۡنَ الۡکِتٰبَ اِلَّاۤ اَمَانِیَّ وَ اِنۡ ہُمۡ  اِلَّا یَظُنُّوۡنَ ﴿۷۸﴾",
                    "فَوَیۡلٌ لِّلَّذِیۡنَ یَکۡتُبُوۡنَ الۡکِتٰبَ بِاَیۡدِیۡہِمۡ ٭ ثُمَّ یَقُوۡلُوۡنَ ہٰذَا مِنۡ عِنۡدِ اللّٰہِ  لِیَشۡتَرُوۡا بِہٖ ثَمَنًا قَلِیۡلًا ؕ فَوَیۡلٌ لَّہُمۡ  مِّمَّا کَتَبَتۡ اَیۡدِیۡہِمۡ وَ وَیۡلٌ لَّہُمۡ مِّمَّا یَکۡسِبُوۡنَ ﴿۷۹﴾",
                    "وَ قَالُوۡا لَنۡ تَمَسَّنَا النَّارُ اِلَّاۤ اَیَّامًا مَّعۡدُوۡدَۃً ؕ قُلۡ اَتَّخَذۡتُمۡ عِنۡدَ اللّٰہِ عَہۡدًا فَلَنۡ یُّخۡلِفَ اللّٰہُ عَہۡدَہٗۤ اَمۡ تَقُوۡلُوۡنَ عَلَی اللّٰہِ مَا لَا تَعۡلَمُوۡنَ ﴿۸۰﴾",
                    "بَلٰی مَنۡ کَسَبَ سَیِّئَۃً وَّ اَحَاطَتۡ بِہٖ خَطِیۡٓــَٔتُہٗ فَاُولٰٓئِکَ اَصۡحٰبُ النَّارِ ۚ ہُمۡ فِیۡہَا خٰلِدُوۡنَ ﴿۸۱﴾",
                    "وَ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ اُولٰٓئِکَ اَصۡحٰبُ الۡجَنَّۃِ ۚ ہُمۡ  فِیۡہَا خٰلِدُوۡنَ ﴿٪۸۲﴾",
                    "وَ اِذۡ اَخَذۡنَا مِیۡثَاقَ بَنِیۡۤ اِسۡرَآءِیۡلَ لَا تَعۡبُدُوۡنَ اِلَّا اللّٰہَ ۟ وَ بِالۡوَالِدَیۡنِ اِحۡسَانًا وَّ ذِی ‌الۡقُرۡبٰی وَ الۡیَتٰمٰی وَ الۡمَسٰکِیۡنِ وَ قُوۡلُوۡا لِلنَّاسِ حُسۡنًا وَّ اَقِیۡمُوا الصَّلٰوۃَ وَ اٰتُوا الزَّکٰوۃَ ؕ ثُمَّ تَوَلَّیۡتُمۡ  اِلَّا قَلِیۡلًا مِّنۡکُمۡ وَ اَنۡتُمۡ مُّعۡرِضُوۡنَ ﴿۸۳﴾",
                    "وَ اِذۡ  اَخَذۡنَا مِیۡثَاقَکُمۡ لَا تَسۡفِکُوۡنَ دِمَآءَکُمۡ وَ لَا تُخۡرِجُوۡنَ اَنۡفُسَکُمۡ مِّنۡ دِیَارِکُمۡ ثُمَّ  اَقۡرَرۡتُمۡ  وَ اَنۡتُمۡ تَشۡہَدُوۡنَ ﴿۸۴﴾",
                    "ثُمَّ  اَنۡتُمۡ  ہٰۤـؤُلَآءِ تَقۡتُلُوۡنَ اَنۡفُسَکُمۡ  وَ تُخۡرِجُوۡنَ فَرِیۡقًا مِّنۡکُمۡ مِّنۡ دِیَارِہِمۡ ۫ تَظٰہَرُوۡنَ عَلَیۡہِمۡ بِالۡاِثۡمِ وَ الۡعُدۡوَانِ ؕ وَ اِنۡ یَّاۡتُوۡکُمۡ اُسٰرٰی تُفٰدُوۡہُمۡ  وَ ہُوَ مُحَرَّمٌ عَلَیۡکُمۡ اِخۡرَاجُہُمۡ  ؕ اَفَتُؤۡمِنُوۡنَ بِبَعۡضِ الۡکِتٰبِ وَ تَکۡفُرُوۡنَ بِبَعۡضٍ ۚ فَمَا جَزَآءُ  مَنۡ یَّفۡعَلُ ذٰلِکَ مِنۡکُمۡ اِلَّا خِزۡیٌ فِی الۡحَیٰوۃِ الدُّنۡیَا ۚ وَ یَوۡمَ الۡقِیٰمَۃِ یُرَدُّوۡنَ اِلٰۤی اَشَدِّ الۡعَذَابِ ؕ وَ مَا اللّٰہُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ ﴿۸۵﴾",
                    "اُولٰٓئِکَ الَّذِیۡنَ اشۡتَرَوُا الۡحَیٰوۃَ الدُّنۡیَا بِالۡاٰخِرَۃِ ۫ فَلَا یُخَفَّفُ عَنۡہُمُ الۡعَذَابُ وَ لَا ہُمۡ یُنۡصَرُوۡنَ ﴿٪۸۶﴾",
                    "وَ لَقَدۡ اٰتَیۡنَا مُوۡسَی الۡکِتٰبَ وَ قَفَّیۡنَا مِنۡۢ بَعۡدِہٖ بِالرُّسُلِ ۫ وَ اٰتَیۡنَا عِیۡسَی ابۡنَ مَرۡیَمَ الۡبَیِّنٰتِ وَ اَیَّدۡنٰہُ بِرُوۡحِ الۡقُدُسِ ؕ اَفَکُلَّمَا جَآءَکُمۡ رَسُوۡلٌۢ بِمَا لَا تَہۡوٰۤی اَنۡفُسُکُمُ اسۡتَکۡبَرۡتُمۡ ۚ  فَفَرِیۡقًا کَذَّبۡتُمۡ  ۫ وَ فَرِیۡقًا تَقۡتُلُوۡنَ ﴿۸۷﴾",
                    "وَ قَالُوۡا قُلُوۡبُنَا غُلۡفٌ ؕ بَلۡ لَّعَنَہُمُ اللّٰہُ بِکُفۡرِہِمۡ  فَقَلِیۡلًا مَّا یُؤۡمِنُوۡنَ ﴿۸۸﴾",
                    "وَ لَمَّا جَآءَہُمۡ کِتٰبٌ مِّنۡ عِنۡدِ اللّٰہِ مُصَدِّقٌ لِّمَا مَعَہُمۡ  ۙ وَ کَانُوۡا مِنۡ قَبۡلُ یَسۡتَفۡتِحُوۡنَ عَلَی الَّذِیۡنَ کَفَرُوۡا ۚۖ فَلَمَّا جَآءَہُمۡ مَّا عَرَفُوۡا کَفَرُوۡا بِہٖ ۫ فَلَعۡنَۃُ اللّٰہِ عَلَی الۡکٰفِرِیۡنَ ﴿۸۹﴾",
                    "بِئۡسَمَا اشۡتَرَوۡا بِہٖۤ اَنۡفُسَہُمۡ  اَنۡ یَّکۡفُرُوۡا بِمَاۤ  اَنۡزَلَ اللّٰہُ  بَغۡیًا اَنۡ یُّنَزِّلَ اللّٰہُ مِنۡ فَضۡلِہٖ عَلٰی مَنۡ یَّشَآءُ مِنۡ عِبَادِہٖ ۚ فَبَآءُوۡ بِغَضَبٍ عَلٰی غَضَبٍ ؕ وَ  لِلۡکٰفِرِیۡنَ عَذَابٌ مُّہِیۡنٌ ﴿۹۰﴾",
                    "وَ اِذَا قِیۡلَ لَہُمۡ  اٰمِنُوۡا بِمَاۤ اَنۡزَلَ اللّٰہُ قَالُوۡا نُؤۡمِنُ بِمَاۤ  اُنۡزِلَ عَلَیۡنَا وَ یَکۡفُرُوۡنَ بِمَا وَرَآءَہٗ ٭ وَ ہُوَ الۡحَقُّ مُصَدِّقًا لِّمَا مَعَہُمۡ  ؕ قُلۡ فَلِمَ تَقۡتُلُوۡنَ اَنۡۢبِیَآءَ اللّٰہِ مِنۡ قَبۡلُ اِنۡ کُنۡتُمۡ مُّؤۡمِنِیۡنَ ﴿۹۱﴾",
                    "وَ لَقَدۡ جَآءَکُمۡ مُّوۡسٰی بِالۡبَیِّنٰتِ ثُمَّ اتَّخَذۡتُمُ الۡعِجۡلَ مِنۡۢ بَعۡدِہٖ وَ اَنۡتُمۡ ظٰلِمُوۡنَ ﴿۹۲﴾",
                    "وَ اِذۡ اَخَذۡنَا مِیۡثَاقَکُمۡ وَ رَفَعۡنَا فَوۡقَکُمُ الطُّوۡرَ ؕ خُذُوۡا مَاۤ اٰتَیۡنٰکُمۡ بِقُوَّۃٍ وَّ اسۡمَعُوۡا ؕ قَالُوۡا سَمِعۡنَا وَ عَصَیۡنَا ٭ وَ اُشۡرِبُوۡا فِیۡ قُلُوۡبِہِمُ الۡعِجۡلَ بِکُفۡرِہِمۡ ؕ قُلۡ بِئۡسَمَا یَاۡمُرُکُمۡ بِہٖۤ  اِیۡمَانُکُمۡ   اِنۡ  کُنۡتُمۡ مُّؤۡمِنِیۡنَ ﴿۹۳﴾",
                    "قُلۡ  اِنۡ کَانَتۡ لَکُمُ الدَّارُ الۡاٰخِرَۃُ عِنۡدَ اللّٰہِ خَالِصَۃً مِّنۡ دُوۡنِ النَّاسِ فَتَمَنَّوُا الۡمَوۡتَ اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۹۴﴾",
                    "وَ لَنۡ یَّتَمَنَّوۡہُ اَبَدًۢا بِمَا قَدَّمَتۡ اَیۡدِیۡہِمۡ ؕ وَ اللّٰہُ عَلِیۡمٌۢ بِالظّٰلِمِیۡنَ ﴿۹۵﴾",
                    "وَ لَتَجِدَنَّہُمۡ اَحۡرَصَ النَّاسِ عَلٰی حَیٰوۃٍ  ۚۛ وَ مِنَ الَّذِیۡنَ اَشۡرَکُوۡا  ۚۛ یَوَدُّ  اَحَدُہُمۡ لَوۡ یُعَمَّرُ اَلۡفَ سَنَۃٍ ۚ وَ مَا ہُوَ بِمُزَحۡزِحِہٖ مِنَ الۡعَذَابِ اَنۡ یُّعَمَّرَ ؕ وَ اللّٰہُ  بَصِیۡرٌۢ بِمَا یَعۡمَلُوۡنَ ﴿٪۹۶﴾",
                    "قُلۡ مَنۡ کَانَ عَدُوًّا لِّجِبۡرِیۡلَ فَاِنَّہٗ نَزَّلَہٗ عَلٰی قَلۡبِکَ بِاِذۡنِ اللّٰہِ مُصَدِّقًا لِّمَا بَیۡنَ یَدَیۡہِ وَ ہُدًی وَّ بُشۡرٰی لِلۡمُؤۡمِنِیۡنَ ﴿۹۷﴾",
                    "مَنۡ کَانَ عَدُوًّا  لِّلّٰہِ وَ مَلٰٓئِکَتِہٖ وَ رُسُلِہٖ وَ جِبۡرِیۡلَ وَ مِیۡکٰٮلَ فَاِنَّ اللّٰہَ عَدُوٌّ  لِّلۡکٰفِرِیۡنَ ﴿۹۸﴾",
                    "وَ لَقَدۡ اَنۡزَلۡنَاۤ اِلَیۡکَ اٰیٰتٍۭ بَیِّنٰتٍ ۚ وَ مَا یَکۡفُرُ بِہَاۤ  اِلَّا الۡفٰسِقُوۡنَ ﴿۹۹﴾",
                    "اَوَ کُلَّمَا عٰہَدُوۡا عَہۡدًا نَّبَذَہٗ فَرِیۡقٌ مِّنۡہُمۡ ؕ بَلۡ اَکۡثَرُہُمۡ  لَا یُؤۡمِنُوۡنَ ﴿۱۰۰﴾",
                    "وَ لَمَّا جَآءَہُمۡ  رَسُوۡلٌ مِّنۡ عِنۡدِ اللّٰہِ مُصَدِّقٌ لِّمَا مَعَہُمۡ نَبَذَ فَرِیۡقٌ مِّنَ الَّذِیۡنَ اُوۡتُوا الۡکِتٰبَ ٭ۙ کِتٰبَ اللّٰہِ وَرَآءَ  ظُہُوۡرِہِمۡ کَاَنَّہُمۡ لَا  یَعۡلَمُوۡنَ ﴿۱۰۱﴾۫",
                    "وَ اتَّبَعُوۡا مَا تَتۡلُوا الشَّیٰطِیۡنُ عَلٰی مُلۡکِ سُلَیۡمٰنَ ۚ وَ مَا کَفَرَ سُلَیۡمٰنُ وَ لٰکِنَّ الشَّیٰطِیۡنَ کَفَرُوۡا یُعَلِّمُوۡنَ النَّاسَ السِّحۡرَ ٭ وَ مَاۤ اُنۡزِلَ عَلَی الۡمَلَکَیۡنِ بِبَابِلَ ہَارُوۡتَ  وَ مَارُوۡتَ ؕ وَ مَا یُعَلِّمٰنِ مِنۡ اَحَدٍ حَتّٰی یَقُوۡلَاۤ اِنَّمَا نَحۡنُ فِتۡنَۃٌ فَلَا تَکۡفُرۡ ؕ فَیَتَعَلَّمُوۡنَ مِنۡہُمَا مَا یُفَرِّقُوۡنَ بِہٖ بَیۡنَ الۡمَرۡءِ  وَ زَوۡجِہٖ ؕ وَ مَا ہُمۡ  بِضَآرِّیۡنَ بِہٖ مِنۡ اَحَدٍ  اِلَّا بِاِذۡنِ اللّٰہِ ؕ وَ یَتَعَلَّمُوۡنَ مَا یَضُرُّہُمۡ  وَ لَا یَنۡفَعُہُمۡ  ؕ وَ لَقَدۡ عَلِمُوۡا لَمَنِ اشۡتَرٰٮہُ مَا لَہٗ فِی الۡاٰخِرَۃِ مِنۡ خَلَاقٍ ۟ؕ وَ لَبِئۡسَ مَا شَرَوۡا بِہٖۤ  اَنۡفُسَہُمۡ  ؕ لَوۡ کَانُوۡا یَعۡلَمُوۡنَ ﴿۱۰۲﴾",
                    "وَ لَوۡ اَنَّہُمۡ اٰمَنُوۡا وَ اتَّقَوۡا لَمَثُوۡبَۃٌ مِّنۡ عِنۡدِ اللّٰہِ خَیۡرٌ ؕ  لَوۡ کَانُوۡا یَعۡلَمُوۡنَ ﴿۱۰۳﴾٪",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تَقُوۡلُوۡا رَاعِنَا وَ قُوۡلُوا انۡظُرۡنَا وَ اسۡمَعُوۡا ؕ  وَ لِلۡکٰفِرِیۡنَ عَذَابٌ اَلِیۡمٌ ﴿۱۰۴﴾",
                    "مَا یَوَدُّ الَّذِیۡنَ کَفَرُوۡا مِنۡ اَہۡلِ الۡکِتٰبِ وَ لَا الۡمُشۡرِکِیۡنَ اَنۡ یُّنَزَّلَ عَلَیۡکُمۡ مِّنۡ خَیۡرٍ مِّنۡ رَّبِّکُمۡ ؕ وَ اللّٰہُ یَخۡتَصُّ بِرَحۡمَتِہٖ مَنۡ یَّشَآءُ ؕ وَ اللّٰہُ ذُو الۡفَضۡلِ الۡعَظِیۡمِ ﴿۱۰۵﴾",
                    "مَا نَنۡسَخۡ مِنۡ اٰیَۃٍ اَوۡ نُنۡسِہَا نَاۡتِ بِخَیۡرٍ مِّنۡہَاۤ  اَوۡ مِثۡلِہَا ؕ اَلَمۡ تَعۡلَمۡ اَنَّ اللّٰہَ عَلٰی کُلِّ شَیۡءٍ  قَدِیۡرٌ ﴿۱۰۶﴾",
                    "اَلَمۡ تَعۡلَمۡ اَنَّ اللّٰہَ لَہٗ  مُلۡکُ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ وَ مَا لَکُمۡ مِّنۡ دُوۡنِ اللّٰہِ مِنۡ وَّلِیٍّ وَّ لَا نَصِیۡرٍ ﴿۱۰۷﴾",
                    "اَمۡ  تُرِیۡدُوۡنَ اَنۡ تَسۡـَٔلُوۡا رَسُوۡلَکُمۡ کَمَا سُئِلَ مُوۡسٰی مِنۡ قَبۡلُ ؕ وَ مَنۡ یَّتَبَدَّلِ الۡکُفۡرَ بِالۡاِیۡمَانِ فَقَدۡ ضَلَّ سَوَآءَ  السَّبِیۡلِ ﴿۱۰۸﴾",
                    "وَدَّ کَثِیۡرٌ مِّنۡ اَہۡلِ الۡکِتٰبِ لَوۡ یَرُدُّوۡنَکُمۡ مِّنۡۢ بَعۡدِ اِیۡمَانِکُمۡ کُفَّارًا ۚۖ حَسَدًا مِّنۡ عِنۡدِ اَنۡفُسِہِمۡ مِّنۡۢ بَعۡدِ مَا تَبَیَّنَ لَہُمُ الۡحَقُّ ۚ فَاعۡفُوۡا وَ اصۡفَحُوۡا حَتّٰی یَاۡتِیَ اللّٰہُ بِاَمۡرِہٖ ؕ اِنَّ اللّٰہَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿۱۰۹﴾",
                    "وَ اَقِیۡمُوا الصَّلٰوۃَ وَ اٰتُوا الزَّکٰوۃَ ؕ وَ مَا تُقَدِّمُوۡا لِاَنۡفُسِکُمۡ مِّنۡ خَیۡرٍ تَجِدُوۡہُ عِنۡدَ اللّٰہِ ؕ اِنَّ اللّٰہَ بِمَا تَعۡمَلُوۡنَ بَصِیۡرٌ ﴿۱۱۰﴾",
                    "وَ قَالُوۡا لَنۡ یَّدۡخُلَ الۡجَنَّۃَ اِلَّا مَنۡ کَانَ ہُوۡدًا اَوۡ نَصٰرٰی ؕ تِلۡکَ اَمَانِیُّہُمۡ ؕ قُلۡ ہَاتُوۡا بُرۡہَانَکُمۡ  اِنۡ کُنۡتُمۡ صٰدِقِیۡنَ ﴿۱۱۱﴾",
                    "بَلٰی ٭  مَنۡ اَسۡلَمَ وَجۡہَہٗ  لِلّٰہِ وَ ہُوَ  مُحۡسِنٌ فَلَہٗۤ اَجۡرُہٗ عِنۡدَ رَبِّہٖ ۪ وَ لَا خَوۡفٌ عَلَیۡہِمۡ  وَ لَا ہُمۡ  یَحۡزَنُوۡنَ ﴿۱۱۲﴾٪",
                    "وَ قَالَتِ الۡیَہُوۡدُ  لَیۡسَتِ النَّصٰرٰی عَلٰی شَیۡءٍ ۪ وَّ قَالَتِ النَّصٰرٰی لَیۡسَتِ الۡیَہُوۡدُ عَلٰی شَیۡءٍ ۙ وَّ ہُمۡ یَتۡلُوۡنَ الۡکِتٰبَ ؕ کَذٰلِکَ قَالَ الَّذِیۡنَ لَا یَعۡلَمُوۡنَ مِثۡلَ قَوۡلِہِمۡ ۚ فَاللّٰہُ یَحۡکُمُ بَیۡنَہُمۡ یَوۡمَ الۡقِیٰمَۃِ فِیۡمَا کَانُوۡا فِیۡہِ یَخۡتَلِفُوۡنَ ﴿۱۱۳﴾",
                    "وَ مَنۡ اَظۡلَمُ  مِمَّنۡ مَّنَعَ مَسٰجِدَ اللّٰہِ اَنۡ یُّذۡکَرَ فِیۡہَا اسۡمُہٗ وَ سَعٰی فِیۡ خَرَابِہَا ؕ اُولٰٓئِکَ مَا کَانَ لَہُمۡ اَنۡ یَّدۡخُلُوۡہَاۤ اِلَّا خَآئِفِیۡنَ ۬ؕ لَہُمۡ  فِی الدُّنۡیَا خِزۡیٌ وَّ لَہُمۡ فِی الۡاٰخِرَۃِ عَذَابٌ عَظِیۡمٌ ﴿۱۱۴﴾",
                    "وَ  لِلّٰہِ الۡمَشۡرِقُ وَ الۡمَغۡرِبُ ٭ فَاَیۡنَمَا تُوَلُّوۡا فَثَمَّ وَجۡہُ اللّٰہِ ؕ اِنَّ اللّٰہَ وَاسِعٌ عَلِیۡمٌ ﴿۱۱۵﴾",
                    "وَ قَالُوا اتَّخَذَ اللّٰہُ وَلَدًا ۙ سُبۡحٰنَہٗ ؕ بَلۡ لَّہٗ مَا فِی السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ کُلٌّ لَّہٗ قٰنِتُوۡنَ ﴿۱۱۶﴾",
                    "بَدِیۡعُ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ وَ  اِذَا قَضٰۤی اَمۡرًا فَاِنَّمَا یَقُوۡلُ لَہٗ  کُنۡ فَیَکُوۡنُ ﴿۱۱۷﴾",
                    "وَ قَالَ الَّذِیۡنَ لَا یَعۡلَمُوۡنَ لَوۡ لَا یُکَلِّمُنَا اللّٰہُ  اَوۡ تَاۡتِیۡنَاۤ  اٰیَۃٌ  ؕ کَذٰلِکَ قَالَ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ  مِّثۡلَ قَوۡلِہِمۡ  ؕ تَشَابَہَتۡ قُلُوۡبُہُمۡ ؕ قَدۡ بَیَّنَّا الۡاٰیٰتِ لِقَوۡمٍ  یُّوۡقِنُوۡنَ ﴿۱۱۸﴾",
                    "اِنَّاۤ اَرۡسَلۡنٰکَ بِالۡحَقِّ بَشِیۡرًا وَّ نَذِیۡرًا ۙ وَّ لَا  تُسۡئَلُ عَنۡ  اَصۡحٰبِ  الۡجَحِیۡمِ ﴿۱۱۹﴾",
                    "وَ لَنۡ تَرۡضٰی عَنۡکَ الۡیَہُوۡدُ وَ لَا النَّصٰرٰی حَتّٰی تَتَّبِعَ مِلَّتَہُمۡ ؕ قُلۡ اِنَّ ہُدَی اللّٰہِ ہُوَ  الۡہُدٰی ؕ وَ لَئِنِ اتَّبَعۡتَ اَہۡوَآءَہُمۡ بَعۡدَ الَّذِیۡ جَآءَکَ مِنَ الۡعِلۡمِ ۙ مَا لَکَ مِنَ اللّٰہِ مِنۡ وَّلِیٍّ وَّ لَا نَصِیۡرٍ ﴿۱۲۰﴾ؔ",
                    "اَلَّذِیۡنَ اٰتَیۡنٰہُمُ الۡکِتٰبَ یَتۡلُوۡنَہٗ حَقَّ تِلَاوَتِہٖ ؕ اُولٰٓئِکَ یُؤۡمِنُوۡنَ بِہٖ ؕ وَ مَنۡ یَّکۡفُرۡ بِہٖ فَاُولٰٓئِکَ ہُمُ  الۡخٰسِرُوۡنَ ﴿۱۲۱﴾٪",
                    "یٰبَنِیۡۤ  اِسۡرَآءِیۡلَ اذۡکُرُوۡا نِعۡمَتِیَ الَّتِیۡۤ  اَنۡعَمۡتُ عَلَیۡکُمۡ وَ اَنِّیۡ فَضَّلۡتُکُمۡ عَلَی الۡعٰلَمِیۡنَ ﴿۱۲۲﴾",
                    "وَ اتَّقُوۡا یَوۡمًا لَّا تَجۡزِیۡ نَفۡسٌ عَنۡ نَّفۡسٍ شَیۡئًا وَّ لَا یُقۡبَلُ مِنۡہَا عَدۡلٌ وَّ لَا تَنۡفَعُہَا شَفَاعَۃٌ  وَّ لَا ہُمۡ یُنۡصَرُوۡنَ ﴿۱۲۳﴾",
                    "وَ اِذِ ابۡتَلٰۤی  اِبۡرٰہٖمَ  رَبُّہٗ بِکَلِمٰتٍ فَاَتَمَّہُنَّ ؕ قَالَ اِنِّیۡ جَاعِلُکَ لِلنَّاسِ  اِمَامًا ؕ قَالَ وَ مِنۡ ذُرِّیَّتِیۡ ؕ قَالَ لَا یَنَالُ عَہۡدِی الظّٰلِمِیۡنَ ﴿۱۲۴﴾",
                    "وَ اِذۡ جَعَلۡنَا الۡبَیۡتَ مَثَابَۃً لِّلنَّاسِ وَ اَمۡنًا ؕ وَ اتَّخِذُوۡا مِنۡ مَّقَامِ اِبۡرٰہٖمَ مُصَلًّی ؕ وَ عَہِدۡنَاۤ اِلٰۤی اِبۡرٰہٖمَ  وَ اِسۡمٰعِیۡلَ اَنۡ طَہِّرَا بَیۡتِیَ  لِلطَّآئِفِیۡنَ وَ الۡعٰکِفِیۡنَ وَ الرُّکَّعِ  السُّجُوۡدِ ﴿۱۲۵﴾",
                    "وَ اِذۡ قَالَ  اِبۡرٰہٖمُ  رَبِّ اجۡعَلۡ ہٰذَا بَلَدًا اٰمِنًا وَّ ارۡزُقۡ اَہۡلَہٗ مِنَ الثَّمَرٰتِ مَنۡ اٰمَنَ مِنۡہُمۡ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ ؕ قَالَ وَ مَنۡ کَفَرَ فَاُمَتِّعُہٗ قَلِیۡلًا ثُمَّ  اَضۡطَرُّہٗۤ اِلٰی عَذَابِ النَّارِ ؕ وَ بِئۡسَ الۡمَصِیۡرُ ﴿۱۲۶﴾",
                    "وَ اِذۡ یَرۡفَعُ  اِبۡرٰہٖمُ  الۡقَوَاعِدَ مِنَ الۡبَیۡتِ وَ اِسۡمٰعِیۡلُ ؕ رَبَّنَا تَقَبَّلۡ مِنَّا ؕ اِنَّکَ اَنۡتَ السَّمِیۡعُ الۡعَلِیۡمُ ﴿۱۲۷﴾",
                    "رَبَّنَا وَ اجۡعَلۡنَا مُسۡلِمَیۡنِ لَکَ وَ مِنۡ ذُرِّیَّتِنَاۤ اُمَّۃً مُّسۡلِمَۃً  لَّکَ ۪ وَ اَرِنَا مَنَاسِکَنَا وَ تُبۡ عَلَیۡنَا ۚ اِنَّکَ اَنۡتَ التَّوَّابُ الرَّحِیۡمُ ﴿۱۲۸﴾",
                    "رَبَّنَا وَ ابۡعَثۡ فِیۡہِمۡ رَسُوۡلًا مِّنۡہُمۡ یَتۡلُوۡا عَلَیۡہِمۡ اٰیٰتِکَ وَ یُعَلِّمُہُمُ الۡکِتٰبَ وَ الۡحِکۡمَۃَ وَ یُزَکِّیۡہِمۡ ؕ اِنَّکَ اَنۡتَ الۡعَزِیۡزُ الۡحَکِیۡمُ ﴿۱۲۹﴾٪",
                    "وَ مَنۡ یَّرۡغَبُ عَنۡ مِّلَّۃِ  اِبۡرٰہٖمَ  اِلَّا مَنۡ سَفِہَ نَفۡسَہٗ ؕ وَ لَقَدِ اصۡطَفَیۡنٰہُ فِی الدُّنۡیَا ۚ وَ اِنَّہٗ فِی الۡاٰخِرَۃِ  لَمِنَ الصّٰلِحِیۡنَ ﴿۱۳۰﴾",
                    "اِذۡ قَالَ لَہٗ رَبُّہٗۤ  اَسۡلِمۡ ۙ قَالَ اَسۡلَمۡتُ لِرَبِّ الۡعٰلَمِیۡنَ ﴿۱۳۱﴾",
                    "وَ وَصّٰی بِہَاۤ اِبۡرٰہٖمُ  بَنِیۡہِ وَ یَعۡقُوۡبُ ؕ یٰبَنِیَّ  اِنَّ اللّٰہَ اصۡطَفٰی لَکُمُ الدِّیۡنَ فَلَا تَمُوۡتُنَّ  اِلَّا وَ اَنۡتُمۡ  مُّسۡلِمُوۡنَ ﴿۱۳۲﴾ؕ",
                    "اَمۡ کُنۡتُمۡ  شُہَدَآءَ  اِذۡ حَضَرَ یَعۡقُوۡبَ الۡمَوۡتُ ۙ اِذۡ  قَالَ لِبَنِیۡہِ مَا تَعۡبُدُوۡنَ مِنۡۢ بَعۡدِیۡ ؕ قَالُوۡا نَعۡبُدُ اِلٰہَکَ وَ اِلٰـہَ اٰبَآئِکَ اِبۡرٰہٖمَ  وَ  اِسۡمٰعِیۡلَ وَ  اِسۡحٰقَ  اِلٰـہًا وَّاحِدًا ۚۖ وَّ نَحۡنُ لَہٗ مُسۡلِمُوۡنَ ﴿۱۳۳﴾",
                    "تِلۡکَ اُمَّۃٌ قَدۡ خَلَتۡ ۚ لَہَا مَا کَسَبَتۡ وَ لَکُمۡ مَّا کَسَبۡتُمۡ ۚ وَ لَا تُسۡـَٔلُوۡنَ عَمَّا  کَانُوۡا یَعۡمَلُوۡنَ ﴿۱۳۴﴾",
                    "وَ قَالُوۡا کُوۡنُوۡا ہُوۡدًا اَوۡ نَصٰرٰی تَہۡتَدُوۡا ؕ قُلۡ بَلۡ مِلَّۃَ  اِبۡرٰہٖمَ  حَنِیۡفًا ؕ وَ مَا کَانَ مِنَ الۡمُشۡرِکِیۡنَ ﴿۱۳۵﴾",
                    "قُوۡلُوۡۤا اٰمَنَّا بِاللّٰہِ وَ مَاۤ اُنۡزِلَ اِلَیۡنَا وَ مَاۤ اُنۡزِلَ  اِلٰۤی  اِبۡرٰہٖمَ  وَ  اِسۡمٰعِیۡلَ وَ  اِسۡحٰقَ وَ یَعۡقُوۡبَ وَ الۡاَسۡبَاطِ وَ مَاۤ اُوۡتِیَ مُوۡسٰی وَ عِیۡسٰی وَ مَاۤ اُوۡتِیَ النَّبِیُّوۡنَ مِنۡ  رَّبِّہِمۡ ۚ  لَا نُفَرِّقُ بَیۡنَ اَحَدٍ مِّنۡہُمۡ ۫ۖ وَ نَحۡنُ لَہٗ مُسۡلِمُوۡنَ ﴿۱۳۶﴾",
                    "فَاِنۡ اٰمَنُوۡا بِمِثۡلِ مَاۤ  اٰمَنۡتُمۡ  بِہٖ فَقَدِ اہۡتَدَوۡا ۚ وَ اِنۡ تَوَلَّوۡا فَاِنَّمَا ہُمۡ فِیۡ شِقَاقٍ ۚ فَسَیَکۡفِیۡکَہُمُ اللّٰہُ ۚ وَ ہُوَ السَّمِیۡعُ  الۡعَلِیۡمُ ﴿۱۳۷﴾ؕ",
                    "صِبۡغَۃَ اللّٰہِ ۚ وَ مَنۡ اَحۡسَنُ مِنَ اللّٰہِ صِبۡغَۃً  ۫ وَّ نَحۡنُ لَہٗ عٰبِدُوۡنَ ﴿۱۳۸﴾",
                    "قُلۡ اَتُحَآجُّوۡنَنَا فِی اللّٰہِ وَ ہُوَ رَبُّنَا وَ رَبُّکُمۡ ۚ وَ لَنَاۤ اَعۡمَالُنَا وَ لَکُمۡ اَعۡمَالُکُمۡ ۚ وَ نَحۡنُ لَہٗ  مُخۡلِصُوۡنَ ﴿۱۳۹﴾ۙ",
                    "اَمۡ  تَقُوۡلُوۡنَ  اِنَّ  اِبۡرٰہٖمَ  وَ اِسۡمٰعِیۡلَ وَ اِسۡحٰقَ وَ یَعۡقُوۡبَ وَ الۡاَسۡبَاطَ کَانُوۡا ہُوۡدًا اَوۡ نَصٰرٰی ؕ قُلۡ ءَاَنۡتُمۡ  اَعۡلَمُ اَمِ اللّٰہُ ؕ وَ مَنۡ اَظۡلَمُ مِمَّنۡ کَتَمَ شَہَادَۃً عِنۡدَہٗ مِنَ اللّٰہِ ؕ وَ مَا اللّٰہُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ ﴿۱۴۰﴾",
                    "تِلۡکَ اُمَّۃٌ  قَدۡ خَلَتۡ ۚ لَہَا مَا کَسَبَتۡ وَ لَکُمۡ مَّا کَسَبۡتُمۡ ۚ وَ لَا تُسۡـَٔلُوۡنَ عَمَّا  کَانُوۡا  یَعۡمَلُوۡنَ ﴿۱۴۱﴾٪",
                    "سَیَقُوۡلُ السُّفَہَآءُ مِنَ النَّاسِ مَا وَلّٰٮہُمۡ عَنۡ قِبۡلَتِہِمُ الَّتِیۡ کَانُوۡا عَلَیۡہَا ؕ قُلۡ لِّلّٰہِ الۡمَشۡرِقُ وَ الۡمَغۡرِبُ ؕ یَہۡدِیۡ مَنۡ  یَّشَآءُ  اِلٰی صِرَاطٍ مُّسۡتَقِیۡمٍ ﴿۱۴۲﴾",
                    "وَ کَذٰلِکَ جَعَلۡنٰکُمۡ اُمَّۃً وَّسَطًا لِّتَکُوۡنُوۡا شُہَدَآءَ عَلَی النَّاسِ وَ یَکُوۡنَ الرَّسُوۡلُ عَلَیۡکُمۡ شَہِیۡدًا ؕ وَ مَا جَعَلۡنَا الۡقِبۡلَۃَ الَّتِیۡ کُنۡتَ عَلَیۡہَاۤ  اِلَّا لِنَعۡلَمَ مَنۡ یَّتَّبِعُ الرَّسُوۡلَ مِمَّنۡ یَّنۡقَلِبُ عَلٰی عَقِبَیۡہِ ؕ وَ اِنۡ کَانَتۡ لَکَبِیۡرَۃً  اِلَّا عَلَی الَّذِیۡنَ ہَدَی اللّٰہُ  ؕ وَ مَا کَانَ اللّٰہُ لِیُضِیۡعَ اِیۡمَانَکُمۡ ؕ اِنَّ اللّٰہَ بِالنَّاسِ لَرَءُوۡفٌ رَّحِیۡمٌ ﴿۱۴۳﴾",
                    "قَدۡ نَرٰی تَقَلُّبَ وَجۡہِکَ فِی السَّمَآءِ ۚ فَلَنُوَلِّیَنَّکَ قِبۡلَۃً  تَرۡضٰہَا  ۪  فَوَلِّ وَجۡہَکَ شَطۡرَ الۡمَسۡجِدِ الۡحَرَامِ ؕ  وَ حَیۡثُ مَا کُنۡتُمۡ   فَوَلُّوۡا  وُجُوۡہَکُمۡ شَطۡرَہٗ ؕ وَ  اِنَّ الَّذِیۡنَ اُوۡتُوا الۡکِتٰبَ لَیَعۡلَمُوۡنَ اَنَّہُ  الۡحَقُّ مِنۡ رَّبِّہِمۡ ؕ وَ مَا اللّٰہُ بِغَافِلٍ عَمَّا یَعۡمَلُوۡنَ ﴿۱۴۴﴾",
                    "وَ لَئِنۡ اَتَیۡتَ الَّذِیۡنَ اُوۡتُوا الۡکِتٰبَ بِکُلِّ اٰیَۃٍ مَّا تَبِعُوۡا قِبۡلَتَکَ ۚ وَ مَاۤ اَنۡتَ بِتَابِعٍ قِبۡلَتَہُمۡ ۚ وَ مَا بَعۡضُہُمۡ  بِتَابِعٍ قِبۡلَۃَ بَعۡضٍ ؕ وَ لَئِنِ اتَّبَعۡتَ اَہۡوَآءَہُمۡ مِّنۡۢ بَعۡدِ مَا جَآءَکَ مِنَ الۡعِلۡمِ  ۙ اِنَّکَ اِذًا  لَّمِنَ الظّٰلِمِیۡنَ ﴿۱۴۵﴾ۘ",
                    "اَلَّذِیۡنَ اٰتَیۡنٰہُمُ الۡکِتٰبَ یَعۡرِفُوۡنَہٗ کَمَا یَعۡرِفُوۡنَ اَبۡنَآءَہُمۡ ؕ وَ اِنَّ فَرِیۡقًا مِّنۡہُمۡ لَیَکۡتُمُوۡنَ الۡحَقَّ وَ ہُمۡ یَعۡلَمُوۡنَ ﴿۱۴۶﴾ؔ",
                    "اَلۡحَقُّ  مِنۡ رَّبِّکَ فَلَا تَکُوۡنَنَّ مِنَ الۡمُمۡتَرِیۡنَ ﴿۱۴۷﴾٪",
                    "وَ  لِکُلٍّ وِّجۡہَۃٌ ہُوَ مُوَلِّیۡہَا فَاسۡتَبِقُوا الۡخَیۡرٰتِ ؕ؃ اَیۡنَ مَا تَکُوۡنُوۡا یَاۡتِ بِکُمُ اللّٰہُ جَمِیۡعًا ؕ اِنَّ اللّٰہَ عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿۱۴۸﴾",
                    "وَ مِنۡ حَیۡثُ خَرَجۡتَ فَوَلِّ وَجۡہَکَ شَطۡرَ الۡمَسۡجِدِ الۡحَرَامِ ؕ وَ اِنَّہٗ  لَلۡحَقُّ مِنۡ رَّبِّکَ ؕ وَ مَا اللّٰہُ بِغَافِلٍ عَمَّا تَعۡمَلُوۡنَ ﴿۱۴۹﴾",
                    "وَ مِنۡ حَیۡثُ خَرَجۡتَ فَوَلِّ وَجۡہَکَ شَطۡرَ الۡمَسۡجِدِ الۡحَرَامِ ؕ وَ حَیۡثُ مَا کُنۡتُمۡ  فَوَلُّوۡا وُجُوۡہَکُمۡ شَطۡرَہٗ  ۙ لِئَلَّا یَکُوۡنَ  لِلنَّاسِ عَلَیۡکُمۡ حُجَّۃٌ ٭ۙ اِلَّا الَّذِیۡنَ ظَلَمُوۡا مِنۡہُمۡ ٭ فَلَا تَخۡشَوۡہُمۡ وَ اخۡشَوۡنِیۡ ٭ وَ لِاُتِمَّ  نِعۡمَتِیۡ عَلَیۡکُمۡ وَ لَعَلَّکُمۡ تَہۡتَدُوۡنَ ﴿۱۵۰﴾ۙۛ",
                    "کَمَاۤ  اَرۡسَلۡنَا فِیۡکُمۡ رَسُوۡلًا مِّنۡکُمۡ یَتۡلُوۡا عَلَیۡکُمۡ  اٰیٰتِنَا وَ یُزَکِّیۡکُمۡ وَ یُعَلِّمُکُمُ الۡکِتٰبَ وَ الۡحِکۡمَۃَ وَ یُعَلِّمُکُمۡ مَّا لَمۡ تَکُوۡنُوۡا تَعۡلَمُوۡنَ ﴿۱۵۱﴾ؕۛ",
                    "فَاذۡکُرُوۡنِیۡۤ اَذۡکُرۡکُمۡ  وَ اشۡکُرُوۡا لِیۡ وَ لَا تَکۡفُرُوۡنِ ﴿۱۵۲﴾٪",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوا اسۡتَعِیۡنُوۡا بِالصَّبۡرِ وَ الصَّلٰوۃِ ؕ اِنَّ اللّٰہَ مَعَ الصّٰبِرِیۡنَ ﴿۱۵۳﴾",
                    "وَ لَا تَقُوۡلُوۡا لِمَنۡ یُّقۡتَلُ فِیۡ سَبِیۡلِ اللّٰہِ اَمۡوَاتٌ ؕ بَلۡ اَحۡیَآءٌ وَّ لٰکِنۡ لَّا تَشۡعُرُوۡنَ ﴿۱۵۴﴾",
                    "وَ لَنَبۡلُوَنَّکُمۡ بِشَیۡءٍ مِّنَ الۡخَوۡفِ وَ الۡجُوۡعِ وَ نَقۡصٍ مِّنَ الۡاَمۡوَالِ وَ الۡاَنۡفُسِ وَ الثَّمَرٰتِ ؕ وَ بَشِّرِ الصّٰبِرِیۡنَ ﴿۱۵۵﴾ۙ",
                    "الَّذِیۡنَ اِذَاۤ  اَصَابَتۡہُمۡ مُّصِیۡبَۃٌ  ۙ قَالُوۡۤا اِنَّا لِلّٰہِ وَ  اِنَّاۤ اِلَیۡہِ رٰجِعُوۡنَ ﴿۱۵۶﴾ؕ",
                    "اُولٰٓئِکَ عَلَیۡہِمۡ صَلَوٰتٌ مِّنۡ رَّبِّہِمۡ وَ رَحۡمَۃٌ ۟ وَ اُولٰٓئِکَ ہُمُ الۡمُہۡتَدُوۡنَ ﴿۱۵۷﴾",
                    "اِنَّ الصَّفَا وَ الۡمَرۡوَۃَ مِنۡ شَعَآئِرِ اللّٰہِ ۚ فَمَنۡ حَجَّ الۡبَیۡتَ اَوِ اعۡتَمَرَ فَلَا جُنَاحَ عَلَیۡہِ اَنۡ یَّطَّوَّفَ بِہِمَا ؕ وَ مَنۡ تَطَوَّعَ خَیۡرًا  ۙ فَاِنَّ اللّٰہَ شَاکِرٌ  عَلِیۡمٌ ﴿۱۵۸﴾",
                    "اِنَّ الَّذِیۡنَ یَکۡتُمُوۡنَ مَاۤ اَنۡزَلۡنَا مِنَ الۡبَیِّنٰتِ وَ الۡہُدٰی مِنۡۢ بَعۡدِ مَا بَیَّنّٰہُ لِلنَّاسِ فِی الۡکِتٰبِ  ۙ  اُولٰٓئِکَ یَلۡعَنُہُمُ اللّٰہُ  وَ  یَلۡعَنُہُمُ  اللّٰعِنُوۡنَ ﴿۱۵۹﴾ۙ",
                    "اِلَّا الَّذِیۡنَ تَابُوۡا وَ اَصۡلَحُوۡا وَ بَیَّنُوۡا فَاُولٰٓئِکَ اَتُوۡبُ عَلَیۡہِمۡ ۚ وَ اَنَا التَّوَّابُ الرَّحِیۡمُ ﴿۱۶۰﴾",
                    "اِنَّ الَّذِیۡنَ کَفَرُوۡا وَ مَاتُوۡا وَ ہُمۡ کُفَّارٌ اُولٰٓئِکَ عَلَیۡہِمۡ لَعۡنَۃُ اللّٰہِ وَ الۡمَلٰٓئِکَۃِ وَ النَّاسِ اَجۡمَعِیۡنَ ﴿۱۶۱﴾ۙ",
                    "خٰلِدِیۡنَ فِیۡہَا ۚ لَا یُخَفَّفُ عَنۡہُمُ الۡعَذَابُ وَ لَا ہُمۡ یُنۡظَرُوۡنَ ﴿۱۶۲﴾",
                    "وَ اِلٰـہُکُمۡ  اِلٰہٌ  وَّاحِدٌ ۚ لَاۤ اِلٰہَ اِلَّا ہُوَ الرَّحۡمٰنُ  الرَّحِیۡمُ ﴿۱۶۳﴾٪",
                    "اِنَّ فِیۡ خَلۡقِ السَّمٰوٰتِ وَ الۡاَرۡضِ وَ اخۡتِلَافِ الَّیۡلِ وَ النَّہَارِ وَ الۡفُلۡکِ الَّتِیۡ تَجۡرِیۡ فِی الۡبَحۡرِ  بِمَا یَنۡفَعُ النَّاسَ وَ مَاۤ اَنۡزَلَ اللّٰہُ مِنَ السَّمَآءِ مِنۡ مَّآءٍ فَاَحۡیَا بِہِ الۡاَرۡضَ بَعۡدَ مَوۡتِہَا وَ بَثَّ فِیۡہَا مِنۡ کُلِّ دَآبَّۃٍ  ۪ وَّ تَصۡرِیۡفِ الرِّیٰحِ وَ السَّحَابِ الۡمُسَخَّرِ بَیۡنَ السَّمَآءِ وَ الۡاَرۡضِ لَاٰیٰتٍ لِّقَوۡمٍ  یَّعۡقِلُوۡنَ ﴿۱۶۴﴾",
                    "وَ مِنَ النَّاسِ مَنۡ یَّتَّخِذُ مِنۡ دُوۡنِ اللّٰہِ اَنۡدَادًا یُّحِبُّوۡنَہُمۡ کَحُبِّ اللّٰہِ ؕ وَ الَّذِیۡنَ اٰمَنُوۡۤا اَشَدُّ حُبًّا  لِّلّٰہِ ؕوَ لَوۡ  یَرَی الَّذِیۡنَ ظَلَمُوۡۤا اِذۡ یَرَوۡنَ الۡعَذَابَ  ۙ اَنَّ الۡقُوَّۃَ لِلّٰہِ جَمِیۡعًا  ۙ وَّ اَنَّ اللّٰہَ شَدِیۡدُ الۡعَذَابِ ﴿۱۶۵﴾",
                    "اِذۡ  تَبَرَّاَ الَّذِیۡنَ اتُّبِعُوۡا مِنَ الَّذِیۡنَ اتَّبَعُوۡا  وَ رَاَوُا  الۡعَذَابَ وَ تَقَطَّعَتۡ بِہِمُ الۡاَسۡبَابُ ﴿۱۶۶﴾",
                    "وَ قَالَ الَّذِیۡنَ اتَّبَعُوۡا لَوۡ  اَنَّ لَنَا کَرَّۃً فَنَتَبَرَّاَ مِنۡہُمۡ کَمَا تَبَرَّءُوۡا مِنَّا ؕ کَذٰلِکَ یُرِیۡہِمُ اللّٰہُ  اَعۡمَالَہُمۡ حَسَرٰتٍ عَلَیۡہِمۡ ؕ وَ مَا ہُمۡ  بِخٰرِجِیۡنَ مِنَ النَّارِ ﴿۱۶۷﴾٪",
                    "یٰۤاَیُّہَا النَّاسُ کُلُوۡا مِمَّا فِی الۡاَرۡضِ حَلٰلًا طَیِّبًا ۫ۖ وَّ لَا تَتَّبِعُوۡا خُطُوٰتِ الشَّیۡطٰنِ ؕ اِنَّہٗ لَکُمۡ عَدُوٌّ مُّبِیۡنٌ ﴿۱۶۸﴾",
                    "اِنَّمَا یَاۡمُرُکُمۡ بِالسُّوۡٓءِ وَ الۡفَحۡشَآءِ وَ اَنۡ تَقُوۡلُوۡا عَلَی اللّٰہِ مَا لَا تَعۡلَمُوۡنَ ﴿۱۶۹﴾",
                    "وَ اِذَا قِیۡلَ لَہُمُ  اتَّبِعُوۡا مَاۤ اَنۡزَلَ اللّٰہُ قَالُوۡا بَلۡ نَتَّبِعُ مَاۤ اَلۡفَیۡنَا عَلَیۡہِ اٰبَآءَنَا ؕ اَوَ لَوۡ کَانَ اٰبَآؤُہُمۡ لَا یَعۡقِلُوۡنَ شَیۡئًا وَّ لَا  یَہۡتَدُوۡنَ ﴿۱۷۰﴾",
                    "وَ مَثَلُ الَّذِیۡنَ کَفَرُوۡا کَمَثَلِ الَّذِیۡ یَنۡعِقُ بِمَا لَا یَسۡمَعُ اِلَّا دُعَآءً  وَّ  نِدَآءً ؕ صُمٌّۢ  بُکۡمٌ عُمۡیٌ  فَہُمۡ  لَا  یَعۡقِلُوۡنَ ﴿۱۷۱﴾",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا کُلُوۡا مِنۡ طَیِّبٰتِ مَا رَزَقۡنٰکُمۡ وَ اشۡکُرُوۡا لِلّٰہِ  اِنۡ  کُنۡتُمۡ اِیَّاہُ  تَعۡبُدُوۡنَ ﴿۱۷۲﴾",
                    "اِنَّمَا حَرَّمَ عَلَیۡکُمُ الۡمَیۡتَۃَ وَ الدَّمَ وَ لَحۡمَ الۡخِنۡزِیۡرِ وَ مَاۤ  اُہِلَّ بِہٖ لِغَیۡرِ اللّٰہِ ۚ فَمَنِ اضۡطُرَّ غَیۡرَ بَاغٍ وَّ لَا عَادٍ فَلَاۤ اِثۡمَ عَلَیۡہِ ؕ اِنَّ اللّٰہَ  غَفُوۡرٌ  رَّحِیۡمٌ ﴿۱۷۳﴾",
                    "اِنَّ الَّذِیۡنَ یَکۡتُمُوۡنَ مَاۤ  اَنۡزَلَ اللّٰہُ مِنَ الۡکِتٰبِ وَ یَشۡتَرُوۡنَ بِہٖ ثَمَنًا قَلِیۡلًا  ۙ اُولٰٓئِکَ مَا یَاۡکُلُوۡنَ فِیۡ بُطُوۡنِہِمۡ  اِلَّا النَّارَ وَ لَا یُکَلِّمُہُمُ اللّٰہُ یَوۡمَ الۡقِیٰمَۃِ وَ لَا  یُزَکِّیۡہِمۡ ۚۖ وَ لَہُمۡ عَذَابٌ اَلِیۡمٌ ﴿۱۷۴﴾",
                    "اُولٰٓئِکَ الَّذِیۡنَ اشۡتَرَوُا الضَّلٰلَۃَ بِالۡہُدٰی وَ الۡعَذَابَ بِالۡمَغۡفِرَۃِ ۚ فَمَاۤ اَصۡبَرَہُمۡ عَلَی النَّارِ ﴿۱۷۵﴾",
                    "ذٰلِکَ بِاَنَّ اللّٰہَ نَزَّلَ الۡکِتٰبَ بِالۡحَقِّ ؕ وَ اِنَّ الَّذِیۡنَ اخۡتَلَفُوۡا فِی الۡکِتٰبِ لَفِیۡ شِقَاقٍۭ بَعِیۡدٍ ﴿۱۷۶﴾٪",
                    "لَیۡسَ الۡبِرَّ اَنۡ تُوَلُّوۡا وُجُوۡہَکُمۡ  قِبَلَ الۡمَشۡرِقِ وَ الۡمَغۡرِبِ وَ لٰکِنَّ الۡبِرَّ مَنۡ اٰمَنَ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ وَ الۡمَلٰٓئِکَۃِ وَ الۡکِتٰبِ وَ النَّبِیّٖنَ ۚ وَ اٰتَی الۡمَالَ عَلٰی حُبِّہٖ ذَوِی الۡقُرۡبٰی وَ الۡیَتٰمٰی وَ الۡمَسٰکِیۡنَ  وَ ابۡنَ السَّبِیۡلِ  ۙ وَ السَّآئِلِیۡنَ وَ فِی الرِّقَابِ ۚ وَ اَقَامَ الصَّلٰوۃَ وَ اٰتَی الزَّکٰوۃَ ۚ وَ الۡمُوۡفُوۡنَ بِعَہۡدِہِمۡ  اِذَا عٰہَدُوۡا ۚ وَ الصّٰبِرِیۡنَ فِی الۡبَاۡسَآءِ وَ الضَّرَّآءِ  وَ حِیۡنَ الۡبَاۡسِ ؕ اُولٰٓئِکَ الَّذِیۡنَ صَدَقُوۡا ؕ وَ اُولٰٓئِکَ ہُمُ الۡمُتَّقُوۡنَ ﴿۱۷۷﴾",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا کُتِبَ عَلَیۡکُمُ الۡقِصَاصُ فِی الۡقَتۡلٰی ؕ اَلۡحُرُّ بِالۡحُرِّ وَ الۡعَبۡدُ بِالۡعَبۡدِ وَ الۡاُنۡثٰی بِالۡاُنۡثٰی ؕ فَمَنۡ عُفِیَ لَہٗ مِنۡ اَخِیۡہِ شَیۡءٌ فَاتِّبَاعٌۢ بِالۡمَعۡرُوۡفِ وَ اَدَآءٌ اِلَیۡہِ بِاِحۡسَانٍ ؕ ذٰلِکَ تَخۡفِیۡفٌ مِّنۡ رَّبِّکُمۡ وَ رَحۡمَۃٌ ؕ فَمَنِ اعۡتَدٰی بَعۡدَ ذٰلِکَ فَلَہٗ عَذَابٌ  اَلِیۡمٌ ﴿۱۷۸﴾",
                    "وَ لَکُمۡ فِی الۡقِصَاصِ حَیٰوۃٌ یّٰۤاُولِی الۡاَلۡبَابِ لَعَلَّکُمۡ تَتَّقُوۡنَ ﴿۱۷۹﴾",
                    "کُتِبَ عَلَیۡکُمۡ  اِذَا حَضَرَ اَحَدَکُمُ الۡمَوۡتُ اِنۡ تَرَکَ خَیۡرَۨا ۚۖ  الۡوَصِیَّۃُ لِلۡوَالِدَیۡنِ وَ الۡاَقۡرَبِیۡنَ بِالۡمَعۡرُوۡفِ ۚ حَقًّا عَلَی الۡمُتَّقِیۡنَ ﴿۱۸۰﴾ؕ",
                    "فَمَنۡۢ بَدَّلَہٗ بَعۡدَ مَا سَمِعَہٗ فَاِنَّمَاۤ اِثۡمُہٗ عَلَی الَّذِیۡنَ یُبَدِّلُوۡنَہٗ ؕ اِنَّ اللّٰہَ سَمِیۡعٌ عَلِیۡمٌ ﴿۱۸۱﴾ؕ",
                    "فَمَنۡ خَافَ مِنۡ مُّوۡصٍ جَنَفًا اَوۡ اِثۡمًا فَاَصۡلَحَ  بَیۡنَہُمۡ فَلَاۤ  اِثۡمَ عَلَیۡہِ ؕ اِنَّ اللّٰہَ غَفُوۡرٌ رَّحِیۡمٌ ﴿۱۸۲﴾٪",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا کُتِبَ عَلَیۡکُمُ الصِّیَامُ کَمَا کُتِبَ عَلَی الَّذِیۡنَ مِنۡ قَبۡلِکُمۡ لَعَلَّکُمۡ تَتَّقُوۡنَ ﴿۱۸۳﴾ۙ",
                    "اَیَّامًا مَّعۡدُوۡدٰتٍ ؕ فَمَنۡ کَانَ مِنۡکُمۡ مَّرِیۡضًا اَوۡ عَلٰی سَفَرٍ فَعِدَّۃٌ مِّنۡ اَیَّامٍ اُخَرَ ؕ وَ عَلَی الَّذِیۡنَ یُطِیۡقُوۡنَہٗ فِدۡیَۃٌ طَعَامُ مِسۡکِیۡنٍ ؕ فَمَنۡ تَطَوَّعَ خَیۡرًا فَہُوَ خَیۡرٌ لَّہٗ ؕ وَ اَنۡ تَصُوۡمُوۡا خَیۡرٌ لَّکُمۡ   اِنۡ کُنۡتُمۡ  تَعۡلَمُوۡنَ ﴿۱۸۴﴾",
                    "شَہۡرُ رَمَضَانَ الَّذِیۡۤ اُنۡزِلَ فِیۡہِ الۡقُرۡاٰنُ ہُدًی لِّلنَّاسِ وَ بَیِّنٰتٍ مِّنَ الۡہُدٰی وَ الۡفُرۡقَانِ ۚ فَمَنۡ شَہِدَ مِنۡکُمُ الشَّہۡرَ فَلۡیَصُمۡہُ ؕ وَ مَنۡ کَانَ مَرِیۡضًا اَوۡ عَلٰی سَفَرٍ فَعِدَّۃٌ مِّنۡ اَیَّامٍ اُخَرَ ؕ یُرِیۡدُ اللّٰہُ بِکُمُ الۡیُسۡرَ وَ لَا یُرِیۡدُ بِکُمُ الۡعُسۡرَ ۫ وَ لِتُکۡمِلُوا الۡعِدَّۃَ وَ لِتُکَبِّرُوا اللّٰہَ عَلٰی مَا ہَدٰٮکُمۡ وَ لَعَلَّکُمۡ تَشۡکُرُوۡنَ ﴿۱۸۵﴾",
                    "وَ اِذَا سَاَلَکَ عِبَادِیۡ عَنِّیۡ فَاِنِّیۡ قَرِیۡبٌ ؕ اُجِیۡبُ دَعۡوَۃَ الدَّاعِ  اِذَا دَعَانِ  ۙ فَلۡیَسۡتَجِیۡبُوۡا لِیۡ وَ لۡیُؤۡمِنُوۡا بِیۡ  لَعَلَّہُمۡ  یَرۡشُدُوۡنَ ﴿۱۸۶﴾",
                    "اُحِلَّ لَکُمۡ لَیۡلَۃَ الصِّیَامِ الرَّفَثُ اِلٰی نِسَآئِکُمۡ ؕ ہُنَّ لِبَاسٌ لَّکُمۡ وَ اَنۡتُمۡ لِبَاسٌ لَّہُنَّ ؕ عَلِمَ اللّٰہُ  اَنَّکُمۡ کُنۡتُمۡ تَخۡتَانُوۡنَ اَنۡفُسَکُمۡ فَتَابَ عَلَیۡکُمۡ وَ عَفَا عَنۡکُمۡ ۚ فَالۡـٰٔنَ بَاشِرُوۡہُنَّ وَ ابۡتَغُوۡا مَا کَتَبَ اللّٰہُ  لَکُمۡ  ۪ وَ کُلُوۡا وَ اشۡرَبُوۡا حَتّٰی یَتَبَیَّنَ لَکُمُ الۡخَیۡطُ الۡاَبۡیَضُ مِنَ الۡخَیۡطِ الۡاَسۡوَدِ  مِنَ الۡفَجۡرِ۪ ثُمَّ   اَتِمُّوا الصِّیَامَ اِلَی الَّیۡلِ ۚ وَ لَا تُبَاشِرُوۡہُنَّ وَ اَنۡتُمۡ عٰکِفُوۡنَ  ۙ فِی الۡمَسٰجِدِ ؕ تِلۡکَ حُدُوۡدُ  اللّٰہِ فَلَا تَقۡرَبُوۡہَا ؕ کَذٰلِکَ یُبَیِّنُ اللّٰہُ  اٰیٰتِہٖ لِلنَّاسِ لَعَلَّہُمۡ  یَتَّقُوۡنَ ﴿۱۸۷﴾",
                    "وَ لَا تَاۡکُلُوۡۤا اَمۡوَالَکُمۡ بَیۡنَکُمۡ بِالۡبَاطِلِ وَ تُدۡلُوۡا بِہَاۤ اِلَی الۡحُکَّامِ لِتَاۡکُلُوۡا فَرِیۡقًا مِّنۡ اَمۡوَالِ النَّاسِ بِالۡاِثۡمِ وَ اَنۡتُمۡ  تَعۡلَمُوۡنَ ﴿۱۸۸﴾٪",
                    "یَسۡـَٔلُوۡنَکَ عَنِ الۡاَہِلَّۃِ ؕ قُلۡ ہِیَ مَوَاقِیۡتُ لِلنَّاسِ وَ الۡحَجِّ ؕ وَ لَیۡسَ الۡبِرُّ بِاَنۡ تَاۡتُوا الۡبُیُوۡتَ مِنۡ ظُہُوۡرِہَا وَ لٰکِنَّ الۡبِرَّ مَنِ اتَّقٰیۚ وَ اۡتُوا الۡبُیُوۡتَ مِنۡ اَبۡوَابِہَا ۪ وَ اتَّقُوا اللّٰہَ لَعَلَّکُمۡ تُفۡلِحُوۡنَ ﴿۱۸۹﴾",
                    "وَ قَاتِلُوۡا فِیۡ سَبِیۡلِ اللّٰہِ الَّذِیۡنَ یُقَاتِلُوۡنَکُمۡ وَ لَا تَعۡتَدُوۡا ؕ اِنَّ اللّٰہَ  لَا یُحِبُّ الۡمُعۡتَدِیۡنَ ﴿۱۹۰﴾",
                    "وَ اقۡتُلُوۡہُمۡ حَیۡثُ ثَقِفۡتُمُوۡہُمۡ وَ اَخۡرِجُوۡہُمۡ مِّنۡ حَیۡثُ اَخۡرَجُوۡکُمۡ وَ الۡفِتۡنَۃُ اَشَدُّ مِنَ الۡقَتۡلِ ۚ وَ لَا تُقٰتِلُوۡہُمۡ عِنۡدَ الۡمَسۡجِدِ الۡحَرَامِ حَتّٰی یُقٰتِلُوۡکُمۡ فِیۡہِ ۚ فَاِنۡ قٰتَلُوۡکُمۡ فَاقۡتُلُوۡہُمۡ ؕ  کَذٰلِکَ جَزَآءُ الۡکٰفِرِیۡنَ ﴿۱۹۱﴾",
                    "فَاِنِ انۡتَہَوۡا فَاِنَّ اللّٰہَ غَفُوۡرٌ رَّحِیۡمٌ ﴿۱۹۲﴾",
                    "وَ قٰتِلُوۡہُمۡ حَتّٰی لَا تَکُوۡنَ فِتۡنَۃٌ وَّ یَکُوۡنَ الدِّیۡنُ  لِلّٰہِ ؕ فَاِنِ انۡتَہَوۡا فَلَا عُدۡوَانَ  اِلَّا عَلَی الظّٰلِمِیۡنَ ﴿۱۹۳﴾",
                    "اَلشَّہۡرُ الۡحَرَامُ  بِالشَّہۡرِ الۡحَرَامِ وَ الۡحُرُمٰتُ قِصَاصٌ ؕ فَمَنِ اعۡتَدٰی عَلَیۡکُمۡ فَاعۡتَدُوۡا عَلَیۡہِ بِمِثۡلِ مَا اعۡتَدٰی عَلَیۡکُمۡ  ۪ وَ اتَّقُوا اللّٰہَ وَ اعۡلَمُوۡۤا  اَنَّ اللّٰہَ مَعَ  الۡمُتَّقِیۡنَ ﴿۱۹۴﴾",
                    "وَ اَنۡفِقُوۡا فِیۡ سَبِیۡلِ اللّٰہِ وَ لَا تُلۡقُوۡا بِاَیۡدِیۡکُمۡ  اِلَی التَّہۡلُکَۃِ ۚۖۛ وَ اَحۡسِنُوۡا ۚۛ اِنَّ اللّٰہَ یُحِبُّ الۡمُحۡسِنِیۡنَ ﴿۱۹۵﴾",
                    "وَ اَتِمُّوا الۡحَجَّ وَ الۡعُمۡرَۃَ  لِلّٰہِ ؕ فَاِنۡ اُحۡصِرۡتُمۡ  فَمَا اسۡتَیۡسَرَ مِنَ الۡہَدۡیِ ۚ وَ لَا تَحۡلِقُوۡا رُءُوۡسَکُمۡ حَتّٰی یَبۡلُغَ الۡہَدۡیُ  مَحِلَّہٗ ؕ فَمَنۡ کَانَ مِنۡکُمۡ مَّرِیۡضًا اَوۡ بِہٖۤ اَذًی مِّنۡ رَّاۡسِہٖ فَفِدۡیَۃٌ مِّنۡ صِیَامٍ اَوۡ صَدَقَۃٍ اَوۡ نُسُکٍ ۚ فَاِذَاۤ  اَمِنۡتُمۡ ٝ فَمَنۡ تَمَتَّعَ بِالۡعُمۡرَۃِ  اِلَی الۡحَجِّ فَمَا اسۡتَیۡسَرَ مِنَ الۡہَدۡیِ ۚ فَمَنۡ لَّمۡ  یَجِدۡ فَصِیَامُ ثَلٰثَۃِ اَیَّامٍ فِی الۡحَجِّ وَ سَبۡعَۃٍ اِذَا  رَجَعۡتُمۡ ؕ تِلۡکَ عَشَرَۃٌ کَامِلَۃٌ  ؕ ذٰلِکَ لِمَنۡ لَّمۡ یَکُنۡ اَہۡلُہٗ حَاضِرِی الۡمَسۡجِدِ الۡحَرَامِ ؕ وَ اتَّقُوا اللّٰہَ وَ اعۡلَمُوۡۤا  اَنَّ اللّٰہَ  شَدِیۡدُ  الۡعِقَابِ ﴿۱۹۶﴾٪",
                    "اَلۡحَجُّ اَشۡہُرٌ مَّعۡلُوۡمٰتٌ ۚ فَمَنۡ فَرَضَ فِیۡہِنَّ الۡحَجَّ فَلَا رَفَثَ وَ لَا فُسُوۡقَ  ۙ وَ لَا جِدَالَ فِی الۡحَجِّ ؕ وَ مَا تَفۡعَلُوۡا مِنۡ خَیۡرٍ  یَّعۡلَمۡہُ اللّٰہُ  ؕؔ وَ تَزَوَّدُوۡا فَاِنَّ خَیۡرَ الزَّادِ التَّقۡوٰی ۫ وَ اتَّقُوۡنِ یٰۤاُولِی الۡاَلۡبَابِ ﴿۱۹۷﴾",
                    "لَیۡسَ عَلَیۡکُمۡ جُنَاحٌ اَنۡ تَبۡتَغُوۡا فَضۡلًا مِّنۡ رَّبِّکُمۡ ؕ فَاِذَاۤ اَفَضۡتُمۡ مِّنۡ عَرَفٰتٍ فَاذۡکُرُوا اللّٰہَ عِنۡدَ الۡمَشۡعَرِ الۡحَرَامِ ۪ وَ اذۡکُرُوۡہُ  کَمَا ہَدٰٮکُمۡ ۚ وَ اِنۡ  کُنۡتُمۡ مِّنۡ قَبۡلِہٖ  لَمِنَ الضَّآلِّیۡنَ ﴿۱۹۸﴾",
                    "ثُمَّ  اَفِیۡضُوۡا مِنۡ حَیۡثُ اَفَاضَ النَّاسُ وَ اسۡتَغۡفِرُوا اللّٰہَ  ؕ اِنَّ اللّٰہَ غَفُوۡرٌ رَّحِیۡمٌ ﴿۱۹۹﴾",
                    "فَاِذَا قَضَیۡتُمۡ مَّنَاسِکَکُمۡ فَاذۡکُرُوا اللّٰہَ  کَذِکۡرِکُمۡ اٰبَآءَکُمۡ اَوۡ اَشَدَّ ذِکۡرًا ؕ فَمِنَ النَّاسِ مَنۡ یَّقُوۡلُ رَبَّنَاۤ  اٰتِنَا فِی الدُّنۡیَا وَ مَا لَہٗ فِی الۡاٰخِرَۃِ  مِنۡ خَلَاقٍ ﴿۲۰۰﴾",
                    "وَ مِنۡہُمۡ مَّنۡ یَّقُوۡلُ رَبَّنَاۤ  اٰتِنَا فِی الدُّنۡیَا حَسَنَۃً  وَّ فِی الۡاٰخِرَۃِ حَسَنَۃً  وَّ قِنَا عَذَابَ النَّارِ ﴿۲۰۱﴾",
                    "اُولٰٓئِکَ لَہُمۡ نَصِیۡبٌ مِّمَّا کَسَبُوۡا ؕ وَ اللّٰہُ  سَرِیۡعُ  الۡحِسَابِ ﴿۲۰۲﴾",
                    "وَ اذۡکُرُوا اللّٰہَ فِیۡۤ  اَیَّامٍ  مَّعۡدُوۡدٰتٍ ؕ فَمَنۡ تَعَجَّلَ فِیۡ یَوۡمَیۡنِ فَلَاۤ اِثۡمَ عَلَیۡہِ ۚ وَ مَنۡ تَاَخَّرَ فَلَاۤ اِثۡمَ عَلَیۡہِ  ۙ لِمَنِ اتَّقٰی ؕ وَ اتَّقُوا اللّٰہَ وَ اعۡلَمُوۡۤا اَنَّکُمۡ  اِلَیۡہِ تُحۡشَرُوۡنَ ﴿۲۰۳﴾",
                    "وَ مِنَ النَّاسِ مَنۡ یُّعۡجِبُکَ قَوۡلُہٗ فِی الۡحَیٰوۃِ الدُّنۡیَا وَ یُشۡہِدُ اللّٰہَ عَلٰی مَا فِیۡ  قَلۡبِہٖ  ۙ وَ ہُوَ  اَلَدُّ  الۡخِصَامِ ﴿۲۰۴﴾",
                    "وَ اِذَا تَوَلّٰی سَعٰی فِی الۡاَرۡضِ لِیُفۡسِدَ فِیۡہَا وَ یُہۡلِکَ الۡحَرۡثَ وَ النَّسۡلَ ؕ وَ اللّٰہُ  لَا  یُحِبُّ الۡفَسَادَ ﴿۲۰۵﴾",
                    "وَ اِذَا قِیۡلَ لَہُ  اتَّقِ اللّٰہَ اَخَذَتۡہُ الۡعِزَّۃُ بِالۡاِثۡمِ فَحَسۡبُہٗ جَہَنَّمُ ؕ وَ لَبِئۡسَ الۡمِہَادُ ﴿۲۰۶﴾",
                    "وَ مِنَ النَّاسِ مَنۡ یَّشۡرِیۡ نَفۡسَہُ ابۡتِغَآءَ مَرۡضَاتِ اللّٰہِ ؕ وَ اللّٰہُ  رَءُوۡفٌۢ بِالۡعِبَادِ ﴿۲۰۷﴾",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوا ادۡخُلُوۡا فِی السِّلۡمِ  کَآفَّۃً  ۪ وَ لَا تَتَّبِعُوۡا خُطُوٰتِ الشَّیۡطٰنِ ؕ اِنَّہٗ لَکُمۡ عَدُوٌّ مُّبِیۡنٌ ﴿۲۰۸﴾",
                    "فَاِنۡ زَلَلۡتُمۡ  مِّنۡۢ بَعۡدِ مَا جَآءَتۡکُمُ الۡبَیِّنٰتُ فَاعۡلَمُوۡۤا اَنَّ اللّٰہَ عَزِیۡزٌ حَکِیۡمٌ ﴿۲۰۹﴾",
                    "ہَلۡ یَنۡظُرُوۡنَ  اِلَّاۤ  اَنۡ یَّاۡتِیَہُمُ اللّٰہُ فِیۡ ظُلَلٍ مِّنَ الۡغَمَامِ وَ الۡمَلٰٓئِکَۃُ وَ قُضِیَ الۡاَمۡرُ ؕ وَ  اِلَی اللّٰہِ تُرۡجَعُ  الۡاُمُوۡرُ ﴿۲۱۰﴾٪",
                    "سَلۡ بَنِیۡۤ  اِسۡرَآءِیۡلَ  کَمۡ اٰتَیۡنٰہُمۡ مِّنۡ اٰیَۃٍۭ بَیِّنَۃٍ ؕ وَ مَنۡ یُّبَدِّلۡ نِعۡمَۃَ اللّٰہِ مِنۡۢ بَعۡدِ مَا جَآءَتۡہُ فَاِنَّ اللّٰہَ شَدِیۡدُ الۡعِقَابِ ﴿۲۱۱﴾",
                    "زُیِّنَ لِلَّذِیۡنَ کَفَرُوا الۡحَیٰوۃُ الدُّنۡیَا وَ یَسۡخَرُوۡنَ مِنَ الَّذِیۡنَ اٰمَنُوۡا ۘ وَ الَّذِیۡنَ اتَّقَوۡا فَوۡقَہُمۡ یَوۡمَ الۡقِیٰمَۃِ ؕ وَ اللّٰہُ یَرۡزُقُ مَنۡ یَّشَآءُ بِغَیۡرِ حِسَابٍ ﴿۲۱۲﴾",
                    "کَانَ النَّاسُ اُمَّۃً  وَّاحِدَۃً ۟ فَبَعَثَ اللّٰہُ النَّبِیّٖنَ مُبَشِّرِیۡنَ وَ مُنۡذِرِیۡنَ  ۪ وَ اَنۡزَلَ مَعَہُمُ  الۡکِتٰبَ بِالۡحَقِّ لِیَحۡکُمَ بَیۡنَ النَّاسِ فِیۡمَا اخۡتَلَفُوۡا فِیۡہِ ؕ وَ مَا اخۡتَلَفَ فِیۡہِ اِلَّا الَّذِیۡنَ اُوۡتُوۡہُ مِنۡۢ بَعۡدِ مَا جَآءَتۡہُمُ الۡبَیِّنٰتُ بَغۡیًۢا بَیۡنَہُمۡ ۚ فَہَدَی اللّٰہُ الَّذِیۡنَ اٰمَنُوۡا لِمَا اخۡتَلَفُوۡا فِیۡہِ مِنَ الۡحَقِّ بِاِذۡنِہٖ ؕ وَ اللّٰہُ  یَہۡدِیۡ مَنۡ یَّشَآءُ  اِلٰی صِرَاطٍ مُّسۡتَقِیۡمٍ ﴿۲۱۳﴾",
                    "اَمۡ حَسِبۡتُمۡ  اَنۡ تَدۡخُلُوا الۡجَنَّۃَ وَ لَمَّا یَاۡتِکُمۡ مَّثَلُ الَّذِیۡنَ خَلَوۡا مِنۡ قَبۡلِکُمۡ ؕ مَسَّتۡہُمُ الۡبَاۡسَآءُ  وَ الضَّرَّآءُ وَ زُلۡزِلُوۡا حَتّٰی یَقُوۡلَ الرَّسُوۡلُ وَ الَّذِیۡنَ اٰمَنُوۡا مَعَہٗ مَتٰی نَصۡرُ  اللّٰہِ ؕ اَلَاۤ اِنَّ نَصۡرَ اللّٰہِ  قَرِیۡبٌ ﴿۲۱۴﴾",
                    "یَسۡـَٔلُوۡنَکَ مَا ذَا یُنۡفِقُوۡنَ ۬ؕ قُلۡ مَاۤ اَنۡفَقۡتُمۡ  مِّنۡ خَیۡرٍ فَلِلۡوَالِدَیۡنِ وَ الۡاَقۡرَبِیۡنَ وَ الۡیَتٰمٰی وَ الۡمَسٰکِیۡنِ وَ ابۡنِ‌السَّبِیۡلِ ؕ وَ مَا تَفۡعَلُوۡا مِنۡ خَیۡرٍ فَاِنَّ اللّٰہَ بِہٖ عَلِیۡمٌ ﴿۲۱۵﴾",
                    "کُتِبَ عَلَیۡکُمُ الۡقِتَالُ وَ ہُوَ کُرۡہٌ لَّکُمۡ ۚ وَ عَسٰۤی اَنۡ تَکۡرَہُوۡا شَیۡئًا وَّ ہُوَ خَیۡرٌ لَّکُمۡ ۚ وَ عَسٰۤی اَنۡ تُحِبُّوۡا شَیۡئًا وَّ ہُوَ شَرٌّ لَّکُمۡ ؕ وَ اللّٰہُ یَعۡلَمُ  وَ اَنۡتُمۡ  لَا تَعۡلَمُوۡنَ ﴿۲۱۶﴾٪",
                    "یَسۡـَٔلُوۡنَکَ عَنِ الشَّہۡرِ الۡحَرَامِ  قِتَالٍ فِیۡہِ ؕ قُلۡ قِتَالٌ فِیۡہِ کَبِیۡرٌ ؕ وَ صَدٌّ عَنۡ سَبِیۡلِ اللّٰہِ وَ کُفۡرٌۢ بِہٖ وَ الۡمَسۡجِدِ الۡحَرَامِ ٭ وَ  اِخۡرَاجُ اَہۡلِہٖ مِنۡہُ اَکۡبَرُ عِنۡدَ  اللّٰہِ ۚ وَ  الۡفِتۡنَۃُ  اَکۡبَرُ مِنَ الۡقَتۡلِ ؕ وَ لَا یَزَالُوۡنَ یُقَاتِلُوۡنَکُمۡ حَتّٰی یَرُدُّوۡکُمۡ عَنۡ دِیۡنِکُمۡ   اِنِ  اسۡتَطَاعُوۡا ؕ وَ مَنۡ یَّرۡتَدِدۡ مِنۡکُمۡ عَنۡ دِیۡنِہٖ فَیَمُتۡ وَ ہُوَ کَافِرٌ فَاُولٰٓئِکَ حَبِطَتۡ اَعۡمَالُہُمۡ  فِی الدُّنۡیَا وَ الۡاٰخِرَۃِ ۚ وَ اُولٰٓئِکَ اَصۡحٰبُ النَّارِ ۚ ہُمۡ   فِیۡہَا خٰلِدُوۡنَ ﴿۲۱۷﴾",
                    "اِنَّ الَّذِیۡنَ اٰمَنُوۡا وَ الَّذِیۡنَ  ہَاجَرُوۡا وَ جٰہَدُوۡا فِیۡ سَبِیۡلِ اللّٰہِ  ۙ اُولٰٓئِکَ یَرۡجُوۡنَ  رَحۡمَتَ اللّٰہِ ؕ وَ اللّٰہُ غَفُوۡرٌ رَّحِیۡمٌ ﴿۲۱۸﴾",
                    "یَسۡـَٔلُوۡنَکَ عَنِ الۡخَمۡرِ وَ الۡمَیۡسِرِؕ قُلۡ فِیۡہِمَاۤ اِثۡمٌ  کَبِیۡرٌ  وَّ مَنَافِعُ  لِلنَّاسِ ۫ وَ اِثۡمُہُمَاۤ  اَکۡبَرُ مِنۡ نَّفۡعِہِمَا ؕ وَ یَسۡـَٔلُوۡنَکَ مَا ذَا یُنۡفِقُوۡنَ ۬ؕ قُلِ الۡعَفۡوَؕ کَذٰلِکَ یُبَیِّنُ اللّٰہُ  لَکُمُ الۡاٰیٰتِ لَعَلَّکُمۡ تَتَفَکَّرُوۡنَ ﴿۲۱۹﴾ۙ",
                    "فِی الدُّنۡیَا وَ الۡاٰخِرَۃِ ؕ وَ یَسۡـَٔلُوۡنَکَ عَنِ الۡیَتٰمٰی ؕ قُلۡ  اِصۡلَاحٌ لَّہُمۡ خَیۡرٌ ؕ وَ اِنۡ تُخَالِطُوۡہُمۡ  فَاِخۡوَانُکُمۡ ؕ وَ اللّٰہُ یَعۡلَمُ الۡمُفۡسِدَ مِنَ الۡمُصۡلِحِ ؕ وَ لَوۡ شَآءَ اللّٰہُ  لَاَعۡنَتَکُمۡ ؕ اِنَّ  اللّٰہَ عَزِیۡزٌ حَکِیۡمٌ ﴿۲۲۰﴾",
                    "وَ لَا تَنۡکِحُوا الۡمُشۡرِکٰتِ حَتّٰی یُؤۡمِنَّ ؕ وَ لَاَمَۃٌ مُّؤۡمِنَۃٌ  خَیۡرٌ مِّنۡ مُّشۡرِکَۃٍ  وَّ لَوۡ اَعۡجَبَتۡکُمۡ ۚ وَ لَا تُنۡکِحُوا الۡمُشۡرِکِیۡنَ حَتّٰی یُؤۡمِنُوۡا ؕ وَ لَعَبۡدٌ مُّؤۡمِنٌ خَیۡرٌ مِّنۡ مُّشۡرِکٍ وَّ لَوۡ اَعۡجَبَکُمۡ ؕ اُولٰٓئِکَ یَدۡعُوۡنَ  اِلَی النَّارِ ۚۖ وَ اللّٰہُ  یَدۡعُوۡۤا اِلَی الۡجَنَّۃِ وَ الۡمَغۡفِرَۃِ  بِاِذۡنِہٖ ۚ وَ یُبَیِّنُ  اٰیٰتِہٖ لِلنَّاسِ لَعَلَّہُمۡ  یَتَذَکَّرُوۡنَ ﴿۲۲۱﴾٪",
                    "وَ یَسۡـَٔلُوۡنَکَ عَنِ الۡمَحِیۡضِ ؕ قُلۡ ہُوَ اَذًی  ۙ فَاعۡتَزِلُوا النِّسَآءَ فِی الۡمَحِیۡضِ  ۙ وَ لَا تَقۡرَبُوۡہُنَّ حَتّٰی یَطۡہُرۡنَ ۚ فَاِذَا تَطَہَّرۡنَ  فَاۡتُوۡہُنَّ مِنۡ حَیۡثُ اَمَرَکُمُ اللّٰہُ  ؕ اِنَّ اللّٰہَ یُحِبُّ التَّوَّابِیۡنَ  وَ یُحِبُّ الۡمُتَطَہِّرِیۡنَ ﴿۲۲۲﴾",
                    "نِسَآؤُکُمۡ حَرۡثٌ لَّکُمۡ  ۪ فَاۡتُوۡا حَرۡثَکُمۡ اَنّٰی شِئۡتُمۡ ۫ وَ قَدِّمُوۡا لِاَنۡفُسِکُمۡ ؕ وَ اتَّقُوا اللّٰہَ وَ اعۡلَمُوۡۤا اَنَّکُمۡ  مُّلٰقُوۡہُ  ؕ وَ بَشِّرِ الۡمُؤۡمِنِیۡنَ ﴿۲۲۳﴾",
                    "وَ لَا تَجۡعَلُوا اللّٰہَ عُرۡضَۃً  لِّاَیۡمَانِکُمۡ اَنۡ تَبَرُّوۡا وَ تَتَّقُوۡا وَ تُصۡلِحُوۡا بَیۡنَ النَّاسِ ؕ وَ اللّٰہُ  سَمِیۡعٌ  عَلِیۡمٌ ﴿۲۲۴﴾",
                    "لَا  یُؤَاخِذُکُمُ  اللّٰہُ بِاللَّغۡوِ فِیۡۤ  اَیۡمَانِکُمۡ وَ لٰکِنۡ یُّؤَاخِذُکُمۡ  بِمَا کَسَبَتۡ قُلُوۡبُکُمۡ ؕ وَ اللّٰہُ غَفُوۡرٌ  حَلِیۡمٌ ﴿۲۲۵﴾",
                    "لِلَّذِیۡنَ یُؤۡلُوۡنَ مِنۡ نِّسَآئِہِمۡ تَرَبُّصُ اَرۡبَعَۃِ اَشۡہُرٍ ۚ فَاِنۡ فَآءُوۡ فَاِنَّ اللّٰہَ غَفُوۡرٌ  رَّحِیۡمٌ ﴿۲۲۶﴾",
                    "وَ اِنۡ عَزَمُوا الطَّلَاقَ فَاِنَّ اللّٰہَ سَمِیۡعٌ عَلِیۡمٌ ﴿۲۲۷﴾",
                    "وَ الۡمُطَلَّقٰتُ یَتَرَبَّصۡنَ بِاَنۡفُسِہِنَّ ثَلٰثَۃَ قُرُوۡٓءٍ ؕ وَ لَا یَحِلُّ لَہُنَّ اَنۡ یَّکۡتُمۡنَ مَا خَلَقَ اللّٰہُ فِیۡۤ  اَرۡحَامِہِنَّ  اِنۡ  کُنَّ یُؤۡمِنَّ بِاللّٰہِ وَ الۡیَوۡمِ  الۡاٰخِرِ ؕ وَ بُعُوۡلَتُہُنَّ اَحَقُّ بِرَدِّہِنَّ فِیۡ ذٰلِکَ اِنۡ اَرَادُوۡۤا اِصۡلَاحًا ؕ وَ لَہُنَّ مِثۡلُ الَّذِیۡ عَلَیۡہِنَّ بِالۡمَعۡرُوۡفِ  ۪ وَ لِلرِّجَالِ عَلَیۡہِنَّ دَرَجَۃٌ ؕ وَ اللّٰہُ عَزِیۡزٌ حَکِیۡمٌ ﴿۲۲۸﴾٪",
                    "اَلطَّلَاقُ مَرَّتٰنِ۪ فَاِمۡسَاکٌۢ بِمَعۡرُوۡفٍ اَوۡ تَسۡرِیۡحٌۢ بِاِحۡسَانٍ ؕ وَ لَا  یَحِلُّ  لَکُمۡ اَنۡ تَاۡخُذُوۡا مِمَّاۤ  اٰتَیۡتُمُوۡہُنَّ شَیۡئًا اِلَّاۤ اَنۡ یَّخَافَاۤ  اَلَّا یُقِیۡمَا حُدُوۡدَ اللّٰہِ ؕ فَاِنۡ خِفۡتُمۡ  اَلَّا یُقِیۡمَا حُدُوۡدَ اللّٰہِ  ۙ فَلَا جُنَاحَ عَلَیۡہِمَا فِیۡمَا افۡتَدَتۡ بِہٖ ؕ تِلۡکَ حُدُوۡدُ اللّٰہِ فَلَا تَعۡتَدُوۡہَا ۚ وَ مَنۡ یَّتَعَدَّ حُدُوۡدَ اللّٰہِ فَاُولٰٓئِکَ ہُمُ الظّٰلِمُوۡنَ ﴿۲۲۹﴾",
                    "فَاِنۡ طَلَّقَہَا فَلَا تَحِلُّ لَہٗ مِنۡۢ بَعۡدُ حَتّٰی تَنۡکِحَ زَوۡجًا غَیۡرَہٗ ؕ فَاِنۡ طَلَّقَہَا فَلَا جُنَاحَ عَلَیۡہِمَاۤ  اَنۡ یَّتَرَاجَعَاۤ  اِنۡ ظَنَّاۤ  اَنۡ یُّقِیۡمَا حُدُوۡدَ اللّٰہِ ؕ وَ تِلۡکَ حُدُوۡدُ اللّٰہِ یُبَیِّنُہَا لِقَوۡمٍ  یَّعۡلَمُوۡنَ ﴿۲۳۰﴾",
                    "وَ اِذَا طَلَّقۡتُمُ النِّسَآءَ فَبَلَغۡنَ اَجَلَہُنَّ فَاَمۡسِکُوۡہُنَّ بِمَعۡرُوۡفٍ اَوۡ سَرِّحُوۡہُنَّ بِمَعۡرُوۡفٍ  ۪ وَ لَا تُمۡسِکُوۡہُنَّ ضِرَارًا لِّتَعۡتَدُوۡا ۚ وَ مَنۡ یَّفۡعَلۡ ذٰلِکَ فَقَدۡ  ظَلَمَ نَفۡسَہٗ ؕ وَ لَا تَتَّخِذُوۡۤا اٰیٰتِ اللّٰہِ ہُزُوًا ۫ وَّ اذۡکُرُوۡا نِعۡمَتَ اللّٰہِ عَلَیۡکُمۡ وَ مَاۤ  اَنۡزَلَ عَلَیۡکُمۡ مِّنَ الۡکِتٰبِ وَ الۡحِکۡمَۃِ یَعِظُکُمۡ  بِہٖ ؕ وَ اتَّقُوا اللّٰہَ وَ اعۡلَمُوۡۤا  اَنَّ اللّٰہَ بِکُلِّ شَیۡءٍ عَلِیۡمٌ ﴿۲۳۱﴾٪",
                    "وَ اِذَا طَلَّقۡتُمُ النِّسَآءَ فَبَلَغۡنَ اَجَلَہُنَّ فَلَا تَعۡضُلُوۡہُنَّ اَنۡ یَّنۡکِحۡنَ اَزۡوَاجَہُنَّ  اِذَا تَرَاضَوۡا بَیۡنَہُمۡ بِالۡمَعۡرُوۡفِ ؕ ذٰلِکَ یُوۡعَظُ بِہٖ مَنۡ کَانَ مِنۡکُمۡ  یُؤۡمِنُ بِاللّٰہِ وَ الۡیَوۡمِ  الۡاٰخِرِ ؕ ذٰلِکُمۡ اَزۡکٰی لَکُمۡ وَ اَطۡہَرُ ؕ وَ اللّٰہُ یَعۡلَمُ  وَ اَنۡتُمۡ  لَا  تَعۡلَمُوۡنَ ﴿۲۳۲﴾",
                    "وَ الۡوَالِدٰتُ یُرۡضِعۡنَ اَوۡلَادَہُنَّ حَوۡلَیۡنِ کَامِلَیۡنِ لِمَنۡ اَرَادَ  اَنۡ یُّتِمَّ الرَّضَاعَۃَ ؕ وَ عَلَی الۡمَوۡلُوۡدِ لَہٗ رِزۡقُہُنَّ وَ کِسۡوَتُہُنَّ بِالۡمَعۡرُوۡفِ ؕ لَا تُکَلَّفُ نَفۡسٌ اِلَّا وُسۡعَہَا ۚ لَا تُضَآرَّ وَالِدَۃٌۢ بِوَلَدِہَا وَ لَا مَوۡلُوۡدٌ لَّہٗ بِوَلَدِہٖ ٭ وَ عَلَی الۡوَارِثِ مِثۡلُ ذٰلِکَ ۚ فَاِنۡ اَرَادَا فِصَالًا عَنۡ تَرَاضٍ مِّنۡہُمَا وَ تَشَاوُرٍ فَلَا جُنَاحَ عَلَیۡہِمَا ؕ وَ اِنۡ اَرَدۡتُّمۡ اَنۡ تَسۡتَرۡضِعُوۡۤا اَوۡلَادَکُمۡ فَلَا جُنَاحَ عَلَیۡکُمۡ  اِذَا سَلَّمۡتُمۡ مَّاۤ  اٰتَیۡتُمۡ  بِالۡمَعۡرُوۡفِ ؕ وَ اتَّقُوا اللّٰہَ وَ اعۡلَمُوۡۤا اَنَّ اللّٰہَ بِمَا تَعۡمَلُوۡنَ بَصِیۡرٌ ﴿۲۳۳﴾",
                    "وَ الَّذِیۡنَ یُتَوَفَّوۡنَ مِنۡکُمۡ وَ یَذَرُوۡنَ اَزۡوَاجًا یَّتَرَبَّصۡنَ بِاَنۡفُسِہِنَّ اَرۡبَعَۃَ اَشۡہُرٍ وَّ عَشۡرًا ۚ فَاِذَا بَلَغۡنَ اَجَلَہُنَّ فَلَا جُنَاحَ عَلَیۡکُمۡ فِیۡمَا فَعَلۡنَ فِیۡۤ  اَنۡفُسِہِنَّ بِالۡمَعۡرُوۡفِ ؕ وَ اللّٰہُ بِمَا تَعۡمَلُوۡنَ  خَبِیۡرٌ ﴿۲۳۴﴾",
                    "وَ لَا جُنَاحَ عَلَیۡکُمۡ فِیۡمَا عَرَّضۡتُمۡ بِہٖ مِنۡ خِطۡبَۃِ النِّسَآءِ اَوۡ اَکۡنَنۡتُمۡ فِیۡۤ  اَنۡفُسِکُمۡ ؕ عَلِمَ اللّٰہُ  اَنَّکُمۡ سَتَذۡکُرُوۡنَہُنَّ وَ لٰکِنۡ لَّا تُوَاعِدُوۡہُنَّ سِرًّا اِلَّاۤ اَنۡ تَقُوۡلُوۡا قَوۡلًا مَّعۡرُوۡفًا  ۬ؕ وَ لَا تَعۡزِمُوۡا عُقۡدَۃَ النِّکَاحِ حَتّٰی یَبۡلُغَ الۡکِتٰبُ اَجَلَہٗ ؕ وَ اعۡلَمُوۡۤا اَنَّ اللّٰہَ یَعۡلَمُ مَا فِیۡۤ اَنۡفُسِکُمۡ فَاحۡذَرُوۡہُ ۚ وَ اعۡلَمُوۡۤا اَنَّ اللّٰہَ غَفُوۡرٌ حَلِیۡمٌ ﴿۲۳۵﴾٪",
                    "لَا جُنَاحَ عَلَیۡکُمۡ  اِنۡ طَلَّقۡتُمُ النِّسَآءَ مَا لَمۡ تَمَسُّوۡہُنَّ اَوۡ تَفۡرِضُوۡا لَہُنَّ فَرِیۡضَۃً ۚۖ وَّ مَتِّعُوۡہُنَّ ۚ عَلَی الۡمُوۡسِعِ قَدَرُہٗ  وَ عَلَی الۡمُقۡتِرِ قَدَرُہٗ ۚ مَتَاعًۢا بِالۡمَعۡرُوۡفِ ۚ حَقًّا عَلَی الۡمُحۡسِنِیۡنَ ﴿۲۳۶﴾",
                    "وَ اِنۡ طَلَّقۡتُمُوۡہُنَّ مِنۡ قَبۡلِ اَنۡ تَمَسُّوۡہُنَّ وَ قَدۡ فَرَضۡتُمۡ لَہُنَّ فَرِیۡضَۃً فَنِصۡفُ مَا فَرَضۡتُمۡ  اِلَّاۤ  اَنۡ یَّعۡفُوۡنَ اَوۡ یَعۡفُوَا الَّذِیۡ بِیَدِہٖ عُقۡدَۃُ النِّکَاحِ ؕ وَ اَنۡ تَعۡفُوۡۤا اَقۡرَبُ لِلتَّقۡوٰی ؕ وَ لَا تَنۡسَوُا الۡفَضۡلَ بَیۡنَکُمۡ ؕ اِنَّ اللّٰہَ بِمَا تَعۡمَلُوۡنَ بَصِیۡرٌ ﴿۲۳۷﴾",
                    "حٰفِظُوۡا عَلَی الصَّلَوٰتِ وَ الصَّلٰوۃِ الۡوُسۡطٰی ٭ وَ قُوۡمُوۡا لِلّٰہِ  قٰنِتِیۡنَ ﴿۲۳۸﴾",
                    "فَاِنۡ خِفۡتُمۡ  فَرِجَالًا اَوۡ  رُکۡبَانًا ۚ فَاِذَاۤ اَمِنۡتُمۡ  فَاذۡکُرُوا اللّٰہَ  کَمَا عَلَّمَکُمۡ مَّا لَمۡ تَکُوۡنُوۡا تَعۡلَمُوۡنَ ﴿۲۳۹﴾",
                    "وَ الَّذِیۡنَ یُتَوَفَّوۡنَ مِنۡکُمۡ وَ یَذَرُوۡنَ اَزۡوَاجًا ۚۖ وَّصِیَّۃً  لِّاَزۡوَاجِہِمۡ مَّتَاعًا اِلَی الۡحَوۡلِ غَیۡرَ   اِخۡرَاجٍ ۚ فَاِنۡ  خَرَجۡنَ فَلَا جُنَاحَ عَلَیۡکُمۡ فِیۡ مَا فَعَلۡنَ فِیۡۤ  اَنۡفُسِہِنَّ مِنۡ مَّعۡرُوۡفٍ ؕ وَ اللّٰہُ عَزِیۡزٌ حَکِیۡمٌ ﴿۲۴۰﴾",
                    "وَ لِلۡمُطَلَّقٰتِ مَتَاعٌۢ بِالۡمَعۡرُوۡفِ ؕ حَقًّا عَلَی  الۡمُتَّقِیۡنَ ﴿۲۴۱﴾",
                    "کَذٰلِکَ یُبَیِّنُ اللّٰہُ لَکُمۡ اٰیٰتِہٖ لَعَلَّکُمۡ تَعۡقِلُوۡنَ ﴿۲۴۲﴾٪",
                    "اَلَمۡ تَرَ  اِلَی الَّذِیۡنَ خَرَجُوۡا مِنۡ دِیَارِہِمۡ وَ ہُمۡ اُلُوۡفٌ حَذَرَ الۡمَوۡتِ  ۪ فَقَالَ لَہُمُ اللّٰہُ  مُوۡتُوۡا ۟ ثُمَّ  اَحۡیَاہُمۡ  ؕ اِنَّ اللّٰہَ لَذُوۡ فَضۡلٍ عَلَی النَّاسِ وَ لٰکِنَّ  اَکۡثَرَ  النَّاسِ لَا یَشۡکُرُوۡنَ ﴿۲۴۳﴾",
                    "وَ قَاتِلُوۡا فِیۡ سَبِیۡلِ اللّٰہِ وَ اعۡلَمُوۡۤا اَنَّ اللّٰہَ سَمِیۡعٌ عَلِیۡمٌ ﴿۲۴۴﴾",
                    "مَنۡ ذَا الَّذِیۡ یُقۡرِضُ اللّٰہَ  قَرۡضًا حَسَنًا فَیُضٰعِفَہٗ لَہٗۤ اَضۡعَافًا کَثِیۡرَۃً ؕ وَ اللّٰہُ یَقۡبِضُ وَ یَبۡصُۜطُ  ۪ وَ اِلَیۡہِ  تُرۡجَعُوۡنَ ﴿۲۴۵﴾",
                    "اَلَمۡ تَرَ  اِلَی الۡمَلَاِ مِنۡۢ بَنِیۡۤ  اِسۡرَآءِیۡلَ مِنۡۢ بَعۡدِ مُوۡسٰی ۘ اِذۡ  قَالُوۡا لِنَبِیٍّ لَّہُمُ ابۡعَثۡ لَنَا مَلِکًا نُّقَاتِلۡ فِیۡ سَبِیۡلِ اللّٰہِ ؕ قَالَ ہَلۡ عَسَیۡتُمۡ  اِنۡ کُتِبَ عَلَیۡکُمُ الۡقِتَالُ اَلَّا تُقَاتِلُوۡا ؕ قَالُوۡا وَ مَا لَنَاۤ  اَلَّا نُقَاتِلَ فِیۡ سَبِیۡلِ اللّٰہِ وَ قَدۡ اُخۡرِجۡنَا مِنۡ دِیَارِنَا وَ اَبۡنَآئِنَا ؕ فَلَمَّا کُتِبَ عَلَیۡہِمُ الۡقِتَالُ تَوَلَّوۡا اِلَّا قَلِیۡلًا مِّنۡہُمۡ ؕ وَ اللّٰہُ عَلِیۡمٌۢ  بِالظّٰلِمِیۡنَ ﴿۲۴۶﴾",
                    "وَ قَالَ لَہُمۡ نَبِیُّہُمۡ  اِنَّ اللّٰہَ قَدۡ بَعَثَ لَکُمۡ طَالُوۡتَ مَلِکًا ؕ قَالُوۡۤا  اَنّٰی یَکُوۡنُ لَہُ الۡمُلۡکُ عَلَیۡنَا وَ نَحۡنُ اَحَقُّ بِالۡمُلۡکِ مِنۡہُ وَ لَمۡ یُؤۡتَ سَعَۃً مِّنَ الۡمَالِ ؕ قَالَ  اِنَّ اللّٰہَ  اصۡطَفٰٮہُ عَلَیۡکُمۡ وَ زَادَہٗ بَسۡطَۃً فِی الۡعِلۡمِ وَ الۡجِسۡمِ ؕ وَ اللّٰہُ یُؤۡتِیۡ مُلۡکَہٗ مَنۡ یَّشَآءُ ؕ وَ اللّٰہُ  وَاسِعٌ عَلِیۡمٌ ﴿۲۴۷﴾",
                    "وَ قَالَ لَہُمۡ نَبِیُّہُمۡ اِنَّ اٰیَۃَ مُلۡکِہٖۤ اَنۡ یَّاۡتِیَکُمُ التَّابُوۡتُ فِیۡہِ سَکِیۡنَۃٌ مِّنۡ رَّبِّکُمۡ وَ بَقِیَّۃٌ   مِّمَّا تَرَکَ اٰلُ مُوۡسٰی وَ اٰلُ ہٰرُوۡنَ تَحۡمِلُہُ الۡمَلٰٓئِکَۃُ ؕ اِنَّ فِیۡ ذٰلِکَ لَاٰیَۃً لَّکُمۡ  اِنۡ  کُنۡتُمۡ مُّؤۡمِنِیۡنَ ﴿۲۴۸﴾٪",
                    "فَلَمَّا فَصَلَ طَالُوۡتُ بِالۡجُنُوۡدِ  ۙ قَالَ  اِنَّ اللّٰہَ مُبۡتَلِیۡکُمۡ بِنَہَرٍ ۚ فَمَنۡ شَرِبَ مِنۡہُ فَلَیۡسَ مِنِّیۡ ۚ وَ مَنۡ لَّمۡ یَطۡعَمۡہُ فَاِنَّہٗ مِنِّیۡۤ  اِلَّا مَنِ اغۡتَرَفَ غُرۡفَۃًۢ بِیَدِہٖ ۚ فَشَرِبُوۡا مِنۡہُ اِلَّا قَلِیۡلًا مِّنۡہُمۡ ؕ فَلَمَّا جَاوَزَہٗ ہُوَ وَ الَّذِیۡنَ اٰمَنُوۡا مَعَہٗ  ۙ قَالُوۡا لَا طَاقَۃَ لَنَا الۡیَوۡمَ بِجَالُوۡتَ وَ جُنُوۡدِہٖ ؕ قَالَ الَّذِیۡنَ یَظُنُّوۡنَ اَنَّہُمۡ مُّلٰقُوا اللّٰہِ  ۙ  کَمۡ مِّنۡ فِئَۃٍ قَلِیۡلَۃٍ غَلَبَتۡ فِئَۃً  کَثِیۡرَۃًۢ بِاِذۡنِ  اللّٰہِ ؕ وَ اللّٰہُ مَعَ  الصّٰبِرِیۡنَ ﴿۲۴۹﴾",
                    "وَ لَمَّا بَرَزُوۡا لِجَالُوۡتَ وَ جُنُوۡدِہٖ قَالُوۡا رَبَّنَاۤ  اَفۡرِغۡ عَلَیۡنَا صَبۡرًا وَّ ثَبِّتۡ اَقۡدَامَنَا وَ انۡصُرۡنَا عَلَی الۡقَوۡمِ الۡکٰفِرِیۡنَ ﴿۲۵۰﴾ؕ",
                    "فَہَزَمُوۡہُمۡ  بِاِذۡنِ اللّٰہِ ۟ۙ وَ قَتَلَ دَاوٗدُ جَالُوۡتَ وَ اٰتٰٮہُ اللّٰہُ  الۡمُلۡکَ وَ الۡحِکۡمَۃَ وَ عَلَّمَہٗ مِمَّا یَشَآءُ ؕ وَ لَوۡ لَا دَفۡعُ اللّٰہِ النَّاسَ بَعۡضَہُمۡ بِبَعۡضٍ ۙ لَّفَسَدَتِ الۡاَرۡضُ وَ لٰکِنَّ اللّٰہَ ذُوۡ فَضۡلٍ عَلَی الۡعٰلَمِیۡنَ ﴿۲۵۱﴾",
                    "تِلۡکَ اٰیٰتُ اللّٰہِ نَتۡلُوۡہَا عَلَیۡکَ بِالۡحَقِّ ؕ وَ  اِنَّکَ لَمِنَ الۡمُرۡسَلِیۡنَ ﴿۲۵۲﴾",
                    "تِلۡکَ الرُّسُلُ  فَضَّلۡنَا بَعۡضَہُمۡ عَلٰی بَعۡضٍ ۘ مِنۡہُمۡ مَّنۡ کَلَّمَ اللّٰہُ وَ رَفَعَ بَعۡضَہُمۡ  دَرَجٰتٍ ؕ وَ اٰتَیۡنَا عِیۡسَی  ابۡنَ مَرۡیَمَ الۡبَیِّنٰتِ وَ اَیَّدۡنٰہُ بِرُوۡحِ الۡقُدُسِ ؕ وَ لَوۡ شَآءَ اللّٰہُ مَا اقۡتَتَلَ الَّذِیۡنَ مِنۡۢ بَعۡدِہِمۡ مِّنۡۢ بَعۡدِ مَا جَآءَتۡہُمُ الۡبَیِّنٰتُ وَ لٰکِنِ اخۡتَلَفُوۡا فَمِنۡہُمۡ مَّنۡ اٰمَنَ وَ مِنۡہُمۡ مَّنۡ  کَفَرَ ؕ وَ لَوۡ شَآءَ اللّٰہُ  مَا اقۡتَتَلُوۡا ۟ وَ لٰکِنَّ اللّٰہَ یَفۡعَلُ  مَا یُرِیۡدُ ﴿۲۵۳﴾٪",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اَنۡفِقُوۡا مِمَّا رَزَقۡنٰکُمۡ مِّنۡ قَبۡلِ اَنۡ یَّاۡتِیَ یَوۡمٌ لَّا بَیۡعٌ فِیۡہِ وَ لَا خُلَّۃٌ وَّ لَا شَفَاعَۃٌ ؕ وَ الۡکٰفِرُوۡنَ ہُمُ  الظّٰلِمُوۡنَ ﴿۲۵۴﴾",
                    "اَللّٰہُ لَاۤ اِلٰہَ اِلَّا ہُوَۚ اَلۡحَیُّ الۡقَیُّوۡمُ ۬ۚ لَا تَاۡخُذُہٗ سِنَۃٌ وَّ لَا نَوۡمٌ ؕ لَہٗ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ؕ مَنۡ ذَا الَّذِیۡ یَشۡفَعُ  عِنۡدَہٗۤ  اِلَّا بِاِذۡنِہٖ ؕ یَعۡلَمُ مَا بَیۡنَ اَیۡدِیۡہِمۡ وَ مَا خَلۡفَہُمۡ  ۚ وَ لَا یُحِیۡطُوۡنَ بِشَیۡءٍ مِّنۡ عِلۡمِہٖۤ اِلَّا بِمَا شَآءَ ۚ وَسِعَ کُرۡسِیُّہُ السَّمٰوٰتِ وَ الۡاَرۡضَ ۚ وَ لَا یَـُٔوۡدُہٗ حِفۡظُہُمَا ۚ وَ ہُوَ الۡعَلِیُّ  الۡعَظِیۡمُ ﴿۲۵۵﴾",
                    "لَاۤ اِکۡرَاہَ فِی الدِّیۡنِ ۟ۙ قَدۡ تَّبَیَّنَ الرُّشۡدُ مِنَ الۡغَیِّ ۚ فَمَنۡ یَّکۡفُرۡ بِالطَّاغُوۡتِ وَ یُؤۡمِنۡۢ بِاللّٰہِ فَقَدِ اسۡتَمۡسَکَ بِالۡعُرۡوَۃِ الۡوُثۡقٰی ٭ لَا انۡفِصَامَ  لَہَا ؕ وَ اللّٰہُ سَمِیۡعٌ عَلِیۡمٌ ﴿۲۵۶﴾",
                    "اَللّٰہُ وَلِیُّ الَّذِیۡنَ اٰمَنُوۡا ۙ یُخۡرِجُہُمۡ مِّنَ الظُّلُمٰتِ اِلَی النُّوۡرِ۬ؕ وَ الَّذِیۡنَ کَفَرُوۡۤا اَوۡلِیٰٓـُٔہُمُ الطَّاغُوۡتُ ۙ یُخۡرِجُوۡنَہُمۡ مِّنَ النُّوۡرِ اِلَی الظُّلُمٰتِ ؕ اُولٰٓئِکَ اَصۡحٰبُ النَّارِ ۚ ہُمۡ  فِیۡہَا خٰلِدُوۡنَ ﴿۲۵۷﴾٪",
                    "اَلَمۡ تَرَ اِلَی الَّذِیۡ حَآجَّ اِبۡرٰہٖمَ فِیۡ رَبِّہٖۤ اَنۡ اٰتٰٮہُ اللّٰہُ الۡمُلۡکَ ۘ اِذۡ  قَالَ اِبۡرٰہٖمُ رَبِّیَ الَّذِیۡ یُحۡیٖ وَ یُمِیۡتُ ۙ قَالَ اَنَا اُحۡیٖ وَ اُمِیۡتُ ؕ قَالَ اِبۡرٰہٖمُ  فَاِنَّ اللّٰہَ یَاۡتِیۡ بِالشَّمۡسِ مِنَ الۡمَشۡرِقِ فَاۡتِ بِہَا مِنَ الۡمَغۡرِبِ فَبُہِتَ الَّذِیۡ کَفَرَ ؕ وَ اللّٰہُ لَا یَہۡدِی الۡقَوۡمَ الظّٰلِمِیۡنَ ﴿۲۵۸﴾ۚ",
                    "اَوۡ کَالَّذِیۡ مَرَّ عَلٰی قَرۡیَۃٍ وَّ ہِیَ خَاوِیَۃٌ عَلٰی عُرُوۡشِہَا ۚ قَالَ اَنّٰی یُحۡیٖ ہٰذِہِ  اللّٰہُ بَعۡدَ مَوۡتِہَا ۚ فَاَمَاتَہُ اللّٰہُ مِائَۃَ عَامٍ ثُمَّ بَعَثَہٗ ؕ قَالَ کَمۡ لَبِثۡتَ ؕ قَالَ لَبِثۡتُ یَوۡمًا اَوۡ بَعۡضَ یَوۡمٍ ؕ قَالَ بَلۡ لَّبِثۡتَ مِائَۃَ عَامٍ فَانۡظُرۡ  اِلٰی طَعَامِکَ وَ شَرَابِکَ لَمۡ یَتَسَنَّہۡ ۚ وَ انۡظُرۡ اِلٰی حِمَارِکَ وَ لِنَجۡعَلَکَ اٰیَۃً لِّلنَّاسِ وَ انۡظُرۡ اِلَی الۡعِظَامِ کَیۡفَ نُنۡشِزُہَا ثُمَّ نَکۡسُوۡہَا لَحۡمًا ؕ فَلَمَّا تَبَیَّنَ لَہٗ ۙ قَالَ اَعۡلَمُ  اَنَّ اللّٰہَ  عَلٰی کُلِّ شَیۡءٍ قَدِیۡرٌ ﴿۲۵۹﴾",
                    "وَ اِذۡ قَالَ اِبۡرٰہٖمُ  رَبِّ اَرِنِیۡ  کَیۡفَ تُحۡیِ الۡمَوۡتٰی ؕ  قَالَ اَوَ لَمۡ تُؤۡمِنۡ ؕ قَالَ بَلٰی وَ لٰکِنۡ لِّیَطۡمَئِنَّ قَلۡبِیۡ ؕ قَالَ فَخُذۡ اَرۡبَعَۃً مِّنَ الطَّیۡرِ فَصُرۡہُنَّ اِلَیۡکَ ثُمَّ اجۡعَلۡ عَلٰی کُلِّ جَبَلٍ مِّنۡہُنَّ جُزۡءًا ثُمَّ ادۡعُہُنَّ یَاۡتِیۡنَکَ سَعۡیًا ؕ وَ اعۡلَمۡ اَنَّ اللّٰہَ عَزِیۡزٌ  حَکِیۡمٌ ﴿۲۶۰﴾٪",
                    "مَثَلُ الَّذِیۡنَ یُنۡفِقُوۡنَ اَمۡوَالَہُمۡ فِیۡ سَبِیۡلِ اللّٰہِ کَمَثَلِ حَبَّۃٍ اَنۡۢبَتَتۡ سَبۡعَ سَنَابِلَ فِیۡ کُلِّ سُنۡۢبُلَۃٍ مِّائَۃُ حَبَّۃٍ ؕ وَ اللّٰہُ یُضٰعِفُ لِمَنۡ یَّشَآءُ ؕ وَ اللّٰہُ  وَاسِعٌ عَلِیۡمٌ ﴿۲۶۱﴾",
                    "اَلَّذِیۡنَ یُنۡفِقُوۡنَ اَمۡوَالَہُمۡ فِیۡ سَبِیۡلِ اللّٰہِ ثُمَّ لَا یُتۡبِعُوۡنَ مَاۤ  اَنۡفَقُوۡا مَنًّا وَّ لَاۤ  اَذًی ۙ لَّہُمۡ اَجۡرُہُمۡ عِنۡدَ رَبِّہِمۡ ۚ وَ لَا خَوۡفٌ عَلَیۡہِمۡ  وَ لَا ہُمۡ  یَحۡزَنُوۡنَ ﴿۲۶۲﴾",
                    "قَوۡلٌ مَّعۡرُوۡفٌ وَّ مَغۡفِرَۃٌ خَیۡرٌ مِّنۡ صَدَقَۃٍ یَّتۡبَعُہَاۤ  اَذًی ؕ وَ اللّٰہُ غَنِیٌّ حَلِیۡمٌ ﴿۲۶۳﴾",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تُبۡطِلُوۡا صَدَقٰتِکُمۡ بِالۡمَنِّ وَ الۡاَذٰی ۙ کَالَّذِیۡ یُنۡفِقُ مَالَہٗ رِئَآءَ النَّاسِ وَ لَا یُؤۡمِنُ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِؕ فَمَثَلُہٗ  کَمَثَلِ صَفۡوَانٍ عَلَیۡہِ تُرَابٌ فَاَصَابَہٗ وَابِلٌ فَتَرَکَہٗ صَلۡدًا ؕ لَا  یَقۡدِرُوۡنَ عَلٰی شَیۡءٍ مِّمَّا کَسَبُوۡا ؕ وَ اللّٰہُ  لَا یَہۡدِی الۡقَوۡمَ الۡکٰفِرِیۡنَ ﴿۲۶۴﴾",
                    "وَ مَثَلُ الَّذِیۡنَ یُنۡفِقُوۡنَ اَمۡوَالَہُمُ ابۡتِغَآءَ مَرۡضَاتِ اللّٰہِ وَ تَثۡبِیۡتًا مِّنۡ اَنۡفُسِہِمۡ کَمَثَلِ جَنَّۃٍۭ بِرَبۡوَۃٍ اَصَابَہَا وَابِلٌ فَاٰتَتۡ اُکُلَہَا ضِعۡفَیۡنِ ۚ فَاِنۡ لَّمۡ یُصِبۡہَا وَابِلٌ فَطَلٌّ ؕ وَ اللّٰہُ بِمَا تَعۡمَلُوۡنَ  بَصِیۡرٌ ﴿۲۶۵﴾",
                    "اَیَوَدُّ اَحَدُکُمۡ اَنۡ تَکُوۡنَ لَہٗ جَنَّۃٌ مِّنۡ نَّخِیۡلٍ وَّ اَعۡنَابٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ ۙ لَہٗ فِیۡہَا مِنۡ کُلِّ الثَّمَرٰتِ ۙ وَ اَصَابَہُ الۡکِبَرُ وَ لَہٗ ذُرِّیَّۃٌ ضُعَفَآءُ ۪ۖ فَاَصَابَہَاۤ اِعۡصَارٌ فِیۡہِ نَارٌ فَاحۡتَرَقَتۡ ؕ  کَذٰلِکَ یُبَیِّنُ اللّٰہُ لَکُمُ الۡاٰیٰتِ لَعَلَّکُمۡ تَتَفَکَّرُوۡنَ ﴿۲۶۶﴾٪",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اَنۡفِقُوۡا مِنۡ طَیِّبٰتِ مَا کَسَبۡتُمۡ وَ مِمَّاۤ اَخۡرَجۡنَا لَکُمۡ مِّنَ الۡاَرۡضِ ۪ وَ لَا تَیَمَّمُوا الۡخَبِیۡثَ مِنۡہُ تُنۡفِقُوۡنَ وَ لَسۡتُمۡ بِاٰخِذِیۡہِ اِلَّاۤ اَنۡ تُغۡمِضُوۡا فِیۡہِ ؕ وَ اعۡلَمُوۡۤا  اَنَّ اللّٰہَ غَنِیٌّ حَمِیۡدٌ ﴿۲۶۷﴾",
                    "اَلشَّیۡطٰنُ یَعِدُکُمُ الۡفَقۡرَ وَ یَاۡمُرُکُمۡ بِالۡفَحۡشَآءِ ۚ وَ اللّٰہُ یَعِدُکُمۡ مَّغۡفِرَۃً مِّنۡہُ  وَ فَضۡلًا ؕ وَ اللّٰہُ وَاسِعٌ عَلِیۡمٌ ﴿۲۶۸﴾ۖۙ",
                    "یُّؤۡتِی الۡحِکۡمَۃَ مَنۡ یَّشَآءُ ۚ وَ مَنۡ یُّؤۡتَ الۡحِکۡمَۃَ فَقَدۡ اُوۡتِیَ خَیۡرًا کَثِیۡرًا ؕ وَ مَا یَذَّکَّرُ  اِلَّاۤ  اُولُوا الۡاَلۡبَابِ ﴿۲۶۹﴾",
                    "وَ مَاۤ اَنۡفَقۡتُمۡ مِّنۡ نَّفَقَۃٍ اَوۡ نَذَرۡتُمۡ مِّنۡ نَّذۡرٍ فَاِنَّ اللّٰہَ یَعۡلَمُہٗ ؕ وَ مَا لِلظّٰلِمِیۡنَ مِنۡ  اَنۡصَارٍ ﴿۲۷۰﴾",
                    "اِنۡ تُبۡدُوا الصَّدَقٰتِ فَنِعِمَّا ہِیَ ۚ وَ اِنۡ تُخۡفُوۡہَا وَ تُؤۡتُوۡہَا الۡفُقَرَآءَ فَہُوَ خَیۡرٌ لَّکُمۡ ؕ وَ یُکَفِّرُ عَنۡکُمۡ مِّنۡ سَیِّاٰتِکُمۡ ؕ وَ اللّٰہُ بِمَا تَعۡمَلُوۡنَ خَبِیۡرٌ ﴿۲۷۱﴾",
                    "لَیۡسَ عَلَیۡکَ ہُدٰٮہُمۡ وَ لٰکِنَّ اللّٰہَ یَہۡدِیۡ مَنۡ یَّشَآءُ ؕ وَ مَا تُنۡفِقُوۡا مِنۡ خَیۡرٍ فَلِاَنۡفُسِکُمۡ ؕ وَ مَا تُنۡفِقُوۡنَ اِلَّا ابۡتِغَآءَ وَجۡہِ اللّٰہِ ؕ وَ مَا تُنۡفِقُوۡا مِنۡ خَیۡرٍ یُّوَفَّ اِلَیۡکُمۡ وَ اَنۡتُمۡ لَا تُظۡلَمُوۡنَ ﴿۲۷۲﴾",
                    "لِلۡفُقَرَآءِ الَّذِیۡنَ اُحۡصِرُوۡا فِیۡ سَبِیۡلِ اللّٰہِ لَا یَسۡتَطِیۡعُوۡنَ ضَرۡبًا فِی الۡاَرۡضِ ۫ یَحۡسَبُہُمُ الۡجَاہِلُ اَغۡنِیَآءَ مِنَ التَّعَفُّفِ ۚ تَعۡرِفُہُمۡ بِسِیۡمٰہُمۡ ۚ لَا یَسۡـَٔلُوۡنَ النَّاسَ اِلۡحَافًا ؕ وَ مَا تُنۡفِقُوۡا مِنۡ خَیۡرٍ فَاِنَّ اللّٰہَ بِہٖ عَلِیۡمٌ ﴿۲۷۳﴾٪",
                    "اَلَّذِیۡنَ یُنۡفِقُوۡنَ اَمۡوَالَہُمۡ بِالَّیۡلِ وَ النَّہَارِ سِرًّا وَّ عَلَانِیَۃً فَلَہُمۡ اَجۡرُہُمۡ عِنۡدَ رَبِّہِمۡ ۚ وَ لَا خَوۡفٌ عَلَیۡہِمۡ وَ لَا ہُمۡ یَحۡزَنُوۡنَ ﴿۲۷۴﴾ؔ",
                    "اَلَّذِیۡنَ یَاۡکُلُوۡنَ الرِّبٰوا لَا یَقُوۡمُوۡنَ اِلَّا کَمَا یَقُوۡمُ الَّذِیۡ یَتَخَبَّطُہُ الشَّیۡطٰنُ مِنَ الۡمَسِّ ؕ ذٰلِکَ بِاَنَّہُمۡ قَالُوۡۤا اِنَّمَا الۡبَیۡعُ مِثۡلُ الرِّبٰوا ۘ وَ اَحَلَّ اللّٰہُ الۡبَیۡعَ وَ حَرَّمَ الرِّبٰوا ؕ فَمَنۡ جَآءَہٗ مَوۡعِظَۃٌ مِّنۡ رَّبِّہٖ فَانۡتَہٰی فَلَہٗ مَا سَلَفَ ؕ وَ اَمۡرُہٗۤ اِلَی اللّٰہِ ؕ وَ مَنۡ عَادَ فَاُولٰٓئِکَ اَصۡحٰبُ النَّارِ ۚ ہُمۡ فِیۡہَا خٰلِدُوۡنَ ﴿۲۷۵﴾",
                    "یَمۡحَقُ اللّٰہُ الرِّبٰوا وَ یُرۡبِی الصَّدَقٰتِ ؕ وَ اللّٰہُ  لَا یُحِبُّ کُلَّ  کَفَّارٍ اَثِیۡمٍ ﴿۲۷۶﴾",
                    "اِنَّ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ وَ اَقَامُوا الصَّلٰوۃَ وَ اٰتَوُا الزَّکٰوۃَ لَہُمۡ اَجۡرُہُمۡ عِنۡدَ رَبِّہِمۡ ۚ وَ لَا خَوۡفٌ عَلَیۡہِمۡ وَ لَا ہُمۡ  یَحۡزَنُوۡنَ ﴿۲۷۷﴾",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوا اتَّقُوا اللّٰہَ وَ ذَرُوۡا مَا بَقِیَ مِنَ الرِّبٰۤوا اِنۡ کُنۡتُمۡ مُّؤۡمِنِیۡنَ ﴿۲۷۸﴾",
                    "فَاِنۡ لَّمۡ تَفۡعَلُوۡا فَاۡذَنُوۡا بِحَرۡبٍ مِّنَ اللّٰہِ وَ رَسُوۡلِہٖ ۚ وَ  اِنۡ تُبۡتُمۡ  فَلَکُمۡ رُءُوۡسُ اَمۡوَالِکُمۡ ۚ لَا تَظۡلِمُوۡنَ وَ لَا تُظۡلَمُوۡنَ ﴿۲۷۹﴾",
                    "وَ اِنۡ کَانَ ذُوۡ عُسۡرَۃٍ فَنَظِرَۃٌ اِلٰی مَیۡسَرَۃٍ ؕ وَ اَنۡ تَصَدَّقُوۡا خَیۡرٌ لَّکُمۡ اِنۡ  کُنۡتُمۡ تَعۡلَمُوۡنَ ﴿۲۸۰﴾",
                    "وَ اتَّقُوۡا یَوۡمًا تُرۡجَعُوۡنَ فِیۡہِ  اِلَی اللّٰہِ ٭۟ ثُمَّ تُوَفّٰی کُلُّ نَفۡسٍ مَّا کَسَبَتۡ وَ ہُمۡ لَا  یُظۡلَمُوۡنَ ﴿۲۸۱﴾٪",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِذَا تَدَایَنۡتُمۡ بِدَیۡنٍ اِلٰۤی اَجَلٍ مُّسَمًّی فَاکۡتُبُوۡہُ ؕ وَ لۡیَکۡتُبۡ بَّیۡنَکُمۡ کَاتِبٌۢ بِالۡعَدۡلِ ۪ وَ لَا یَاۡبَ کَاتِبٌ اَنۡ یَّکۡتُبَ کَمَا عَلَّمَہُ اللّٰہُ فَلۡیَکۡتُبۡ ۚ وَ لۡیُمۡلِلِ الَّذِیۡ عَلَیۡہِ الۡحَقُّ وَ لۡیَتَّقِ اللّٰہَ رَبَّہٗ وَ لَا یَبۡخَسۡ مِنۡہُ شَیۡئًا ؕ فَاِنۡ کَانَ الَّذِیۡ عَلَیۡہِ الۡحَقُّ سَفِیۡہًا اَوۡ ضَعِیۡفًا اَوۡ لَا یَسۡتَطِیۡعُ اَنۡ یُّمِلَّ ہُوَ  فَلۡیُمۡلِلۡ وَلِیُّہٗ بِالۡعَدۡلِ ؕ وَ اسۡتَشۡہِدُوۡا شَہِیۡدَیۡنِ مِنۡ رِّجَالِکُمۡ ۚ فَاِنۡ لَّمۡ یَکُوۡنَا رَجُلَیۡنِ فَرَجُلٌ وَّ امۡرَاَتٰنِ مِمَّنۡ تَرۡضَوۡنَ مِنَ الشُّہَدَآءِ اَنۡ تَضِلَّ اِحۡدٰٮہُمَا فَتُذَکِّرَ اِحۡدٰٮہُمَا الۡاُخۡرٰی ؕ وَ لَا یَاۡبَ الشُّہَدَآءُ اِذَا مَا دُعُوۡا ؕ وَ لَا تَسۡـَٔمُوۡۤا اَنۡ تَکۡتُبُوۡہُ صَغِیۡرًا اَوۡ کَبِیۡرًا اِلٰۤی اَجَلِہٖ ؕ ذٰلِکُمۡ اَقۡسَطُ عِنۡدَ اللّٰہِ وَ اَقۡوَمُ لِلشَّہَادَۃِ وَ اَدۡنٰۤی اَلَّا تَرۡتَابُوۡۤا اِلَّاۤ اَنۡ تَکُوۡنَ تِجَارَۃً حَاضِرَۃً  تُدِیۡرُوۡنَہَا بَیۡنَکُمۡ فَلَیۡسَ عَلَیۡکُمۡ جُنَاحٌ اَلَّا تَکۡتُبُوۡہَا ؕ وَ اَشۡہِدُوۡۤا اِذَا تَبَایَعۡتُمۡ ۪ وَ لَا یُضَآرَّ کَاتِبٌ وَّ لَا شَہِیۡدٌ ۬ؕ وَ  اِنۡ تَفۡعَلُوۡا فَاِنَّہٗ فُسُوۡقٌۢ بِکُمۡ ؕ وَ اتَّقُوا اللّٰہَ ؕ وَ یُعَلِّمُکُمُ اللّٰہُ ؕ وَ اللّٰہُ بِکُلِّ شَیۡءٍ  عَلِیۡمٌ ﴿۲۸۲﴾",
                    "وَ اِنۡ کُنۡتُمۡ عَلٰی سَفَرٍ وَّ لَمۡ تَجِدُوۡا کَاتِبًا فَرِہٰنٌ مَّقۡبُوۡضَۃٌ ؕ فَاِنۡ اَمِنَ بَعۡضُکُمۡ بَعۡضًا فَلۡیُؤَدِّ الَّذِی اؤۡتُمِنَ اَمَانَتَہٗ وَ لۡیَتَّقِ اللّٰہَ رَبَّہٗ ؕ وَ لَا تَکۡتُمُوا الشَّہَادَۃَ ؕ وَ مَنۡ یَّکۡتُمۡہَا فَاِنَّہٗۤ اٰثِمٌ قَلۡبُہٗ ؕ وَ اللّٰہُ بِمَا تَعۡمَلُوۡنَ عَلِیۡمٌ ﴿۲۸۳﴾٪",
                    "لِلّٰہِ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ؕ وَ اِنۡ تُبۡدُوۡا مَا فِیۡۤ  اَنۡفُسِکُمۡ اَوۡ تُخۡفُوۡہُ یُحَاسِبۡکُمۡ بِہِ  اللّٰہُ ؕ فَیَغۡفِرُ   لِمَنۡ یَّشَآءُ  وَ یُعَذِّبُ مَنۡ یَّشَآءُ ؕ وَ اللّٰہُ عَلٰی کُلِّ شَیۡءٍ  قَدِیۡرٌ ﴿۲۸۴﴾",
                    "اٰمَنَ الرَّسُوۡلُ بِمَاۤ  اُنۡزِلَ اِلَیۡہِ مِنۡ رَّبِّہٖ وَ الۡمُؤۡمِنُوۡنَ ؕ کُلٌّ اٰمَنَ بِاللّٰہِ وَ مَلٰٓئِکَتِہٖ وَ کُتُبِہٖ وَ رُسُلِہٖ ۟ لَا نُفَرِّقُ بَیۡنَ  اَحَدٍ مِّنۡ رُّسُلِہٖ ۟ وَ قَالُوۡا سَمِعۡنَا وَ اَطَعۡنَا ٭۫ غُفۡرَانَکَ رَبَّنَا وَ اِلَیۡکَ الۡمَصِیۡرُ ﴿۲۸۵﴾",
                    "لَا یُکَلِّفُ اللّٰہُ نَفۡسًا اِلَّا وُسۡعَہَا ؕ لَہَا مَا کَسَبَتۡ وَ عَلَیۡہَا مَا اکۡتَسَبَتۡ ؕ رَبَّنَا لَا تُؤَاخِذۡنَاۤ  اِنۡ نَّسِیۡنَاۤ  اَوۡ اَخۡطَاۡنَا ۚ رَبَّنَا وَ لَا  تَحۡمِلۡ عَلَیۡنَاۤ  اِصۡرًا کَمَا حَمَلۡتَہٗ عَلَی الَّذِیۡنَ مِنۡ قَبۡلِنَا ۚ رَبَّنَا وَ لَا  تُحَمِّلۡنَا مَا لَا طَاقَۃَ لَنَا بِہٖ ۚ وَ اعۡفُ عَنَّا ٝ وَ اغۡفِرۡ لَنَا ٝ وَ ارۡحَمۡنَا ٝ اَنۡتَ مَوۡلٰٮنَا فَانۡصُرۡنَا عَلَی الۡقَوۡمِ الۡکٰفِرِیۡنَ ﴿۲۸۶﴾٪"                ]
    }
]
