[{"number":"004",
  "name":"النِّســاء",
  "verse":[ 
                    "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ",
                    "یٰۤاَیُّہَا النَّاسُ اتَّقُوۡا رَبَّکُمُ الَّذِیۡ خَلَقَکُمۡ مِّنۡ نَّفۡسٍ وَّاحِدَۃٍ وَّ خَلَقَ مِنۡہَا زَوۡجَہَا وَ بَثَّ مِنۡہُمَا رِجَالًا کَثِیۡرًا وَّ نِسَآءً ۚ وَ اتَّقُوا اللّٰہَ الَّذِیۡ تَسَآءَلُوۡنَ بِہٖ وَ الۡاَرۡحَامَ ؕ اِنَّ اللّٰہَ کَانَ عَلَیۡکُمۡ  رَقِیۡبًا ﴿۱﴾",
                    "وَ اٰتُوا الۡیَتٰمٰۤی اَمۡوَالَہُمۡ وَ لَا تَتَبَدَّلُوا الۡخَبِیۡثَ بِالطَّیِّبِ ۪ وَ لَا تَاۡکُلُوۡۤا اَمۡوَالَہُمۡ  اِلٰۤی اَمۡوَالِکُمۡ ؕ اِنَّہٗ کَانَ حُوۡبًا کَبِیۡرًا ﴿۲﴾",
                    "وَ اِنۡ خِفۡتُمۡ اَلَّا تُقۡسِطُوۡا فِی الۡیَتٰمٰی فَانۡکِحُوۡا مَا طَابَ لَکُمۡ مِّنَ النِّسَآءِ مَثۡنٰی وَ ثُلٰثَ وَ رُبٰعَ ۚ فَاِنۡ خِفۡتُمۡ اَلَّا تَعۡدِلُوۡا فَوَاحِدَۃً اَوۡ مَا مَلَکَتۡ اَیۡمَانُکُمۡ ؕ ذٰلِکَ اَدۡنٰۤی اَلَّا تَعُوۡلُوۡا ؕ﴿۳﴾",
                    "وَ اٰتُوا النِّسَآءَ صَدُقٰتِہِنَّ نِحۡلَۃً ؕ فَاِنۡ طِبۡنَ لَکُمۡ عَنۡ شَیۡءٍ مِّنۡہُ نَفۡسًا فَکُلُوۡہُ ہَنِیۡٓــًٔا مَّرِیۡٓــًٔا ﴿۴﴾",
                    "وَ لَا تُؤۡتُوا السُّفَہَآءَ اَمۡوَالَکُمُ الَّتِیۡ جَعَلَ اللّٰہُ لَکُمۡ قِیٰمًا وَّ ارۡزُقُوۡہُمۡ فِیۡہَا وَ اکۡسُوۡہُمۡ وَ قُوۡلُوۡا لَہُمۡ قَوۡلًا مَّعۡرُوۡفًا ﴿۵﴾",
                    "وَ ابۡتَلُوا الۡیَتٰمٰی حَتّٰۤی  اِذَا بَلَغُوا النِّکَاحَ ۚ فَاِنۡ اٰنَسۡتُمۡ مِّنۡہُمۡ رُشۡدًا فَادۡفَعُوۡۤا اِلَیۡہِمۡ اَمۡوَالَہُمۡ ۚ وَ لَا تَاۡکُلُوۡہَاۤ اِسۡرَافًا وَّ بِدَارًا اَنۡ یَّکۡبَرُوۡا ؕ وَ مَنۡ کَانَ غَنِیًّا فَلۡیَسۡتَعۡفِفۡ ۚ وَ مَنۡ کَانَ فَقِیۡرًا فَلۡیَاۡکُلۡ بِالۡمَعۡرُوۡفِ ؕ فَاِذَا دَفَعۡتُمۡ  اِلَیۡہِمۡ اَمۡوَالَہُمۡ فَاَشۡہِدُوۡا عَلَیۡہِمۡ ؕ وَ کَفٰی بِاللّٰہِ حَسِیۡبًا ﴿۶﴾",
                    "لِلرِّجَالِ نَصِیۡبٌ مِّمَّا تَرَکَ الۡوَالِدٰنِ وَ الۡاَقۡرَبُوۡنَ ۪ وَ لِلنِّسَآءِ نَصِیۡبٌ مِّمَّا تَرَکَ الۡوَالِدٰنِ وَ الۡاَقۡرَبُوۡنَ مِمَّا قَلَّ مِنۡہُ اَوۡ کَثُرَ ؕ نَصِیۡبًا مَّفۡرُوۡضًا ﴿۷﴾",
                    "وَ  اِذَا حَضَرَ الۡقِسۡمَۃَ  اُولُوا الۡقُرۡبٰی وَ الۡیَتٰمٰی وَ الۡمَسٰکِیۡنُ فَارۡزُقُوۡہُمۡ  مِّنۡہُ وَ قُوۡلُوۡا لَہُمۡ  قَوۡلًا مَّعۡرُوۡفًا ﴿۸﴾",
                    "وَ لۡیَخۡشَ الَّذِیۡنَ لَوۡ تَرَکُوۡا مِنۡ خَلۡفِہِمۡ ذُرِّیَّۃً ضِعٰفًا خَافُوۡا عَلَیۡہِمۡ ۪ فَلۡیَتَّقُوا اللّٰہَ وَ لۡیَقُوۡلُوۡا قَوۡلًا سَدِیۡدًا ﴿۹﴾",
                    "اِنَّ الَّذِیۡنَ یَاۡکُلُوۡنَ اَمۡوَالَ الۡیَتٰمٰی ظُلۡمًا اِنَّمَا یَاۡکُلُوۡنَ فِیۡ بُطُوۡنِہِمۡ نَارًا ؕ وَ سَیَصۡلَوۡنَ  سَعِیۡرًا ﴿٪۱۰﴾",
                    "یُوۡصِیۡکُمُ اللّٰہُ فِیۡۤ  اَوۡلَادِکُمۡ ٭ لِلذَّکَرِ مِثۡلُ حَظِّ الۡاُنۡثَیَیۡنِ ۚ فَاِنۡ کُنَّ نِسَآءً فَوۡقَ اثۡنَتَیۡنِ فَلَہُنَّ ثُلُثَا مَا تَرَکَ ۚ وَ اِنۡ کَانَتۡ وَاحِدَۃً  فَلَہَا النِّصۡفُ ؕ وَ لِاَبَوَیۡہِ لِکُلِّ وَاحِدٍ مِّنۡہُمَا السُّدُسُ مِمَّا تَرَکَ اِنۡ کَانَ لَہٗ  وَلَدٌ ۚ فَاِنۡ لَّمۡ  یَکُنۡ لَّہٗ وَلَدٌ وَّ وَرِثَہٗۤ اَبَوٰہُ فَلِاُمِّہِ الثُّلُثُ ۚ فَاِنۡ کَانَ لَہٗۤ  اِخۡوَۃٌ فَلِاُمِّہِ السُّدُسُ مِنۡۢ بَعۡدِ وَصِیَّۃٍ یُّوۡصِیۡ بِہَاۤ اَوۡ دَیۡنٍ ؕ اٰبَآؤُکُمۡ وَ اَبۡنَآؤُکُمۡ لَا تَدۡرُوۡنَ اَیُّہُمۡ اَقۡرَبُ  لَکُمۡ نَفۡعًا ؕ فَرِیۡضَۃً مِّنَ  اللّٰہِ ؕ اِنَّ اللّٰہَ کَانَ عَلِیۡمًا حَکِیۡمًا ﴿۱۱﴾",
                    "وَ لَکُمۡ نِصۡفُ مَا تَرَکَ اَزۡوَاجُکُمۡ   اِنۡ لَّمۡ یَکُنۡ لَّہُنَّ وَلَدٌ ۚ فَاِنۡ کَانَ لَہُنَّ وَلَدٌ فَلَکُمُ الرُّبُعُ  مِمَّا تَرَکۡنَ مِنۡۢ بَعۡدِ وَصِیَّۃٍ یُّوۡصِیۡنَ بِہَاۤ اَوۡ دَیۡنٍ ؕ وَ لَہُنَّ الرُّبُعُ مِمَّا تَرَکۡتُمۡ  اِنۡ لَّمۡ یَکُنۡ لَّکُمۡ وَلَدٌ ۚ فَاِنۡ کَانَ لَکُمۡ وَلَدٌ فَلَہُنَّ الثُّمُنُ مِمَّا تَرَکۡتُمۡ مِّنۡۢ بَعۡدِ وَصِیَّۃٍ تُوۡصُوۡنَ بِہَاۤ  اَوۡ دَیۡنٍ ؕ وَ  اِنۡ کَانَ رَجُلٌ یُّوۡرَثُ  کَلٰلَۃً اَوِ امۡرَاَۃٌ  وَّ لَہٗۤ  اَخٌ  اَوۡ اُخۡتٌ فَلِکُلِّ وَاحِدٍ مِّنۡہُمَا السُّدُسُ ۚ فَاِنۡ  کَانُوۡۤا  اَکۡثَرَ مِنۡ ذٰلِکَ فَہُمۡ شُرَکَآءُ فِی الثُّلُثِ مِنۡۢ بَعۡدِ وَصِیَّۃٍ یُّوۡصٰی بِہَاۤ اَوۡ دَیۡنٍ ۙ غَیۡرَ مُضَآرٍّ ۚ وَصِیَّۃً  مِّنَ اللّٰہِ ؕ وَ اللّٰہُ  عَلِیۡمٌ حَلِیۡمٌ ﴿ؕ۱۲﴾",
                    "تِلۡکَ حُدُوۡدُ اللّٰہِ ؕ وَ مَنۡ یُّطِعِ اللّٰہَ وَ رَسُوۡلَہٗ یُدۡخِلۡہُ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ خٰلِدِیۡنَ فِیۡہَا ؕ وَ ذٰلِکَ الۡفَوۡزُ  الۡعَظِیۡمُ ﴿۱۳﴾",
                    "وَ مَنۡ یَّعۡصِ اللّٰہَ  وَ رَسُوۡلَہٗ وَ یَتَعَدَّ حُدُوۡدَہٗ یُدۡخِلۡہُ نَارًا خَالِدًا فِیۡہَا ۪ وَ لَہٗ عَذَابٌ مُّہِیۡنٌ ﴿٪۱۴﴾",
                    "وَ الّٰتِیۡ یَاۡتِیۡنَ الۡفَاحِشَۃَ مِنۡ نِّسَآئِکُمۡ فَاسۡتَشۡہِدُوۡا عَلَیۡہِنَّ اَرۡبَعَۃً مِّنۡکُمۡ ۚ فَاِنۡ شَہِدُوۡا فَاَمۡسِکُوۡ ہُنَّ فِی الۡبُیُوۡتِ حَتّٰی یَتَوَفّٰہُنَّ الۡمَوۡتُ اَوۡ یَجۡعَلَ اللّٰہُ  لَہُنَّ  سَبِیۡلًا ﴿۱۵﴾",
                    "وَ الَّذٰنِ یَاۡتِیٰنِہَا مِنۡکُمۡ  فَاٰذُوۡہُمَا ۚ فَاِنۡ تَابَا وَ اَصۡلَحَا فَاَعۡرِضُوۡا عَنۡہُمَا ؕ اِنَّ اللّٰہَ کَانَ تَوَّابًا رَّحِیۡمًا ﴿۱۶﴾",
                    "اِنَّمَا التَّوۡبَۃُ عَلَی اللّٰہِ لِلَّذِیۡنَ یَعۡمَلُوۡنَ السُّوۡٓءَ بِجَہَالَۃٍ ثُمَّ  یَتُوۡبُوۡنَ مِنۡ قَرِیۡبٍ فَاُولٰٓئِکَ یَتُوۡبُ اللّٰہُ عَلَیۡہِمۡ ؕ وَ کَانَ اللّٰہُ  عَلِیۡمًا  حَکِیۡمًا ﴿۱۷﴾",
                    "وَ لَیۡسَتِ التَّوۡبَۃُ لِلَّذِیۡنَ یَعۡمَلُوۡنَ السَّیِّاٰتِ ۚ حَتّٰۤی  اِذَا حَضَرَ اَحَدَہُمُ الۡمَوۡتُ قَالَ  اِنِّیۡ تُبۡتُ الۡـٰٔنَ  وَ لَا الَّذِیۡنَ یَمُوۡتُوۡنَ وَ ہُمۡ کُفَّارٌ ؕ اُولٰٓئِکَ اَعۡتَدۡنَا لَہُمۡ عَذَابًا  اَلِیۡمًا ﴿۱۸﴾",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا یَحِلُّ لَکُمۡ اَنۡ تَرِثُوا النِّسَآءَ کَرۡہًا ؕ وَ لَا تَعۡضُلُوۡہُنَّ لِتَذۡہَبُوۡا بِبَعۡضِ مَاۤ اٰتَیۡتُمُوۡہُنَّ  اِلَّاۤ اَنۡ یَّاۡتِیۡنَ بِفَاحِشَۃٍ مُّبَیِّنَۃٍ ۚ وَ عَاشِرُوۡہُنَّ بِالۡمَعۡرُوۡفِ ۚ فَاِنۡ کَرِہۡتُمُوۡہُنَّ فَعَسٰۤی اَنۡ تَکۡرَہُوۡا شَیۡئًا وَّ یَجۡعَلَ اللّٰہُ فِیۡہِ خَیۡرًا کَثِیۡرًا ﴿۱۹﴾",
                    "وَ اِنۡ اَرَدۡتُّمُ اسۡتِبۡدَالَ زَوۡجٍ مَّکَانَ زَوۡجٍ ۙ وَّ اٰتَیۡتُمۡ  اِحۡدٰہُنَّ قِنۡطَارًا فَلَا تَاۡخُذُوۡا مِنۡہُ شَیۡئًا ؕ اَتَاۡخُذُوۡنَہٗ بُہۡتَانًا وَّ  اِثۡمًا مُّبِیۡنًا ﴿۲۰﴾",
                    "وَ کَیۡفَ تَاۡخُذُوۡنَہٗ وَ قَدۡ  اَفۡضٰی بَعۡضُکُمۡ  اِلٰی بَعۡضٍ وَّ اَخَذۡنَ مِنۡکُمۡ مِّیۡثَاقًا غَلِیۡظًا ﴿۲۱﴾",
                    "وَ لَا تَنۡکِحُوۡا مَا نَکَحَ اٰبَآؤُکُمۡ مِّنَ النِّسَآءِ  اِلَّا مَا قَدۡ سَلَفَ ؕ اِنَّہٗ کَانَ فَاحِشَۃً وَّ مَقۡتًا ؕ وَ سَآءَ  سَبِیۡلًا ﴿٪۲۲﴾",
                    "حُرِّمَتۡ عَلَیۡکُمۡ اُمَّہٰتُکُمۡ وَ بَنٰتُکُمۡ وَ اَخَوٰتُکُمۡ وَ عَمّٰتُکُمۡ وَ خٰلٰتُکُمۡ وَ بَنٰتُ الۡاَخِ وَ بَنٰتُ الۡاُخۡتِ وَ اُمَّہٰتُکُمُ الّٰتِیۡۤ  اَرۡضَعۡنَکُمۡ وَ اَخَوٰتُکُمۡ مِّنَ الرَّضَاعَۃِ  وَ اُمَّہٰتُ نِسَآئِکُمۡ  وَ رَبَآئِبُکُمُ الّٰتِیۡ فِیۡ  حُجُوۡرِکُمۡ مِّنۡ نِّسَآئِکُمُ الّٰتِیۡ دَخَلۡتُمۡ بِہِنَّ ۫ فَاِنۡ  لَّمۡ تَکُوۡنُوۡا دَخَلۡتُمۡ بِہِنَّ فَلَا جُنَاحَ عَلَیۡکُمۡ ۫ وَ حَلَآئِلُ اَبۡنَآئِکُمُ الَّذِیۡنَ مِنۡ اَصۡلَابِکُمۡ ۙ  وَ اَنۡ تَجۡمَعُوۡا بَیۡنَ الۡاُخۡتَیۡنِ اِلَّا مَا قَدۡ سَلَفَ ؕ اِنَّ اللّٰہَ کَانَ  غَفُوۡرًا  رَّحِیۡمًا ﴿ۙ۲۳﴾",
                    "وَّ الۡمُحۡصَنٰتُ مِنَ النِّسَآءِ  اِلَّا مَا مَلَکَتۡ اَیۡمَانُکُمۡ ۚ کِتٰبَ اللّٰہِ عَلَیۡکُمۡ ۚ وَ اُحِلَّ لَکُمۡ مَّا وَرَآءَ ذٰلِکُمۡ اَنۡ تَبۡتَغُوۡا بِاَمۡوَالِکُمۡ مُّحۡصِنِیۡنَ غَیۡرَ مُسٰفِحِیۡنَ ؕ فَمَا اسۡتَمۡتَعۡتُمۡ بِہٖ مِنۡہُنَّ فَاٰتُوۡہُنَّ اُجُوۡرَہُنَّ فَرِیۡضَۃً ؕ وَ لَا جُنَاحَ عَلَیۡکُمۡ فِیۡمَا تَرٰضَیۡتُمۡ بِہٖ مِنۡۢ بَعۡدِ الۡفَرِیۡضَۃِ ؕ اِنَّ اللّٰہَ کَانَ عَلِیۡمًا حَکِیۡمًا ﴿۲۴﴾",
                    "وَ مَنۡ لَّمۡ یَسۡتَطِعۡ مِنۡکُمۡ طَوۡلًا اَنۡ یَّنۡکِحَ الۡمُحۡصَنٰتِ الۡمُؤۡمِنٰتِ فَمِنۡ مَّا مَلَکَتۡ اَیۡمَانُکُمۡ مِّنۡ فَتَیٰتِکُمُ الۡمُؤۡمِنٰتِ ؕ وَ اللّٰہُ اَعۡلَمُ  بِاِیۡمَانِکُمۡ ؕ بَعۡضُکُمۡ مِّنۡۢ بَعۡضٍ ۚ فَانۡکِحُوۡہُنَّ بِاِذۡنِ اَہۡلِہِنَّ وَ اٰتُوۡہُنَّ اُجُوۡرَہُنَّ بِالۡمَعۡرُوۡفِ مُحۡصَنٰتٍ غَیۡرَ مُسٰفِحٰتٍ وَّ لَا مُتَّخِذٰتِ اَخۡدَانٍ ۚ فَاِذَاۤ   اُحۡصِنَّ فَاِنۡ اَتَیۡنَ بِفَاحِشَۃٍ فَعَلَیۡہِنَّ نِصۡفُ مَا عَلَی الۡمُحۡصَنٰتِ مِنَ الۡعَذَابِ ؕ ذٰلِکَ لِمَنۡ خَشِیَ الۡعَنَتَ مِنۡکُمۡ ؕ وَ اَنۡ تَصۡبِرُوۡا خَیۡرٌ  لَّکُمۡ ؕ وَ اللّٰہُ  غَفُوۡرٌ رَّحِیۡمٌ ﴿٪۲۵﴾",
                    "یُرِیۡدُ اللّٰہُ لِیُبَیِّنَ لَکُمۡ وَ یَہۡدِیَکُمۡ سُنَنَ الَّذِیۡنَ مِنۡ قَبۡلِکُمۡ وَ یَتُوۡبَ عَلَیۡکُمۡ ؕ وَ اللّٰہُ  عَلِیۡمٌ  حَکِیۡمٌ ﴿۲۶﴾",
                    "وَ اللّٰہُ یُرِیۡدُ اَنۡ یَّتُوۡبَ عَلَیۡکُمۡ ۟ وَ یُرِیۡدُ الَّذِیۡنَ یَتَّبِعُوۡنَ الشَّہَوٰتِ اَنۡ تَمِیۡلُوۡا مَیۡلًا عَظِیۡمًا ﴿۲۷﴾",
                    "یُرِیۡدُ اللّٰہُ اَنۡ یُّخَفِّفَ عَنۡکُمۡ ۚ وَ خُلِقَ الۡاِنۡسَانُ ضَعِیۡفًا ﴿۲۸﴾",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تَاۡکُلُوۡۤا اَمۡوَالَکُمۡ بَیۡنَکُمۡ بِالۡبَاطِلِ اِلَّاۤ اَنۡ تَکُوۡنَ تِجَارَۃً عَنۡ تَرَاضٍ مِّنۡکُمۡ ۟ وَ لَا تَقۡتُلُوۡۤا اَنۡفُسَکُمۡ ؕ اِنَّ اللّٰہَ کَانَ بِکُمۡ رَحِیۡمًا ﴿۲۹﴾",
                    "وَ مَنۡ یَّفۡعَلۡ ذٰلِکَ عُدۡوَانًا وَّ ظُلۡمًا فَسَوۡفَ نُصۡلِیۡہِ نَارًا ؕ وَ کَانَ ذٰلِکَ عَلَی اللّٰہِ  یَسِیۡرًا ﴿۳۰﴾",
                    "اِنۡ تَجۡتَنِبُوۡا کَبَآئِرَ مَا تُنۡہَوۡنَ عَنۡہُ نُکَفِّرۡ عَنۡکُمۡ سَیِّاٰتِکُمۡ وَ نُدۡخِلۡکُمۡ  مُّدۡخَلًا کَرِیۡمًا ﴿۳۱﴾",
                    "وَ لَا تَتَمَنَّوۡا مَا فَضَّلَ اللّٰہُ بِہٖ بَعۡضَکُمۡ عَلٰی بَعۡضٍ ؕ لِلرِّجَالِ نَصِیۡبٌ مِّمَّا اکۡتَسَبُوۡا ؕ وَ لِلنِّسَآءِ نَصِیۡبٌ مِّمَّا اکۡتَسَبۡنَ ؕ وَ سۡئَلُوا اللّٰہَ مِنۡ فَضۡلِہٖ ؕ اِنَّ اللّٰہَ کَانَ بِکُلِّ شَیۡءٍ عَلِیۡمًا ﴿۳۲﴾",
                    "وَ لِکُلٍّ جَعَلۡنَا مَوَالِیَ  مِمَّا تَرَکَ الۡوَالِدٰنِ وَ الۡاَقۡرَبُوۡنَ ؕ وَ الَّذِیۡنَ عَقَدَتۡ اَیۡمَانُکُمۡ فَاٰتُوۡہُمۡ نَصِیۡبَہُمۡ ؕ اِنَّ اللّٰہَ کَانَ عَلٰی کُلِّ شَیۡءٍ  شَہِیۡدًا ﴿٪۳۳﴾",
                    "اَلرِّجَالُ قَوّٰمُوۡنَ عَلَی النِّسَآءِ بِمَا فَضَّلَ اللّٰہُ بَعۡضَہُمۡ عَلٰی بَعۡضٍ وَّ بِمَاۤ اَنۡفَقُوۡا مِنۡ اَمۡوَالِہِمۡ ؕ فَالصّٰلِحٰتُ قٰنِتٰتٌ حٰفِظٰتٌ لِّلۡغَیۡبِ بِمَا حَفِظَ اللّٰہُ ؕ وَ الّٰتِیۡ تَخَافُوۡنَ نُشُوۡزَہُنَّ فَعِظُوۡہُنَّ وَ اہۡجُرُوۡہُنَّ فِی الۡمَضَاجِعِ وَ اضۡرِبُوۡہُنَّ ۚ فَاِنۡ اَطَعۡنَکُمۡ فَلَا تَبۡغُوۡا عَلَیۡہِنَّ سَبِیۡلًا ؕ اِنَّ اللّٰہَ کَانَ عَلِیًّا کَبِیۡرًا ﴿۳۴﴾",
                    "وَ اِنۡ خِفۡتُمۡ شِقَاقَ بَیۡنِہِمَا فَابۡعَثُوۡا حَکَمًا مِّنۡ اَہۡلِہٖ وَ حَکَمًا مِّنۡ اَہۡلِہَا ۚ اِنۡ یُّرِیۡدَاۤ  اِصۡلَاحًا یُّوَفِّقِ اللّٰہُ بَیۡنَہُمَا ؕ اِنَّ اللّٰہَ کَانَ عَلِیۡمًا خَبِیۡرًا ﴿۳۵﴾",
                    "وَ اعۡبُدُوا  اللّٰہَ وَ لَا تُشۡرِکُوۡا بِہٖ شَیۡئًا وَّ بِالۡوَالِدَیۡنِ  اِحۡسَانًا وَّ بِذِی الۡقُرۡبٰی وَ الۡیَتٰمٰی وَ الۡمَسٰکِیۡنِ وَ الۡجَارِ ذِی الۡقُرۡبٰی وَ الۡجَارِ الۡجُنُبِ وَ الصَّاحِبِ بِالۡجَنۡۢبِ وَ ابۡنِ السَّبِیۡلِ ۙ وَ مَا مَلَکَتۡ اَیۡمَانُکُمۡ ؕ اِنَّ اللّٰہَ لَا یُحِبُّ مَنۡ  کَانَ  مُخۡتَالًا  فَخُوۡرَا ﴿ۙ۳۶﴾",
                    "ۣالَّذِیۡنَ یَبۡخَلُوۡنَ وَ یَاۡمُرُوۡنَ النَّاسَ بِالۡبُخۡلِ وَ یَکۡتُمُوۡنَ مَاۤ اٰتٰہُمُ اللّٰہُ مِنۡ فَضۡلِہٖ ؕ وَ اَعۡتَدۡنَا لِلۡکٰفِرِیۡنَ  عَذَابًا مُّہِیۡنًا ﴿ۚ۳۷﴾",
                    "وَ الَّذِیۡنَ یُنۡفِقُوۡنَ اَمۡوَالَہُمۡ رِئَآءَ النَّاسِ وَ لَا یُؤۡمِنُوۡنَ بِاللّٰہِ وَ لَا بِالۡیَوۡمِ الۡاٰخِرِ ؕ وَ مَنۡ  یَّکُنِ  الشَّیۡطٰنُ  لَہٗ  قَرِیۡنًا فَسَآءَ  قَرِیۡنًا ﴿۳۸﴾",
                    "وَ مَاذَا عَلَیۡہِمۡ لَوۡ اٰمَنُوۡا بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ وَ اَنۡفَقُوۡا مِمَّا رَزَقَہُمُ اللّٰہُ ؕ وَ کَانَ اللّٰہُ  بِہِمۡ  عَلِیۡمًا ﴿۳۹﴾",
                    "اِنَّ اللّٰہَ لَا یَظۡلِمُ مِثۡقَالَ ذَرَّۃٍ ۚ وَ اِنۡ تَکُ حَسَنَۃً  یُّضٰعِفۡہَا وَ یُؤۡتِ مِنۡ لَّدُنۡہُ  اَجۡرًا عَظِیۡمًا ﴿۴۰﴾",
                    "فَکَیۡفَ اِذَا جِئۡنَا مِنۡ کُلِّ اُمَّۃٍۭ بِشَہِیۡدٍ وَّ جِئۡنَا بِکَ عَلٰی ہٰۤؤُلَآءِ شَہِیۡدًا ﴿ؕ؃۴۱﴾",
                    "یَوۡمَئِذٍ یَّوَدُّ الَّذِیۡنَ کَفَرُوۡا وَ عَصَوُا الرَّسُوۡلَ لَوۡ تُسَوّٰی بِہِمُ الۡاَرۡضُ ؕ وَ لَا یَکۡتُمُوۡنَ اللّٰہَ  حَدِیۡثًا ﴿٪۴۲﴾",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تَقۡرَبُوا الصَّلٰوۃَ وَ اَنۡتُمۡ سُکٰرٰی حَتّٰی تَعۡلَمُوۡا مَا تَقُوۡلُوۡنَ وَ لَا جُنُبًا اِلَّا عَابِرِیۡ سَبِیۡلٍ حَتّٰی تَغۡتَسِلُوۡا ؕ وَ اِنۡ کُنۡتُمۡ مَّرۡضٰۤی اَوۡ عَلٰی سَفَرٍ اَوۡ جَآءَ اَحَدٌ مِّنۡکُمۡ مِّنَ الۡغَآئِطِ اَوۡ لٰمَسۡتُمُ النِّسَآءَ فَلَمۡ تَجِدُوۡا مَآءً فَتَیَمَّمُوۡا صَعِیۡدًا طَیِّبًا فَامۡسَحُوۡا بِوُجُوۡہِکُمۡ وَ اَیۡدِیۡکُمۡ ؕ اِنَّ اللّٰہَ  کَانَ عَفُوًّا غَفُوۡرًا ﴿۴۳﴾",
                    "اَلَمۡ تَرَ اِلَی الَّذِیۡنَ اُوۡتُوۡا نَصِیۡبًا مِّنَ الۡکِتٰبِ یَشۡتَرُوۡنَ الضَّلٰلَۃَ وَ یُرِیۡدُوۡنَ اَنۡ تَضِلُّوا السَّبِیۡلَ ﴿ؕ۴۴﴾",
                    "وَ اللّٰہُ اَعۡلَمُ بِاَعۡدَآئِکُمۡ ؕ وَ کَفٰی بِاللّٰہِ وَلِیًّا ٭۫  وَّ کَفٰی  بِاللّٰہِ نَصِیۡرًا ﴿۴۵﴾",
                    "مِنَ الَّذِیۡنَ ہَادُوۡا یُحَرِّفُوۡنَ الۡکَلِمَ  عَنۡ مَّوَاضِعِہٖ وَ یَقُوۡلُوۡنَ سَمِعۡنَا وَ عَصَیۡنَا وَ اسۡمَعۡ غَیۡرَ مُسۡمَعٍ وَّ رَاعِنَا لَـیًّۢا بِاَلۡسِنَتِہِمۡ وَ طَعۡنًا فِی الدِّیۡنِ ؕ وَ لَوۡ اَنَّہُمۡ قَالُوۡا سَمِعۡنَا وَ اَطَعۡنَا وَ اسۡمَعۡ وَ انۡظُرۡنَا لَکَانَ خَیۡرًا لَّہُمۡ وَ اَقۡوَمَ ۙ وَ لٰکِنۡ لَّعَنَہُمُ اللّٰہُ بِکُفۡرِہِمۡ  فَلَا  یُؤۡمِنُوۡنَ  اِلَّا  قَلِیۡلًا ﴿۴۶﴾",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اُوۡتُوا الۡکِتٰبَ اٰمِنُوۡا بِمَا نَزَّلۡنَا مُصَدِّقًا لِّمَا مَعَکُمۡ مِّنۡ قَبۡلِ اَنۡ نَّطۡمِسَ وُجُوۡہًا فَنَرُدَّہَا عَلٰۤی اَدۡبَارِہَاۤ اَوۡ نَلۡعَنَہُمۡ کَمَا لَعَنَّاۤ اَصۡحٰبَ السَّبۡتِ ؕ وَ کَانَ اَمۡرُ اللّٰہِ مَفۡعُوۡلًا ﴿۴۷﴾",
                    "اِنَّ اللّٰہَ لَا یَغۡفِرُ اَنۡ یُّشۡرَکَ بِہٖ وَ یَغۡفِرُ  مَا دُوۡنَ ذٰلِکَ لِمَنۡ یَّشَآءُ ۚ وَ مَنۡ یُّشۡرِکۡ بِاللّٰہِ فَقَدِ افۡتَرٰۤی  اِثۡمًا عَظِیۡمًا ﴿۴۸﴾",
                    "اَلَمۡ تَرَ  اِلَی الَّذِیۡنَ یُزَکُّوۡنَ اَنۡفُسَہُمۡ ؕ بَلِ اللّٰہُ یُزَکِّیۡ مَنۡ یَّشَآءُ وَ لَا یُظۡلَمُوۡنَ فَتِیۡلًا ﴿۴۹﴾",
                    "اُنۡظُرۡ کَیۡفَ یَفۡتَرُوۡنَ عَلَی اللّٰہِ الۡکَذِبَ ؕ وَ کَفٰی بِہٖۤ   اِثۡمًا مُّبِیۡنًا ﴿٪۵۰﴾",
                    "اَلَمۡ تَرَ اِلَی الَّذِیۡنَ اُوۡتُوۡا نَصِیۡبًا مِّنَ الۡکِتٰبِ یُؤۡمِنُوۡنَ بِالۡجِبۡتِ وَ الطَّاغُوۡتِ وَ یَقُوۡلُوۡنَ لِلَّذِیۡنَ کَفَرُوۡا ہٰۤؤُلَآءِ اَہۡدٰی مِنَ الَّذِیۡنَ اٰمَنُوۡا سَبِیۡلًا ﴿۵۱﴾",
                    "اُولٰٓئِکَ الَّذِیۡنَ لَعَنَہُمُ اللّٰہُ ؕ وَ مَنۡ یَّلۡعَنِ اللّٰہُ  فَلَنۡ تَجِدَ  لَہٗ  نَصِیۡرًا ﴿ؕ۵۲﴾",
                    "اَمۡ لَہُمۡ نَصِیۡبٌ مِّنَ الۡمُلۡکِ فَاِذًا لَّا یُؤۡتُوۡنَ النَّاسَ نَقِیۡرًا ﴿ۙ۵۳﴾",
                    "اَمۡ یَحۡسُدُوۡنَ النَّاسَ عَلٰی مَاۤ اٰتٰہُمُ اللّٰہُ مِنۡ فَضۡلِہٖ ۚ فَقَدۡ اٰتَیۡنَاۤ اٰلَ  اِبۡرٰہِیۡمَ الۡکِتٰبَ وَ الۡحِکۡمَۃَ وَ اٰتَیۡنٰہُمۡ مُّلۡکًا عَظِیۡمًا ﴿۵۴﴾",
                    "فَمِنۡہُمۡ مَّنۡ اٰمَنَ بِہٖ وَ مِنۡہُمۡ مَّنۡ صَدَّ عَنۡہُ ؕ وَ کَفٰی  بِجَہَنَّمَ  سَعِیۡرًا ﴿۵۵﴾",
                    "اِنَّ الَّذِیۡنَ کَفَرُوۡا بِاٰیٰتِنَا سَوۡفَ نُصۡلِیۡہِمۡ نَارًا ؕ کُلَّمَا نَضِجَتۡ جُلُوۡدُہُمۡ بَدَّلۡنٰہُمۡ جُلُوۡدًا غَیۡرَہَا لِیَذُوۡقُوا الۡعَذَابَ ؕ اِنَّ اللّٰہَ کَانَ عَزِیۡزًا حَکِیۡمًا ﴿۵۶﴾",
                    "وَ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ سَنُدۡخِلُہُمۡ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ خٰلِدِیۡنَ فِیۡہَاۤ  اَبَدًا ؕ لَہُمۡ  فِیۡہَاۤ اَزۡوَاجٌ مُّطَہَّرَۃٌ ۫ وَّ نُدۡخِلُہُمۡ ظِلًّا ظَلِیۡلًا ﴿۵۷﴾",
                    "اِنَّ اللّٰہَ یَاۡمُرُکُمۡ اَنۡ تُؤَدُّوا الۡاَمٰنٰتِ اِلٰۤی اَہۡلِہَا ۙ وَ اِذَا حَکَمۡتُمۡ بَیۡنَ النَّاسِ اَنۡ تَحۡکُمُوۡا بِالۡعَدۡلِ ؕ اِنَّ اللّٰہَ نِعِمَّا یَعِظُکُمۡ بِہٖ ؕ اِنَّ اللّٰہَ کَانَ سَمِیۡعًۢا بَصِیۡرًا ﴿۵۸﴾",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اَطِیۡعُوا اللّٰہَ وَ اَطِیۡعُوا الرَّسُوۡلَ وَ اُولِی الۡاَمۡرِ مِنۡکُمۡ ۚ فَاِنۡ تَنَازَعۡتُمۡ فِیۡ شَیۡءٍ فَرُدُّوۡہُ اِلَی اللّٰہِ وَ الرَّسُوۡلِ  اِنۡ کُنۡتُمۡ تُؤۡمِنُوۡنَ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ ؕ ذٰلِکَ خَیۡرٌ  وَّ  اَحۡسَنُ  تَاۡوِیۡلًا ﴿٪۵۹﴾",
                    "اَلَمۡ تَرَ  اِلَی الَّذِیۡنَ یَزۡعُمُوۡنَ اَنَّہُمۡ اٰمَنُوۡا بِمَاۤ  اُنۡزِلَ اِلَیۡکَ وَ مَاۤ  اُنۡزِلَ مِنۡ قَبۡلِکَ یُرِیۡدُوۡنَ اَنۡ یَّتَحَاکَمُوۡۤا اِلَی الطَّاغُوۡتِ وَ قَدۡ اُمِرُوۡۤا اَنۡ یَّکۡفُرُوۡا بِہٖ ؕ وَ یُرِیۡدُ الشَّیۡطٰنُ اَنۡ یُّضِلَّہُمۡ ضَلٰلًۢا بَعِیۡدًا ﴿۶۰﴾",
                    "وَ  اِذَا قِیۡلَ لَہُمۡ تَعَالَوۡا اِلٰی مَاۤ  اَنۡزَلَ اللّٰہُ وَ اِلَی الرَّسُوۡلِ رَاَیۡتَ الۡمُنٰفِقِیۡنَ یَصُدُّوۡنَ عَنۡکَ  صُدُوۡدًا ﴿ۚ۶۱﴾",
                    "فَکَیۡفَ اِذَاۤ  اَصَابَتۡہُمۡ مُّصِیۡبَۃٌۢ بِمَا قَدَّمَتۡ اَیۡدِیۡہِمۡ ثُمَّ جَآءُوۡکَ یَحۡلِفُوۡنَ ٭ۖ بِاللّٰہِ  اِنۡ اَرَدۡنَاۤ اِلَّاۤ اِحۡسَانًا وَّ تَوۡفِیۡقًا ﴿۶۲﴾",
                    "اُولٰٓئِکَ الَّذِیۡنَ یَعۡلَمُ اللّٰہُ مَا فِیۡ قُلُوۡبِہِمۡ ٭ فَاَعۡرِضۡ عَنۡہُمۡ وَ عِظۡہُمۡ وَ قُلۡ لَّہُمۡ  فِیۡۤ  اَنۡفُسِہِمۡ  قَوۡلًۢا  بَلِیۡغًا ﴿۶۳﴾",
                    "وَ مَاۤ اَرۡسَلۡنَا مِنۡ رَّسُوۡلٍ اِلَّا لِیُطَاعَ بِاِذۡنِ اللّٰہِ ؕ وَ لَوۡ اَنَّہُمۡ اِذۡ ظَّلَمُوۡۤا اَنۡفُسَہُمۡ جَآءُوۡکَ فَاسۡتَغۡفَرُوا اللّٰہَ وَ اسۡتَغۡفَرَ لَہُمُ الرَّسُوۡلُ لَوَجَدُوا اللّٰہَ تَوَّابًا  رَّحِیۡمًا ﴿۶۴﴾",
                    "فَلَا وَ رَبِّکَ لَا یُؤۡمِنُوۡنَ حَتّٰی  یُحَکِّمُوۡکَ فِیۡمَا شَجَرَ  بَیۡنَہُمۡ ثُمَّ  لَا  یَجِدُوۡا فِیۡۤ  اَنۡفُسِہِمۡ حَرَجًا  مِّمَّا قَضَیۡتَ  وَ یُسَلِّمُوۡا  تَسۡلِیۡمًا ﴿۶۵﴾",
                    "وَ لَوۡ اَنَّا کَتَبۡنَا عَلَیۡہِمۡ اَنِ اقۡتُلُوۡۤا اَنۡفُسَکُمۡ اَوِ اخۡرُجُوۡا مِنۡ دِیَارِکُمۡ مَّا فَعَلُوۡہُ  اِلَّا قَلِیۡلٌ مِّنۡہُمۡ ؕ وَ لَوۡ اَنَّہُمۡ فَعَلُوۡا مَا یُوۡعَظُوۡنَ بِہٖ لَکَانَ خَیۡرًا لَّہُمۡ  وَ اَشَدَّ  تَثۡبِیۡتًا ﴿ۙ۶۶﴾",
                    "وَّ اِذًا لَّاٰتَیۡنٰہُمۡ مِّنۡ لَّدُنَّـاۤ اَجۡرًا عَظِیۡمًا ﴿ۙ۶۷﴾",
                    "وَّ لَہَدَیۡنٰہُمۡ صِرَاطًا مُّسۡتَقِیۡمًا ﴿۶۸﴾",
                    "وَ مَنۡ یُّطِعِ اللّٰہَ وَ الرَّسُوۡلَ فَاُولٰٓئِکَ مَعَ الَّذِیۡنَ اَنۡعَمَ اللّٰہُ عَلَیۡہِمۡ مِّنَ النَّبِیّٖنَ وَ الصِّدِّیۡقِیۡنَ وَ الشُّہَدَآءِ وَ الصّٰلِحِیۡنَ ۚ وَ حَسُنَ اُولٰٓئِکَ رَفِیۡقًا ﴿ؕ۶۹﴾",
                    "ذٰلِکَ الۡفَضۡلُ مِنَ اللّٰہِ ؕ وَ کَفٰی بِاللّٰہِ عَلِیۡمًا ﴿٪۷۰﴾",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا خُذُوۡا حِذۡرَکُمۡ فَانۡفِرُوۡا ثُبَاتٍ اَوِ انۡفِرُوۡا جَمِیۡعًا ﴿۷۱﴾",
                    "وَ اِنَّ مِنۡکُمۡ لَمَنۡ لَّیُبَطِّئَنَّ ۚ فَاِنۡ اَصَابَتۡکُمۡ مُّصِیۡبَۃٌ قَالَ قَدۡ اَنۡعَمَ اللّٰہُ عَلَیَّ اِذۡ لَمۡ اَکُنۡ مَّعَہُمۡ شَہِیۡدًا ﴿۷۲﴾",
                    "وَ لَئِنۡ اَصَابَکُمۡ فَضۡلٌ مِّنَ اللّٰہِ لَیَقُوۡلَنَّ کَاَنۡ لَّمۡ تَکُنۡۢ بَیۡنَکُمۡ وَ بَیۡنَہٗ مَوَدَّۃٌ یّٰلَیۡتَنِیۡ کُنۡتُ مَعَہُمۡ فَاَفُوۡزَ فَوۡزًا عَظِیۡمًا ﴿۷۳﴾",
                    "فَلۡیُقَاتِلۡ فِیۡ سَبِیۡلِ اللّٰہِ الَّذِیۡنَ یَشۡرُوۡنَ الۡحَیٰوۃَ الدُّنۡیَا بِالۡاٰخِرَۃِ ؕ وَ مَنۡ یُّقَاتِلۡ فِیۡ سَبِیۡلِ اللّٰہِ فَیُقۡتَلۡ اَوۡ یَغۡلِبۡ فَسَوۡفَ نُؤۡتِیۡہِ اَجۡرًا عَظِیۡمًا ﴿۷۴﴾",
                    "وَ مَا لَکُمۡ لَا تُقَاتِلُوۡنَ فِیۡ سَبِیۡلِ اللّٰہِ وَ الۡمُسۡتَضۡعَفِیۡنَ مِنَ الرِّجَالِ وَ النِّسَآءِ وَ الۡوِلۡدَانِ الَّذِیۡنَ یَقُوۡلُوۡنَ رَبَّنَاۤ اَخۡرِجۡنَا مِنۡ ہٰذِہِ الۡقَرۡیَۃِ الظَّالِمِ اَہۡلُہَا ۚ وَ اجۡعَلۡ لَّنَا مِنۡ لَّدُنۡکَ وَلِیًّا ۚۙ وَّ اجۡعَلۡ لَّنَا مِنۡ لَّدُنۡکَ نَصِیۡرًا ﴿ؕ۷۵﴾",
                    "اَلَّذِیۡنَ اٰمَنُوۡا یُقَاتِلُوۡنَ فِیۡ سَبِیۡلِ اللّٰہِ ۚ وَ الَّذِیۡنَ کَفَرُوۡا یُقَاتِلُوۡنَ فِیۡ سَبِیۡلِ الطَّاغُوۡتِ فَقَاتِلُوۡۤا اَوۡلِیَآءَ الشَّیۡطٰنِ ۚ اِنَّ کَیۡدَ الشَّیۡطٰنِ کَانَ ضَعِیۡفًا ﴿٪۷۶﴾",
                    "اَلَمۡ تَرَ اِلَی الَّذِیۡنَ قِیۡلَ لَہُمۡ کُفُّوۡۤا اَیۡدِیَکُمۡ وَ اَقِیۡمُوا الصَّلٰوۃَ  وَ اٰتُوا الزَّکٰوۃَ ۚ فَلَمَّا کُتِبَ عَلَیۡہِمُ الۡقِتَالُ اِذَا فَرِیۡقٌ مِّنۡہُمۡ یَخۡشَوۡنَ النَّاسَ  کَخَشۡیَۃِ  اللّٰہِ اَوۡ اَشَدَّ خَشۡیَۃً ۚ وَ قَالُوۡا رَبَّنَا لِمَ کَتَبۡتَ عَلَیۡنَا الۡقِتَالَ ۚ لَوۡ لَاۤ اَخَّرۡتَنَاۤ اِلٰۤی اَجَلٍ قَرِیۡبٍ ؕ قُلۡ مَتَاعُ الدُّنۡیَا قَلِیۡلٌ ۚ وَ الۡاٰخِرَۃُ خَیۡرٌ  لِّمَنِ  اتَّقٰی ۟ وَ لَا تُظۡلَمُوۡنَ  فَتِیۡلًا ﴿۷۷﴾",
                    "اَیۡنَ مَا تَکُوۡنُوۡا یُدۡرِکۡکُّمُ الۡمَوۡتُ وَ لَوۡ کُنۡتُمۡ  فِیۡ  بُرُوۡجٍ مُّشَیَّدَۃٍ ؕ وَ  اِنۡ تُصِبۡہُمۡ حَسَنَۃٌ  یَّقُوۡلُوۡا ہٰذِہٖ مِنۡ عِنۡدِ اللّٰہِ ۚ وَ اِنۡ تُصِبۡہُمۡ سَیِّئَۃٌ یَّقُوۡلُوۡا ہٰذِہٖ مِنۡ عِنۡدِکَ ؕ قُلۡ کُلٌّ مِّنۡ عِنۡدِ اللّٰہِ ؕ فَمَالِ ہٰۤؤُلَآءِ الۡقَوۡمِ لَا یَکَادُوۡنَ یَفۡقَہُوۡنَ حَدِیۡثًا ﴿۷۸﴾",
                    "مَاۤ  اَصَابَکَ مِنۡ حَسَنَۃٍ  فَمِنَ اللّٰہِ ۫ وَ مَاۤ اَصَابَکَ مِنۡ سَیِّئَۃٍ  فَمِنۡ نَّفۡسِکَ ؕ وَ اَرۡسَلۡنٰکَ لِلنَّاسِ رَسُوۡلًا ؕ وَ کَفٰی بِاللّٰہِ شَہِیۡدًا ﴿۷۹﴾",
                    "مَنۡ یُّطِعِ الرَّسُوۡلَ فَقَدۡ اَطَاعَ اللّٰہَ ۚ وَ مَنۡ تَوَلّٰی  فَمَاۤ  اَرۡسَلۡنٰکَ عَلَیۡہِمۡ حَفِیۡظًا  ﴿ؕ۸۰﴾",
                    "وَ یَقُوۡلُوۡنَ طَاعَۃٌ ۫ فَاِذَا بَرَزُوۡا مِنۡ عِنۡدِکَ بَیَّتَ طَآئِفَۃٌ مِّنۡہُمۡ غَیۡرَ الَّذِیۡ تَقُوۡلُ ؕ وَ اللّٰہُ یَکۡتُبُ مَا یُبَیِّتُوۡنَ ۚ فَاَعۡرِضۡ عَنۡہُمۡ وَ تَوَکَّلۡ عَلَی اللّٰہِ ؕ وَ کَفٰی بِاللّٰہِ  وَکِیۡلًا ﴿۸۱﴾",
                    "اَفَلَا یَتَدَبَّرُوۡنَ الۡقُرۡاٰنَ ؕ وَ لَوۡ  کَانَ مِنۡ عِنۡدِ غَیۡرِ اللّٰہِ لَوَجَدُوۡا فِیۡہِ اخۡتِلَافًا کَثِیۡرًا ﴿۸۲﴾",
                    "وَ  اِذَا جَآءَہُمۡ  اَمۡرٌ مِّنَ الۡاَمۡنِ اَوِ  الۡخَوۡفِ اَذَاعُوۡا بِہٖ ؕ وَ لَوۡ رَدُّوۡہُ  اِلَی الرَّسُوۡلِ وَ اِلٰۤی اُولِی الۡاَمۡرِ مِنۡہُمۡ لَعَلِمَہُ الَّذِیۡنَ یَسۡتَنۡۢبِطُوۡنَہٗ مِنۡہُمۡ ؕ وَ لَوۡ لَا فَضۡلُ اللّٰہِ عَلَیۡکُمۡ وَ رَحۡمَتُہٗ لَاتَّبَعۡتُمُ الشَّیۡطٰنَ  اِلَّا  قَلِیۡلًا ﴿۸۳﴾",
                    "فَقَاتِلۡ فِیۡ سَبِیۡلِ اللّٰہِ ۚ لَا تُکَلَّفُ اِلَّا نَفۡسَکَ وَ حَرِّضِ الۡمُؤۡمِنِیۡنَ ۚ عَسَی اللّٰہُ اَنۡ یَّکُفَّ بَاۡسَ الَّذِیۡنَ کَفَرُوۡا ؕ وَ اللّٰہُ اَشَدُّ  بَاۡسًا وَّ اَشَدُّ تَنۡکِیۡلًا ﴿۸۴﴾",
                    "مَنۡ یَّشۡفَعۡ شَفَاعَۃً حَسَنَۃً یَّکُنۡ لَّہٗ نَصِیۡبٌ مِّنۡہَا ۚ وَ مَنۡ یَّشۡفَعۡ شَفَاعَۃً سَیِّئَۃً یَّکُنۡ لَّہٗ کِفۡلٌ مِّنۡہَا ؕ وَ کَانَ اللّٰہُ  عَلٰی کُلِّ  شَیۡءٍ  مُّقِیۡتًا ﴿۸۵﴾",
                    "وَ اِذَا حُیِّیۡتُمۡ بِتَحِیَّۃٍ فَحَیُّوۡا بِاَحۡسَنَ مِنۡہَاۤ  اَوۡ رُدُّوۡہَا ؕ اِنَّ اللّٰہَ کَانَ عَلٰی کُلِّ  شَیۡءٍ  حَسِیۡبًا ﴿۸۶﴾",
                    "اَللّٰہُ لَاۤ اِلٰہَ  اِلَّا ہُوَ ؕ لَیَجۡمَعَنَّکُمۡ اِلٰی یَوۡمِ الۡقِیٰمَۃِ لَا رَیۡبَ فِیۡہِ ؕ وَ مَنۡ اَصۡدَقُ مِنَ  اللّٰہِ  حَدِیۡثًا ﴿٪۸۷﴾",
                    "فَمَا  لَکُمۡ فِی الۡمُنٰفِقِیۡنَ فِئَتَیۡنِ وَ اللّٰہُ اَرۡکَسَہُمۡ بِمَا کَسَبُوۡا ؕ اَتُرِیۡدُوۡنَ اَنۡ تَہۡدُوۡا مَنۡ اَضَلَّ اللّٰہُ ؕ وَ مَنۡ یُّضۡلِلِ اللّٰہُ فَلَنۡ تَجِدَ لَہٗ سَبِیۡلًا ﴿۸۸﴾",
                    "وَدُّوۡا لَوۡ تَکۡفُرُوۡنَ کَمَا کَفَرُوۡا فَتَکُوۡنُوۡنَ سَوَآءً  فَلَا تَتَّخِذُوۡا مِنۡہُمۡ اَوۡلِیَآءَ حَتّٰی یُہَاجِرُوۡا فِیۡ سَبِیۡلِ اللّٰہِ ؕ فَاِنۡ تَوَلَّوۡا فَخُذُوۡہُمۡ وَ اقۡتُلُوۡہُمۡ حَیۡثُ وَجَدۡتُّمُوۡہُمۡ ۪ وَ لَا تَتَّخِذُوۡا مِنۡہُمۡ  وَلِیًّا وَّ لَا  نَصِیۡرًا ﴿ۙ۸۹﴾",
                    "اِلَّا الَّذِیۡنَ یَصِلُوۡنَ اِلٰی قَوۡمٍۭ بَیۡنَکُمۡ وَ بَیۡنَہُمۡ مِّیۡثَاقٌ اَوۡ جَآءُوۡکُمۡ حَصِرَتۡ صُدُوۡرُہُمۡ اَنۡ یُّقَاتِلُوۡکُمۡ اَوۡ یُقَاتِلُوۡا قَوۡمَہُمۡ ؕ وَ لَوۡ شَآءَ اللّٰہُ لَسَلَّطَہُمۡ عَلَیۡکُمۡ فَلَقٰتَلُوۡکُمۡ ۚ فَاِنِ اعۡتَزَلُوۡکُمۡ فَلَمۡ یُقَاتِلُوۡکُمۡ  وَ اَلۡقَوۡا اِلَیۡکُمُ السَّلَمَ ۙ فَمَا جَعَلَ اللّٰہُ لَکُمۡ عَلَیۡہِمۡ  سَبِیۡلًا ﴿۹۰﴾",
                    "سَتَجِدُوۡنَ اٰخَرِیۡنَ یُرِیۡدُوۡنَ اَنۡ یَّاۡمَنُوۡکُمۡ وَ یَاۡمَنُوۡا قَوۡمَہُمۡ ؕ کُلَّمَا رُدُّوۡۤا  اِلَی الۡفِتۡنَۃِ  اُرۡکِسُوۡا فِیۡہَا ۚ فَاِنۡ لَّمۡ یَعۡتَزِلُوۡکُمۡ وَ یُلۡقُوۡۤا اِلَیۡکُمُ السَّلَمَ وَ یَکُفُّوۡۤا اَیۡدِیَہُمۡ فَخُذُوۡہُمۡ وَ اقۡتُلُوۡہُمۡ حَیۡثُ ثَقِفۡتُمُوۡہُمۡ ؕ وَ اُولٰٓئِکُمۡ جَعَلۡنَا لَکُمۡ عَلَیۡہِمۡ سُلۡطٰنًا مُّبِیۡنًا ﴿٪۹۱﴾",
                    "وَ مَا کَانَ لِمُؤۡمِنٍ اَنۡ یَّقۡتُلَ مُؤۡمِنًا اِلَّا خَطَـًٔا ۚ وَ مَنۡ قَتَلَ مُؤۡمِنًا خَطَـًٔا فَتَحۡرِیۡرُ رَقَبَۃٍ مُّؤۡمِنَۃٍ وَّ دِیَۃٌ مُّسَلَّمَۃٌ اِلٰۤی اَہۡلِہٖۤ  اِلَّاۤ اَنۡ یَّصَّدَّقُوۡا ؕ فَاِنۡ کَانَ مِنۡ قَوۡمٍ عَدُوٍّ لَّکُمۡ وَ ہُوَ مُؤۡمِنٌ فَتَحۡرِیۡرُ رَقَبَۃٍ مُّؤۡمِنَۃٍ ؕ وَ اِنۡ کَانَ مِنۡ قَوۡمٍۭ بَیۡنَکُمۡ وَ بَیۡنَہُمۡ مِّیۡثَاقٌ فَدِیَۃٌ مُّسَلَّمَۃٌ اِلٰۤی اَہۡلِہٖ وَ تَحۡرِیۡرُ رَقَبَۃٍ مُّؤۡمِنَۃٍ ۚ فَمَنۡ لَّمۡ  یَجِدۡ فَصِیَامُ شَہۡرَیۡنِ مُتَتَابِعَیۡنِ ۫ تَوۡبَۃً مِّنَ  اللّٰہِ ؕ وَ کَانَ اللّٰہُ  عَلِیۡمًا حَکِیۡمًا ﴿۹۲﴾",
                    "وَ مَنۡ یَّقۡتُلۡ مُؤۡمِنًا مُّتَعَمِّدًا فَجَزَآؤُہٗ جَہَنَّمُ خٰلِدًا فِیۡہَا وَ غَضِبَ اللّٰہُ عَلَیۡہِ وَ لَعَنَہٗ وَ اَعَدَّ  لَہٗ عَذَابًا عَظِیۡمًا ﴿۹۳﴾",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِذَا ضَرَبۡتُمۡ فِیۡ سَبِیۡلِ اللّٰہِ فَتَبَیَّنُوۡا وَ لَا تَقُوۡلُوۡا لِمَنۡ اَلۡقٰۤی اِلَیۡکُمُ السَّلٰمَ لَسۡتَ مُؤۡمِنًا ۚ تَبۡتَغُوۡنَ عَرَضَ الۡحَیٰوۃِ الدُّنۡیَا ۫ فَعِنۡدَ اللّٰہِ مَغَانِمُ کَثِیۡرَۃٌ ؕ کَذٰلِکَ کُنۡتُمۡ مِّنۡ قَبۡلُ فَمَنَّ اللّٰہُ عَلَیۡکُمۡ فَتَبَیَّنُوۡا ؕ اِنَّ اللّٰہَ کَانَ بِمَا تَعۡمَلُوۡنَ خَبِیۡرًا ﴿۹۴﴾",
                    "لَا یَسۡتَوِی الۡقٰعِدُوۡنَ مِنَ الۡمُؤۡمِنِیۡنَ غَیۡرُ اُولِی الضَّرَرِ وَ الۡمُجٰہِدُوۡنَ فِیۡ سَبِیۡلِ اللّٰہِ بِاَمۡوَالِہِمۡ وَ اَنۡفُسِہِمۡ ؕ فَضَّلَ اللّٰہُ الۡمُجٰہِدِیۡنَ بِاَمۡوَالِہِمۡ وَ اَنۡفُسِہِمۡ عَلَی الۡقٰعِدِیۡنَ دَرَجَۃً ؕ وَ کُلًّا وَّعَدَ اللّٰہُ الۡحُسۡنٰی ؕ وَ فَضَّلَ اللّٰہُ الۡمُجٰہِدِیۡنَ عَلَی الۡقٰعِدِیۡنَ اَجۡرًا عَظِیۡمًا ﴿ۙ۹۵﴾",
                    "دَرَجٰتٍ مِّنۡہُ وَ مَغۡفِرَۃً وَّ رَحۡمَۃً ؕ وَ کَانَ اللّٰہُ  غَفُوۡرًا  رَّحِیۡمًا ﴿٪۹۶﴾",
                    "اِنَّ الَّذِیۡنَ تَوَفّٰہُمُ الۡمَلٰٓئِکَۃُ ظَالِمِیۡۤ اَنۡفُسِہِمۡ قَالُوۡا فِیۡمَ کُنۡتُمۡ ؕ قَالُوۡا کُنَّا مُسۡتَضۡعَفِیۡنَ فِی الۡاَرۡضِ ؕ قَالُوۡۤا اَلَمۡ تَکُنۡ اَرۡضُ اللّٰہِ وَاسِعَۃً فَتُہَاجِرُوۡا فِیۡہَا ؕ فَاُولٰٓئِکَ مَاۡوٰٮہُمۡ جَہَنَّمُ ؕ وَ سَآءَتۡ مَصِیۡرًا ﴿ۙ۹۷﴾",
                    "اِلَّا الۡمُسۡتَضۡعَفِیۡنَ مِنَ الرِّجَالِ وَ النِّسَآءِ وَ الۡوِلۡدَانِ لَا یَسۡتَطِیۡعُوۡنَ حِیۡلَۃً  وَّ لَا  یَہۡتَدُوۡنَ سَبِیۡلًا ﴿ۙ۹۸﴾",
                    "فَاُولٰٓئِکَ عَسَی اللّٰہُ اَنۡ یَّعۡفُوَ عَنۡہُمۡ ؕ وَ کَانَ اللّٰہُ عَفُوًّا غَفُوۡرًا ﴿۹۹﴾",
                    "وَ مَنۡ یُّہَاجِرۡ فِیۡ سَبِیۡلِ اللّٰہِ یَجِدۡ فِی الۡاَرۡضِ مُرٰغَمًا کَثِیۡرًا وَّ سَعَۃً ؕ وَ مَنۡ یَّخۡرُجۡ مِنۡۢ بَیۡتِہٖ مُہَاجِرًا  اِلَی اللّٰہِ وَ رَسُوۡلِہٖ ثُمَّ  یُدۡرِکۡہُ الۡمَوۡتُ فَقَدۡ وَقَعَ اَجۡرُہٗ عَلَی اللّٰہِ ؕ وَ کَانَ اللّٰہُ غَفُوۡرًا رَّحِیۡمًا ﴿۱۰۰﴾٪",
                    "وَ اِذَا ضَرَبۡتُمۡ فِی الۡاَرۡضِ فَلَیۡسَ عَلَیۡکُمۡ جُنَاحٌ اَنۡ تَقۡصُرُوۡا مِنَ الصَّلٰوۃِ ٭ۖ اِنۡ خِفۡتُمۡ اَنۡ یَّفۡتِنَکُمُ الَّذِیۡنَ کَفَرُوۡا ؕ اِنَّ الۡکٰفِرِیۡنَ کَانُوۡا لَکُمۡ عَدُوًّا مُّبِیۡنًا ﴿۱۰۱﴾",
                    "وَ اِذَا کُنۡتَ فِیۡہِمۡ فَاَقَمۡتَ لَہُمُ الصَّلٰوۃَ فَلۡتَقُمۡ طَآئِفَۃٌ مِّنۡہُمۡ مَّعَکَ وَ لۡیَاۡخُذُوۡۤا اَسۡلِحَتَہُمۡ ۟ فَاِذَا سَجَدُوۡا فَلۡیَکُوۡنُوۡا مِنۡ وَّرَآئِکُمۡ ۪ وَ لۡتَاۡتِ طَآئِفَۃٌ اُخۡرٰی لَمۡ یُصَلُّوۡا فَلۡیُصَلُّوۡا مَعَکَ وَ لۡیَاۡخُذُوۡا حِذۡرَہُمۡ وَ اَسۡلِحَتَہُمۡ ۚ وَدَّ الَّذِیۡنَ کَفَرُوۡا لَوۡ تَغۡفُلُوۡنَ عَنۡ اَسۡلِحَتِکُمۡ وَ اَمۡتِعَتِکُمۡ فَیَمِیۡلُوۡنَ عَلَیۡکُمۡ مَّیۡلَۃً وَّاحِدَۃً ؕ وَ لَا جُنَاحَ عَلَیۡکُمۡ اِنۡ کَانَ بِکُمۡ اَذًی مِّنۡ مَّطَرٍ اَوۡ کُنۡتُمۡ مَّرۡضٰۤی اَنۡ تَضَعُوۡۤا اَسۡلِحَتَکُمۡ ۚ وَ خُذُوۡا حِذۡرَکُمۡ ؕ اِنَّ اللّٰہَ اَعَدَّ لِلۡکٰفِرِیۡنَ عَذَابًا مُّہِیۡنًا ﴿۱۰۲﴾",
                    "فَاِذَا قَضَیۡتُمُ الصَّلٰوۃَ فَاذۡکُرُوا اللّٰہَ قِیٰمًا وَّ قُعُوۡدًا وَّ عَلٰی جُنُوۡبِکُمۡ ۚ فَاِذَا اطۡمَاۡنَنۡتُمۡ فَاَقِیۡمُوا الصَّلٰوۃَ ۚ اِنَّ الصَّلٰوۃَ  کَانَتۡ عَلَی الۡمُؤۡمِنِیۡنَ  کِتٰبًا مَّوۡقُوۡتًا ﴿۱۰۳﴾",
                    "وَ لَا تَہِنُوۡا فِی ابۡتِغَآءِ الۡقَوۡمِ ؕ اِنۡ تَکُوۡنُوۡا تَاۡلَمُوۡنَ فَاِنَّہُمۡ یَاۡلَمُوۡنَ کَمَا تَاۡلَمُوۡنَ ۚ وَ تَرۡجُوۡنَ مِنَ اللّٰہِ مَا لَا یَرۡجُوۡنَ ؕ وَ کَانَ اللّٰہُ  عَلِیۡمًا  حَکِیۡمًا ﴿۱۰۴﴾٪",
                    "اِنَّاۤ اَنۡزَلۡنَاۤ اِلَیۡکَ الۡکِتٰبَ بِالۡحَقِّ لِتَحۡکُمَ بَیۡنَ النَّاسِ بِمَاۤ  اَرٰٮکَ اللّٰہُ ؕ وَ لَا تَکُنۡ  لِّلۡخَآئِنِیۡنَ خَصِیۡمًا ﴿۱۰۵﴾ۙ",
                    "وَّ اسۡتَغۡفِرِ اللّٰہَ ؕ اِنَّ اللّٰہَ کَانَ غَفُوۡرًا رَّحِیۡمًا ﴿۱۰۶﴾ۚ",
                    "وَ لَا تُجَادِلۡ عَنِ الَّذِیۡنَ یَخۡتَانُوۡنَ اَنۡفُسَہُمۡ ؕ اِنَّ اللّٰہَ  لَا یُحِبُّ مَنۡ کَانَ خَوَّانًا اَثِیۡمًا ﴿۱۰۷﴾ۚۙ",
                    "یَّسۡتَخۡفُوۡنَ مِنَ النَّاسِ وَ لَا یَسۡتَخۡفُوۡنَ مِنَ اللّٰہِ وَ ہُوَ  مَعَہُمۡ  اِذۡ  یُبَیِّتُوۡنَ مَا لَا یَرۡضٰی مِنَ الۡقَوۡلِ ؕ وَ کَانَ اللّٰہُ بِمَا یَعۡمَلُوۡنَ  مُحِیۡطًا ﴿۱۰۸﴾",
                    "ہٰۤاَنۡتُمۡ ہٰۤؤُلَآءِ جٰدَلۡتُمۡ عَنۡہُمۡ فِی الۡحَیٰوۃِ الدُّنۡیَا ۟ فَمَنۡ یُّجَادِلُ اللّٰہَ عَنۡہُمۡ یَوۡمَ الۡقِیٰمَۃِ  اَمۡ مَّنۡ یَّکُوۡنُ عَلَیۡہِمۡ  وَکِیۡلًا ﴿۱۰۹﴾",
                    "وَ مَنۡ یَّعۡمَلۡ سُوۡٓءًا اَوۡ یَظۡلِمۡ  نَفۡسَہٗ ثُمَّ یَسۡتَغۡفِرِ اللّٰہَ یَجِدِ اللّٰہَ غَفُوۡرًا رَّحِیۡمًا ﴿۱۱۰﴾",
                    "وَ مَنۡ یَّکۡسِبۡ اِثۡمًا فَاِنَّمَا یَکۡسِبُہٗ عَلٰی نَفۡسِہٖ ؕ وَ کَانَ اللّٰہُ عَلِیۡمًا حَکِیۡمًا ﴿۱۱۱﴾",
                    "وَ مَنۡ یَّکۡسِبۡ خَطِیۡٓٮـَٔۃً اَوۡ اِثۡمًا ثُمَّ یَرۡمِ بِہٖ بَرِیۡٓــًٔا فَقَدِ احۡتَمَلَ بُہۡتَانًا وَّ اِثۡمًا مُّبِیۡنًا ﴿۱۱۲﴾٪",
                    "وَ لَوۡ لَا فَضۡلُ اللّٰہِ عَلَیۡکَ وَ رَحۡمَتُہٗ لَہَمَّتۡ طَّآئِفَۃٌ مِّنۡہُمۡ اَنۡ یُّضِلُّوۡکَ ؕ وَ مَا یُضِلُّوۡنَ  اِلَّاۤ اَنۡفُسَہُمۡ وَ مَا یَضُرُّوۡنَکَ مِنۡ شَیۡءٍ ؕ وَ اَنۡزَلَ اللّٰہُ عَلَیۡکَ الۡکِتٰبَ وَ الۡحِکۡمَۃَ وَ عَلَّمَکَ مَا لَمۡ تَکُنۡ تَعۡلَمُ ؕ وَ کَانَ فَضۡلُ اللّٰہِ عَلَیۡکَ عَظِیۡمًا ﴿۱۱۳﴾",
                    "لَا  خَیۡرَ  فِیۡ  کَثِیۡرٍ  مِّنۡ نَّجۡوٰٮہُمۡ  اِلَّا مَنۡ اَمَرَ بِصَدَقَۃٍ اَوۡ مَعۡرُوۡفٍ اَوۡ اِصۡلَاحٍۭ  بَیۡنَ النَّاسِ ؕ وَ مَنۡ یَّفۡعَلۡ ذٰلِکَ ابۡتِغَآءَ مَرۡضَاتِ اللّٰہِ فَسَوۡفَ نُؤۡتِیۡـہِ اَجۡرًا عَظِیۡمًا ﴿۱۱۴﴾",
                    "وَ مَنۡ یُّشَاقِقِ الرَّسُوۡلَ مِنۡۢ بَعۡدِ مَا تَبَیَّنَ لَہُ الۡہُدٰی وَ یَتَّبِعۡ غَیۡرَ  سَبِیۡلِ الۡمُؤۡمِنِیۡنَ نُوَلِّہٖ مَا تَوَلّٰی وَ نُصۡلِہٖ جَہَنَّمَ ؕ وَ سَآءَتۡ مَصِیۡرًا ﴿۱۱۵﴾٪",
                    "اِنَّ اللّٰہَ لَا یَغۡفِرُ اَنۡ یُّشۡرَکَ بِہٖ وَ یَغۡفِرُ مَا دُوۡنَ ذٰلِکَ لِمَنۡ یَّشَآءُ ؕ وَ مَنۡ یُّشۡرِکۡ بِاللّٰہِ فَقَدۡ  ضَلَّ  ضَلٰلًۢا  بَعِیۡدًا ﴿۱۱۶﴾",
                    "اِنۡ یَّدۡعُوۡنَ مِنۡ دُوۡنِہٖۤ  اِلَّاۤ اِنٰثًا ۚ وَ اِنۡ یَّدۡعُوۡنَ  اِلَّا شَیۡطٰنًا مَّرِیۡدًا ﴿۱۱۷﴾ۙ",
                    "لَّعَنَہُ اللّٰہُ ۘ وَ قَالَ لَاَتَّخِذَنَّ مِنۡ عِبَادِکَ نَصِیۡبًا مَّفۡرُوۡضًا ﴿۱۱۸﴾ۙ",
                    "وَّ لَاُضِلَّنَّہُمۡ وَ لَاُمَنِّیَنَّہُمۡ وَ لَاٰمُرَنَّہُمۡ فَلَیُبَتِّکُنَّ اٰذَانَ الۡاَنۡعَامِ وَ لَاٰمُرَنَّہُمۡ فَلَیُغَیِّرُنَّ خَلۡقَ اللّٰہِ ؕ وَ مَنۡ یَّتَّخِذِ الشَّیۡطٰنَ وَلِیًّا مِّنۡ دُوۡنِ اللّٰہِ فَقَدۡ خَسِرَ  خُسۡرَانًا مُّبِیۡنًا  ﴿۱۱۹﴾ؕ",
                    "یَعِدُہُمۡ وَ یُمَنِّیۡہِمۡ ؕ وَ مَا یَعِدُہُمُ الشَّیۡطٰنُ  اِلَّا  غُرُوۡرًا ﴿۱۲۰﴾",
                    "اُولٰٓئِکَ مَاۡوٰٮہُمۡ جَہَنَّمُ ۫ وَ لَا یَجِدُوۡنَ عَنۡہَا  مَحِیۡصًا ﴿۱۲۱﴾",
                    "وَ الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ سَنُدۡخِلُہُمۡ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ خٰلِدِیۡنَ فِیۡہَاۤ  اَبَدًا ؕ وَعۡدَ اللّٰہِ حَقًّا ؕ وَ مَنۡ اَصۡدَقُ مِنَ اللّٰہِ قِیۡلًا ﴿۱۲۲﴾",
                    "لَیۡسَ بِاَمَانِیِّکُمۡ وَ لَاۤ اَمَانِیِّ اَہۡلِ الۡکِتٰبِ ؕ مَنۡ یَّعۡمَلۡ سُوۡٓءًا یُّجۡزَ  بِہٖ ۙ وَ لَا یَجِدۡ لَہٗ مِنۡ دُوۡنِ اللّٰہِ وَلِیًّا وَّ لَا نَصِیۡرًا ﴿۱۲۳﴾",
                    "وَ مَنۡ یَّعۡمَلۡ مِنَ الصّٰلِحٰتِ مِنۡ ذَکَرٍ اَوۡ اُنۡثٰی وَ ہُوَ مُؤۡمِنٌ فَاُولٰٓئِکَ یَدۡخُلُوۡنَ الۡجَنَّۃَ  وَ لَا  یُظۡلَمُوۡنَ  نَقِیۡرًا ﴿۱۲۴﴾",
                    "وَ مَنۡ اَحۡسَنُ دِیۡنًا مِّمَّنۡ اَسۡلَمَ  وَجۡہَہٗ لِلّٰہِ وَ ہُوَ مُحۡسِنٌ وَّ اتَّبَعَ مِلَّۃَ اِبۡرٰہِیۡمَ حَنِیۡفًا ؕ وَ اتَّخَذَ اللّٰہُ اِبۡرٰہِیۡمَ خَلِیۡلًا ﴿۱۲۵﴾",
                    "وَ لِلّٰہِ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ؕ وَ کَانَ اللّٰہُ بِکُلِّ شَیۡءٍ  مُّحِیۡطًا ﴿۱۲۶﴾٪",
                    "وَ یَسۡتَفۡتُوۡنَکَ فِی النِّسَآءِ ؕ قُلِ اللّٰہُ یُفۡتِیۡکُمۡ فِیۡہِنَّ ۙ وَ مَا یُتۡلٰی عَلَیۡکُمۡ فِی الۡکِتٰبِ فِیۡ یَتٰمَی النِّسَآءِ الّٰتِیۡ لَاتُؤۡ تُوۡنَہُنَّ مَا کُتِبَ لَہُنَّ وَ تَرۡغَبُوۡنَ  اَنۡ تَنۡکِحُوۡہُنَّ وَ الۡمُسۡتَضۡعَفِیۡنَ مِنَ الۡوِلۡدَانِ ۙ وَ اَنۡ تَقُوۡمُوۡا لِلۡیَتٰمٰی بِالۡقِسۡطِ ؕ وَ مَا تَفۡعَلُوۡا مِنۡ خَیۡرٍ فَاِنَّ اللّٰہَ کَانَ بِہٖ عَلِیۡمًا ﴿۱۲۷﴾",
                    "وَ اِنِ امۡرَاَۃٌ خَافَتۡ مِنۡۢ بَعۡلِہَا نُشُوۡزًا اَوۡ اِعۡرَاضًا فَلَا جُنَاحَ عَلَیۡہِمَاۤ  اَنۡ یُّصۡلِحَا بَیۡنَہُمَا صُلۡحًا ؕ وَ الصُّلۡحُ  خَیۡرٌ ؕ وَ اُحۡضِرَتِ الۡاَنۡفُسُ الشُّحَّ ؕ وَ اِنۡ تُحۡسِنُوۡا وَ تَتَّقُوۡا فَاِنَّ اللّٰہَ کَانَ بِمَا تَعۡمَلُوۡنَ  خَبِیۡرًا ﴿۱۲۸﴾",
                    "وَ لَنۡ تَسۡتَطِیۡعُوۡۤا اَنۡ تَعۡدِلُوۡا بَیۡنَ النِّسَآءِ وَ لَوۡ حَرَصۡتُمۡ فَلَا تَمِیۡلُوۡا کُلَّ الۡمَیۡلِ فَتَذَرُوۡہَا کَالۡمُعَلَّقَۃِ ؕ وَ اِنۡ تُصۡلِحُوۡا وَ تَتَّقُوۡا فَاِنَّ اللّٰہَ کَانَ غَفُوۡرًا رَّحِیۡمًا ﴿۱۲۹﴾",
                    "وَ  اِنۡ یَّتَفَرَّقَا یُغۡنِ اللّٰہُ  کُلًّا مِّنۡ سَعَتِہٖ ؕ وَ کَانَ اللّٰہُ  وَاسِعًا حَکِیۡمًا ﴿۱۳۰﴾",
                    "وَ لِلّٰہِ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ؕ وَ لَقَدۡ وَصَّیۡنَا الَّذِیۡنَ اُوۡتُوا الۡکِتٰبَ مِنۡ قَبۡلِکُمۡ وَ اِیَّاکُمۡ اَنِ اتَّقُوا اللّٰہَ ؕ وَ اِنۡ تَکۡفُرُوۡا فَاِنَّ لِلّٰہِ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ؕ وَ کَانَ اللّٰہُ غَنِیًّا حَمِیۡدًا ﴿۱۳۱﴾",
                    "وَ لِلّٰہِ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ ؕ وَ کَفٰی بِاللّٰہِ وَکِیۡلًا ﴿۱۳۲﴾",
                    "اِنۡ یَّشَاۡ یُذۡہِبۡکُمۡ اَیُّہَا النَّاسُ وَ یَاۡتِ بِاٰخَرِیۡنَ ؕ وَ کَانَ اللّٰہُ عَلٰی ذٰلِکَ قَدِیۡرًا ﴿۱۳۳﴾",
                    "مَنۡ کَانَ یُرِیۡدُ ثَوَابَ الدُّنۡیَا فَعِنۡدَ اللّٰہِ ثَوَابُ الدُّنۡیَا وَ الۡاٰخِرَۃِ  ؕ وَ کَانَ اللّٰہُ  سَمِیۡعًۢا بَصِیۡرًا ﴿۱۳۴﴾٪",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا کُوۡنُوۡا قَوّٰمِیۡنَ بِالۡقِسۡطِ شُہَدَآءَ  لِلّٰہِ وَ لَوۡ عَلٰۤی اَنۡفُسِکُمۡ اَوِ الۡوَالِدَیۡنِ وَ الۡاَقۡرَبِیۡنَ ۚ اِنۡ یَّکُنۡ غَنِیًّا اَوۡ فَقِیۡرًا فَاللّٰہُ اَوۡلٰی بِہِمَا ۟ فَلَا تَتَّبِعُوا الۡہَوٰۤی اَنۡ تَعۡدِلُوۡا ۚ وَ اِنۡ تَلۡوٗۤا اَوۡ تُعۡرِضُوۡا فَاِنَّ اللّٰہَ  کَانَ بِمَا تَعۡمَلُوۡنَ خَبِیۡرًا ﴿۱۳۵﴾",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اٰمِنُوۡا بِاللّٰہِ وَ رَسُوۡلِہٖ وَ الۡکِتٰبِ الَّذِیۡ نَزَّلَ عَلٰی رَسُوۡلِہٖ وَ الۡکِتٰبِ الَّذِیۡۤ اَنۡزَلَ مِنۡ قَبۡلُ ؕ وَ مَنۡ یَّکۡفُرۡ بِاللّٰہِ وَ مَلٰٓئِکَتِہٖ وَ کُتُبِہٖ وَ رُسُلِہٖ وَ الۡیَوۡمِ الۡاٰخِرِ فَقَدۡ ضَلَّ  ضَلٰلًۢا  بَعِیۡدًا ﴿۱۳۶﴾",
                    "اِنَّ الَّذِیۡنَ اٰمَنُوۡا ثُمَّ  کَفَرُوۡا ثُمَّ  اٰمَنُوۡا ثُمَّ  کَفَرُوۡا ثُمَّ  ازۡدَادُوۡا کُفۡرًا لَّمۡ  یَکُنِ اللّٰہُ لِیَغۡفِرَ لَہُمۡ وَ لَا لِیَہۡدِیَہُمۡ سَبِیۡلًا ﴿۱۳۷﴾ؕ",
                    "بَشِّرِ الۡمُنٰفِقِیۡنَ بِاَنَّ لَہُمۡ عَذَابًا اَلِیۡمَۨا ﴿۱۳۸﴾ۙ",
                    "الَّذِیۡنَ یَتَّخِذُوۡنَ الۡکٰفِرِیۡنَ اَوۡلِیَآءَ مِنۡ دُوۡنِ الۡمُؤۡمِنِیۡنَ ؕ اَیَبۡتَغُوۡنَ عِنۡدَہُمُ الۡعِزَّۃَ فَاِنَّ الۡعِزَّۃَ لِلّٰہِ جَمِیۡعًا ﴿۱۳۹﴾ؕ",
                    "وَ قَدۡ نَزَّلَ عَلَیۡکُمۡ  فِی الۡکِتٰبِ اَنۡ  اِذَا سَمِعۡتُمۡ اٰیٰتِ اللّٰہِ یُکۡفَرُ بِہَا وَ یُسۡتَہۡزَاُ بِہَا فَلَا تَقۡعُدُوۡا مَعَہُمۡ حَتّٰی یَخُوۡضُوۡا فِیۡ حَدِیۡثٍ غَیۡرِہٖۤ  ۫ۖ اِنَّکُمۡ  اِذًا مِّثۡلُہُمۡ ؕ اِنَّ اللّٰہَ جَامِعُ الۡمُنٰفِقِیۡنَ وَ الۡکٰفِرِیۡنَ فِیۡ جَہَنَّمَ جَمِیۡعَۨا ﴿۱۴۰﴾ۙ",
                    "الَّذِیۡنَ یَتَرَبَّصُوۡنَ بِکُمۡ ۚ فَاِنۡ کَانَ لَکُمۡ فَتۡحٌ مِّنَ اللّٰہِ قَالُوۡۤا اَلَمۡ نَکُنۡ مَّعَکُمۡ ۫ۖ وَ اِنۡ کَانَ لِلۡکٰفِرِیۡنَ نَصِیۡبٌ ۙ قَالُوۡۤا اَلَمۡ نَسۡتَحۡوِذۡ عَلَیۡکُمۡ وَ نَمۡنَعۡکُمۡ مِّنَ الۡمُؤۡمِنِیۡنَ ؕ فَاللّٰہُ یَحۡکُمُ بَیۡنَکُمۡ یَوۡمَ الۡقِیٰمَۃِ ؕ وَ لَنۡ یَّجۡعَلَ اللّٰہُ لِلۡکٰفِرِیۡنَ عَلَی الۡمُؤۡمِنِیۡنَ  سَبِیۡلًا ﴿۱۴۱﴾٪",
                    "اِنَّ الۡمُنٰفِقِیۡنَ یُخٰدِعُوۡنَ اللّٰہَ وَ ہُوَ خَادِعُہُمۡ ۚ وَ اِذَا قَامُوۡۤا اِلَی الصَّلٰوۃِ قَامُوۡا کُسَالٰی ۙ یُرَآءُوۡنَ النَّاسَ وَ لَا  یَذۡکُرُوۡنَ اللّٰہَ  اِلَّا  قَلِیۡلًا ﴿۱۴۲﴾۫ۙ",
                    "مُّذَبۡذَبِیۡنَ بَیۡنَ ذٰلِکَ ٭ۖ لَاۤ اِلٰی ہٰۤؤُلَآءِ وَ لَاۤ اِلٰی ہٰۤؤُلَآءِ ؕ وَ مَنۡ یُّضۡلِلِ اللّٰہُ فَلَنۡ تَجِدَ  لَہٗ  سَبِیۡلًا ﴿۱۴۳﴾",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تَتَّخِذُوا الۡکٰفِرِیۡنَ اَوۡلِیَآءَ مِنۡ دُوۡنِ الۡمُؤۡمِنِیۡنَؕ اَتُرِیۡدُوۡنَ اَنۡ  تَجۡعَلُوۡا لِلّٰہِ عَلَیۡکُمۡ  سُلۡطٰنًا مُّبِیۡنًا ﴿۱۴۴﴾",
                    "اِنَّ الۡمُنٰفِقِیۡنَ فِی الدَّرۡکِ الۡاَسۡفَلِ مِنَ النَّارِ ۚ وَ لَنۡ  تَجِدَ لَہُمۡ  نَصِیۡرًا ﴿۱۴۵﴾ۙ",
                    "اِلَّا الَّذِیۡنَ تَابُوۡا وَ اَصۡلَحُوۡا وَ اعۡتَصَمُوۡا بِاللّٰہِ وَ اَخۡلَصُوۡا دِیۡنَہُمۡ  لِلّٰہِ فَاُولٰٓئِکَ مَعَ الۡمُؤۡمِنِیۡنَ ؕ وَ سَوۡفَ یُؤۡتِ اللّٰہُ الۡمُؤۡمِنِیۡنَ اَجۡرًا عَظِیۡمًا ﴿۱۴۶﴾",
                    "مَا یَفۡعَلُ اللّٰہُ بِعَذَابِکُمۡ  اِنۡ شَکَرۡتُمۡ وَ اٰمَنۡتُمۡ ؕ وَ کَانَ اللّٰہُ شَاکِرًا عَلِیۡمًا ﴿۱۴۷﴾",
                    "لَا یُحِبُّ اللّٰہُ  الۡجَہۡرَ  بِالسُّوۡٓءِ مِنَ الۡقَوۡلِ اِلَّا مَنۡ ظُلِمَ ؕ وَ کَانَ اللّٰہُ سَمِیۡعًا عَلِیۡمًا ﴿۱۴۸﴾",
                    "اِنۡ تُبۡدُوۡا خَیۡرًا اَوۡ تُخۡفُوۡہُ اَوۡ تَعۡفُوۡا عَنۡ سُوۡٓءٍ فَاِنَّ اللّٰہَ کَانَ عَفُوًّا قَدِیۡرًا ﴿۱۴۹﴾",
                    "اِنَّ الَّذِیۡنَ یَکۡفُرُوۡنَ بِاللّٰہِ وَ رُسُلِہٖ وَ یُرِیۡدُوۡنَ اَنۡ یُّفَرِّقُوۡا بَیۡنَ اللّٰہِ وَ رُسُلِہٖ وَ یَقُوۡلُوۡنَ نُؤۡمِنُ بِبَعۡضٍ وَّ نَکۡفُرُ بِبَعۡضٍ ۙ وَّ یُرِیۡدُوۡنَ اَنۡ یَّتَّخِذُوۡا بَیۡنَ ذٰلِکَ  سَبِیۡلًا ﴿۱۵۰﴾ۙ",
                    "اُولٰٓئِکَ ہُمُ الۡکٰفِرُوۡنَ حَقًّا ۚ وَ اَعۡتَدۡنَا لِلۡکٰفِرِیۡنَ عَذَابًا مُّہِیۡنًا ﴿۱۵۱﴾",
                    "وَ الَّذِیۡنَ اٰمَنُوۡا بِاللّٰہِ وَ رُسُلِہٖ وَ لَمۡ یُفَرِّقُوۡا بَیۡنَ اَحَدٍ مِّنۡہُمۡ اُولٰٓئِکَ سَوۡفَ یُؤۡتِیۡہِمۡ اُجُوۡرَہُمۡ ؕ وَ کَانَ اللّٰہُ غَفُوۡرًا رَّحِیۡمًا ﴿۱۵۲﴾٪",
                    "یَسۡـَٔلُکَ اَہۡلُ الۡکِتٰبِ اَنۡ تُنَزِّلَ عَلَیۡہِمۡ کِتٰبًا مِّنَ السَّمَآءِ فَقَدۡ سَاَلُوۡا مُوۡسٰۤی اَکۡبَرَ مِنۡ ذٰلِکَ فَقَالُوۡۤا اَرِنَا اللّٰہَ جَہۡرَۃً فَاَخَذَتۡہُمُ الصّٰعِقَۃُ بِظُلۡمِہِمۡ ۚ ثُمَّ اتَّخَذُوا الۡعِجۡلَ مِنۡۢ بَعۡدِ مَا جَآءَتۡہُمُ الۡبَیِّنٰتُ فَعَفَوۡنَا عَنۡ ذٰلِکَ ۚ وَ اٰتَیۡنَا مُوۡسٰی سُلۡطٰنًا مُّبِیۡنًا ﴿۱۵۳﴾",
                    "وَ رَفَعۡنَا فَوۡقَہُمُ الطُّوۡرَ بِمِیۡثَاقِہِمۡ وَ قُلۡنَا لَہُمُ ادۡخُلُوا الۡبَابَ سُجَّدًا وَّ قُلۡنَا لَہُمۡ لَا تَعۡدُوۡا فِی السَّبۡتِ وَ اَخَذۡنَا مِنۡہُمۡ مِّیۡثَاقًا غَلِیۡظًا ﴿۱۵۴﴾",
                    "فَبِمَا نَقۡضِہِمۡ مِّیۡثَاقَہُمۡ وَ کُفۡرِہِمۡ بِاٰیٰتِ اللّٰہِ وَ قَتۡلِہِمُ الۡاَنۡۢبِیَآءَ بِغَیۡرِ حَقٍّ وَّ قَوۡلِہِمۡ قُلُوۡبُنَا غُلۡفٌ ؕ بَلۡ طَبَعَ اللّٰہُ عَلَیۡہَا بِکُفۡرِہِمۡ فَلَا یُؤۡمِنُوۡنَ  اِلَّا قَلِیۡلًا ﴿۱۵۵﴾۪",
                    "وَّ بِکُفۡرِہِمۡ وَ قَوۡلِہِمۡ عَلٰی مَرۡیَمَ  بُہۡتَانًا عَظِیۡمًا ﴿۱۵۶﴾ۙ",
                    "وَّ قَوۡلِہِمۡ اِنَّا قَتَلۡنَا الۡمَسِیۡحَ عِیۡسَی ابۡنَ مَرۡیَمَ رَسُوۡلَ اللّٰہِ ۚ وَ مَا قَتَلُوۡہُ وَ مَا صَلَبُوۡہُ وَ لٰکِنۡ شُبِّہَ لَہُمۡ ؕ وَ  اِنَّ الَّذِیۡنَ اخۡتَلَفُوۡا فِیۡہِ لَفِیۡ شَکٍّ مِّنۡہُ ؕ مَا لَہُمۡ بِہٖ مِنۡ عِلۡمٍ  اِلَّا اتِّبَاعَ الظَّنِّ ۚ وَ مَا قَتَلُوۡہُ  یَقِیۡنًۢا ﴿۱۵۷﴾ۙ",
                    "بَلۡ رَّفَعَہُ اللّٰہُ اِلَیۡہِ ؕ وَ کَانَ اللّٰہُ عَزِیۡزًا حَکِیۡمًا ﴿۱۵۸﴾",
                    "وَ اِنۡ مِّنۡ اَہۡلِ الۡکِتٰبِ اِلَّا لَیُؤۡمِنَنَّ بِہٖ قَبۡلَ مَوۡتِہٖ ۚ وَ یَوۡمَ الۡقِیٰمَۃِ  یَکُوۡنُ عَلَیۡہِمۡ  شَہِیۡدًا ﴿۱۵۹﴾ۚ",
                    "فَبِظُلۡمٍ مِّنَ الَّذِیۡنَ ہَادُوۡا حَرَّمۡنَا عَلَیۡہِمۡ طَیِّبٰتٍ اُحِلَّتۡ لَہُمۡ وَ بِصَدِّہِمۡ عَنۡ سَبِیۡلِ اللّٰہِ  کَثِیۡرًا ﴿۱۶۰﴾ۙ",
                    "وَّ اَخۡذِہِمُ الرِّبٰوا وَ قَدۡ نُہُوۡا عَنۡہُ وَ اَکۡلِہِمۡ اَمۡوَالَ النَّاسِ بِالۡبَاطِلِ ؕ وَ اَعۡتَدۡنَا لِلۡکٰفِرِیۡنَ مِنۡہُمۡ عَذَابًا اَلِیۡمًا ﴿۱۶۱﴾",
                    "لٰکِنِ الرّٰسِخُوۡنَ فِی الۡعِلۡمِ مِنۡہُمۡ وَ الۡمُؤۡمِنُوۡنَ یُؤۡمِنُوۡنَ بِمَاۤ اُنۡزِلَ اِلَیۡکَ وَ مَاۤ اُنۡزِلَ مِنۡ قَبۡلِکَ وَ الۡمُقِیۡمِیۡنَ الصَّلٰوۃَ وَ الۡمُؤۡتُوۡنَ الزَّکٰوۃَ وَ الۡمُؤۡمِنُوۡنَ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ ؕ اُولٰٓئِکَ سَنُؤۡتِیۡہِمۡ اَجۡرًا عَظِیۡمًا ﴿۱۶۲﴾٪",
                    "اِنَّاۤ اَوۡحَیۡنَاۤ اِلَیۡکَ کَمَاۤ اَوۡحَیۡنَاۤ اِلٰی نُوۡحٍ وَّ النَّبِیّٖنَ مِنۡۢ بَعۡدِہٖ ۚ وَ اَوۡحَیۡنَاۤ اِلٰۤی اِبۡرٰہِیۡمَ وَ اِسۡمٰعِیۡلَ وَ اِسۡحٰقَ وَ یَعۡقُوۡبَ وَ الۡاَسۡبَاطِ وَ عِیۡسٰی وَ اَیُّوۡبَ وَ یُوۡنُسَ وَ ہٰرُوۡنَ وَ سُلَیۡمٰنَ ۚ وَ اٰتَیۡنَا دَاوٗدَ  زَبُوۡرًا ﴿۱۶۳﴾ۚ",
                    "وَ رُسُلًا قَدۡ قَصَصۡنٰہُمۡ عَلَیۡکَ مِنۡ قَبۡلُ وَ رُسُلًا لَّمۡ نَقۡصُصۡہُمۡ عَلَیۡکَ ؕ وَ کَلَّمَ اللّٰہُ مُوۡسٰی تَکۡلِیۡمًا ﴿۱۶۴﴾ۚ",
                    "رُسُلًا مُّبَشِّرِیۡنَ وَ مُنۡذِرِیۡنَ لِئَلَّا یَکُوۡنَ لِلنَّاسِ عَلَی اللّٰہِ حُجَّۃٌۢ بَعۡدَ الرُّسُلِ ؕ وَ کَانَ اللّٰہُ عَزِیۡزًا  حَکِیۡمًا ﴿۱۶۵﴾",
                    "لٰکِنِ اللّٰہُ یَشۡہَدُ بِمَاۤ اَنۡزَلَ اِلَیۡکَ اَنۡزَلَہٗ بِعِلۡمِہٖ ۚ وَ الۡمَلٰٓئِکَۃُ  یَشۡہَدُوۡنَ ؕ وَ کَفٰی بِاللّٰہِ  شَہِیۡدًا ﴿۱۶۶﴾ؕ",
                    "اِنَّ الَّذِیۡنَ کَفَرُوۡا وَ صَدُّوۡا عَنۡ سَبِیۡلِ اللّٰہِ  قَدۡ ضَلُّوۡا ضَلٰلًۢا  بَعِیۡدًا ﴿۱۶۷﴾",
                    "اِنَّ الَّذِیۡنَ کَفَرُوۡا وَ ظَلَمُوۡا لَمۡ  یَکُنِ اللّٰہُ لِیَغۡفِرَ لَہُمۡ  وَ لَا  لِیَہۡدِیَہُمۡ  طَرِیۡقًا ﴿۱۶۸﴾ۙ",
                    "اِلَّا طَرِیۡقَ جَہَنَّمَ خٰلِدِیۡنَ فِیۡہَاۤ  اَبَدًا ؕ وَ کَانَ ذٰلِکَ عَلَی اللّٰہِ  یَسِیۡرًا ﴿۱۶۹﴾",
                    "یٰۤاَیُّہَا النَّاسُ قَدۡ جَآءَکُمُ الرَّسُوۡلُ بِالۡحَقِّ مِنۡ رَّبِّکُمۡ فَاٰمِنُوۡا خَیۡرًا لَّکُمۡ ؕ وَ اِنۡ تَکۡفُرُوۡا فَاِنَّ لِلّٰہِ مَا فِی السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ وَ کَانَ اللّٰہُ عَلِیۡمًا حَکِیۡمًا ﴿۱۷۰﴾",
                    "یٰۤاَہۡلَ الۡکِتٰبِ لَا تَغۡلُوۡا فِیۡ دِیۡنِکُمۡ وَ لَا تَقُوۡلُوۡا عَلَی اللّٰہِ  اِلَّا الۡحَقَّ ؕ اِنَّمَا الۡمَسِیۡحُ عِیۡسَی ابۡنُ مَرۡیَمَ رَسُوۡلُ اللّٰہِ وَ کَلِمَتُہٗ ۚ اَلۡقٰہَاۤ اِلٰی مَرۡیَمَ وَ رُوۡحٌ مِّنۡہُ ۫ فَاٰمِنُوۡا بِاللّٰہِ وَ رُسُلِہٖ ۚ۟ وَ لَا تَقُوۡلُوۡا ثَلٰثَۃٌ ؕ اِنۡتَہُوۡا خَیۡرًا  لَّکُمۡ ؕ اِنَّمَا اللّٰہُ اِلٰہٌ وَّاحِدٌ ؕ سُبۡحٰنَہٗۤ اَنۡ یَّکُوۡنَ لَہٗ  وَلَدٌ ۘ لَہٗ  مَا  فِی السَّمٰوٰتِ وَ مَا  فِی  الۡاَرۡضِ ؕ وَ کَفٰی بِاللّٰہِ  وَکِیۡلًا ﴿۱۷۱﴾٪",
                    "لَنۡ یَّسۡتَنۡکِفَ الۡمَسِیۡحُ اَنۡ یَّکُوۡنَ عَبۡدًا لِّلّٰہِ وَ لَا الۡمَلٰٓئِکَۃُ الۡمُقَرَّبُوۡنَ ؕ وَ مَنۡ یَّسۡتَنۡکِفۡ عَنۡ عِبَادَتِہٖ وَ یَسۡتَکۡبِرۡ فَسَیَحۡشُرُہُمۡ  اِلَیۡہِ جَمِیۡعًا ﴿۱۷۲﴾",
                    "فَاَمَّا الَّذِیۡنَ اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ فَیُوَفِّیۡہِمۡ اُجُوۡرَہُمۡ وَ یَزِیۡدُہُمۡ مِّنۡ فَضۡلِہٖ ۚ وَ اَمَّا الَّذِیۡنَ اسۡتَنۡکَفُوۡا وَ اسۡتَکۡبَرُوۡا فَیُعَذِّبُہُمۡ  عَذَابًا اَلِیۡمًا ۬ۙ وَّ لَا یَجِدُوۡنَ لَہُمۡ مِّنۡ دُوۡنِ اللّٰہِ  وَلِیًّا وَّ لَا نَصِیۡرًا ﴿۱۷۳﴾",
                    "یٰۤاَیُّہَا النَّاسُ قَدۡ جَآءَکُمۡ  بُرۡہَانٌ مِّنۡ رَّبِّکُمۡ وَ اَنۡزَلۡنَاۤ اِلَیۡکُمۡ نُوۡرًا مُّبِیۡنًا ﴿۱۷۴﴾",
                    "فَاَمَّا الَّذِیۡنَ اٰمَنُوۡا بِاللّٰہِ وَ اعۡتَصَمُوۡا بِہٖ  فَسَیُدۡخِلُہُمۡ  فِیۡ  رَحۡمَۃٍ مِّنۡہُ وَ فَضۡلٍ ۙ وَّ یَہۡدِیۡہِمۡ  اِلَیۡہِ صِرَاطًا  مُّسۡتَقِیۡمًا ﴿۱۷۵﴾ؕ",
                    "یَسۡتَفۡتُوۡنَکَ ؕ قُلِ اللّٰہُ یُفۡتِیۡکُمۡ فِی الۡکَلٰلَۃِ ؕ اِنِ امۡرُؤٌا ہَلَکَ لَیۡسَ لَہٗ  وَلَدٌ وَّ لَہٗۤ اُخۡتٌ فَلَہَا نِصۡفُ مَا تَرَکَ ۚ وَ ہُوَ یَرِثُہَاۤ اِنۡ لَّمۡ یَکُنۡ لَّہَا وَلَدٌ ؕ فَاِنۡ کَانَتَا اثۡنَتَیۡنِ فَلَہُمَا الثُّلُثٰنِ مِمَّا تَرَکَ ؕ وَ  اِنۡ کَانُوۡۤا اِخۡوَۃً رِّجَالًا وَّ  نِسَآءً فَلِلذَّکَرِ مِثۡلُ حَظِّ الۡاُنۡثَیَیۡنِ ؕ یُبَیِّنُ اللّٰہُ  لَکُمۡ اَنۡ تَضِلُّوۡا ؕ وَ اللّٰہُ بِکُلِّ شَیۡءٍ عَلِیۡمٌ ﴿۱۷۶﴾٪"]
  
 }]
