[{"number":"006",
  "name":"الأنعام",
  "verse":[
                                  "بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ",
                    "اَلۡحَمۡدُ لِلّٰہِ الَّذِیۡ خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ وَ جَعَلَ الظُّلُمٰتِ وَ النُّوۡرَ ۬ؕ ثُمَّ  الَّذِیۡنَ  کَفَرُوۡا بِرَبِّہِمۡ  یَعۡدِلُوۡنَ  ﴿۱﴾",
                    "ہُوَ الَّذِیۡ خَلَقَکُمۡ مِّنۡ طِیۡنٍ ثُمَّ  قَضٰۤی اَجَلًا ؕ وَ اَجَلٌ مُّسَمًّی عِنۡدَہٗ  ثُمَّ  اَنۡتُمۡ تَمۡتَرُوۡنَ ﴿۲﴾",
                    "وَ ہُوَ اللّٰہُ فِی السَّمٰوٰتِ وَ فِی الۡاَرۡضِ ؕ یَعۡلَمُ سِرَّکُمۡ وَ جَہۡرَکُمۡ وَ یَعۡلَمُ مَا تَکۡسِبُوۡنَ ﴿۳﴾",
                    "وَ مَا تَاۡتِیۡہِمۡ مِّنۡ اٰیَۃٍ مِّنۡ اٰیٰتِ رَبِّہِمۡ  اِلَّا  کَانُوۡا عَنۡہَا مُعۡرِضِیۡنَ ﴿۴﴾",
                    "فَقَدۡ  کَذَّبُوۡا بِالۡحَقِّ  لَمَّا جَآءَہُمۡ ؕ فَسَوۡفَ یَاۡتِیۡہِمۡ اَنۡۢبٰٓؤُا مَا کَانُوۡا بِہٖ یَسۡتَہۡزِءُوۡنَ ﴿۵﴾",
                    "اَلَمۡ یَرَوۡا کَمۡ اَہۡلَکۡنَا مِنۡ قَبۡلِہِمۡ مِّنۡ قَرۡنٍ مَّکَّنّٰہُمۡ فِی الۡاَرۡضِ مَا لَمۡ نُمَکِّنۡ لَّکُمۡ وَ اَرۡسَلۡنَا السَّمَآءَ عَلَیۡہِمۡ مِّدۡرَارًا ۪ وَّ جَعَلۡنَا الۡاَنۡہٰرَ تَجۡرِیۡ مِنۡ تَحۡتِہِمۡ فَاَہۡلَکۡنٰہُمۡ بِذُنُوۡبِہِمۡ وَ اَنۡشَاۡنَا مِنۡۢ بَعۡدِہِمۡ  قَرۡنًا اٰخَرِیۡنَ ﴿۶﴾",
                    "وَ لَوۡ نَزَّلۡنَا عَلَیۡکَ کِتٰبًا فِیۡ قِرۡطَاسٍ فَلَمَسُوۡہُ بِاَیۡدِیۡہِمۡ لَقَالَ الَّذِیۡنَ  کَفَرُوۡۤا اِنۡ ہٰذَاۤ  اِلَّا  سِحۡرٌ  مُّبِیۡنٌ ﴿۷﴾",
                    "وَ قَالُوۡا لَوۡ لَاۤ اُنۡزِلَ عَلَیۡہِ مَلَکٌ ؕ وَ لَوۡ اَنۡزَلۡنَا مَلَکًا لَّقُضِیَ الۡاَمۡرُ ثُمَّ لَا یُنۡظَرُوۡنَ ﴿۸﴾",
                    "وَ لَوۡ جَعَلۡنٰہُ مَلَکًا لَّجَعَلۡنٰہُ رَجُلًا وَّ لَلَبَسۡنَا عَلَیۡہِمۡ  مَّا یَلۡبِسُوۡنَ ﴿۹﴾",
                    "وَ لَقَدِ اسۡتُہۡزِیٴَ بِرُسُلٍ مِّنۡ قَبۡلِکَ فَحَاقَ بِالَّذِیۡنَ سَخِرُوۡا مِنۡہُمۡ مَّا کَانُوۡا بِہٖ  یَسۡتَہۡزِءُوۡنَ ﴿٪۱۰﴾",
                    "قُلۡ سِیۡرُوۡا فِی الۡاَرۡضِ ثُمَّ انۡظُرُوۡا کَیۡفَ کَانَ عَاقِبَۃُ  الۡمُکَذِّبِیۡنَ ﴿۱۱﴾",
                    "قُلۡ لِّمَنۡ مَّا فِی السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ قُلۡ لِّلّٰہِ ؕ کَتَبَ عَلٰی نَفۡسِہِ الرَّحۡمَۃَ ؕ لَیَجۡمَعَنَّکُمۡ  اِلٰی یَوۡمِ الۡقِیٰمَۃِ  لَا  رَیۡبَ فِیۡہِ ؕ اَلَّذِیۡنَ خَسِرُوۡۤا اَنۡفُسَہُمۡ فَہُمۡ لَا یُؤۡمِنُوۡنَ ﴿۱۲﴾",
                    "وَ لَہٗ مَا سَکَنَ فِی الَّیۡلِ وَ النَّہَارِ ؕ وَ ہُوَ السَّمِیۡعُ  الۡعَلِیۡمُ ﴿۱۳﴾",
                    "قُلۡ اَغَیۡرَ اللّٰہِ اَتَّخِذُ وَلِیًّا  فَاطِرِ السَّمٰوٰتِ وَ الۡاَرۡضِ وَ ہُوَ یُطۡعِمُ وَ لَا یُطۡعَمُ ؕ قُلۡ  اِنِّیۡۤ   اُمِرۡتُ اَنۡ اَکُوۡنَ اَوَّلَ مَنۡ اَسۡلَمَ وَ لَا تَکُوۡنَنَّ مِنَ الۡمُشۡرِکِیۡنَ ﴿۱۴﴾",
                    "قُلۡ  اِنِّیۡۤ  اَخَافُ اِنۡ عَصَیۡتُ رَبِّیۡ عَذَابَ  یَوۡمٍ عَظِیۡمٍ ﴿۱۵﴾",
                    "مَنۡ  یُّصۡرَفۡ عَنۡہُ یَوۡمَئِذٍ فَقَدۡ رَحِمَہٗ ؕ وَ ذٰلِکَ  الۡفَوۡزُ  الۡمُبِیۡنُ ﴿۱۶﴾",
                    "وَ اِنۡ یَّمۡسَسۡکَ اللّٰہُ بِضُرٍّ فَلَا کَاشِفَ لَہٗۤ  اِلَّا ہُوَ ؕ وَ  اِنۡ یَّمۡسَسۡکَ بِخَیۡرٍ فَہُوَ  عَلٰی کُلِّ شَیۡءٍ  قَدِیۡرٌ ﴿۱۷﴾",
                    "وَ ہُوَ الۡقَاہِرُ فَوۡقَ عِبَادِہٖ ؕ وَ ہُوَ الۡحَکِیۡمُ  الۡخَبِیۡرُ ﴿۱۸﴾",
                    "قُلۡ اَیُّ شَیۡءٍ اَکۡبَرُ شَہَادَۃً ؕ قُلِ اللّٰہُ ۟ۙ شَہِیۡدٌۢ بَیۡنِیۡ وَ  بَیۡنَکُمۡ ۟ وَ اُوۡحِیَ   اِلَیَّ  ہٰذَا الۡقُرۡاٰنُ لِاُنۡذِرَکُمۡ بِہٖ وَ مَنۡۢ بَلَغَ ؕ اَئِنَّکُمۡ  لَتَشۡہَدُوۡنَ اَنَّ مَعَ  اللّٰہِ اٰلِہَۃً  اُخۡرٰی ؕ قُلۡ  لَّاۤ  اَشۡہَدُ ۚ قُلۡ  اِنَّمَا ہُوَ اِلٰہٌ وَّاحِدٌ وَّ اِنَّنِیۡ بَرِیۡٓءٌ مِّمَّا تُشۡرِکُوۡنَ ﴿ۘ۱۹﴾",
                    "اَلَّذِیۡنَ اٰتَیۡنٰہُمُ الۡکِتٰبَ یَعۡرِفُوۡنَہٗ کَمَا یَعۡرِفُوۡنَ اَبۡنَآءَہُمۡ ۘ اَلَّذِیۡنَ خَسِرُوۡۤا اَنۡفُسَہُمۡ  فَہُمۡ  لَا  یُؤۡمِنُوۡنَ ﴿٪۲۰﴾",
                    "وَ مَنۡ اَظۡلَمُ  مِمَّنِ افۡتَرٰی عَلَی اللّٰہِ  کَذِبًا اَوۡ  کَذَّبَ بِاٰیٰتِہٖ ؕ اِنَّہٗ لَا  یُفۡلِحُ  الظّٰلِمُوۡنَ ﴿۲۱﴾",
                    "وَ یَوۡمَ نَحۡشُرُہُمۡ جَمِیۡعًا ثُمَّ نَقُوۡلُ لِلَّذِیۡنَ اَشۡرَکُوۡۤا اَیۡنَ شُرَکَآؤُکُمُ الَّذِیۡنَ کُنۡتُمۡ  تَزۡعُمُوۡنَ ﴿۲۲﴾",
                    "ثُمَّ لَمۡ تَکُنۡ فِتۡنَتُہُمۡ  اِلَّاۤ  اَنۡ قَالُوۡا وَ اللّٰہِ  رَبِّنَا مَا کُنَّا مُشۡرِکِیۡنَ ﴿۲۳﴾",
                    "اُنۡظُرۡ  کَیۡفَ کَذَبُوۡا عَلٰۤی اَنۡفُسِہِمۡ  وَ ضَلَّ عَنۡہُمۡ  مَّا  کَانُوۡا یَفۡتَرُوۡنَ ﴿۲۴﴾",
                    "وَ  مِنۡہُمۡ مَّنۡ  یَّسۡتَمِعُ  اِلَیۡکَ ۚ وَ جَعَلۡنَا عَلٰی قُلُوۡبِہِمۡ  اَکِنَّۃً  اَنۡ یَّفۡقَہُوۡہُ  وَ فِیۡۤ  اٰذَانِہِمۡ  وَقۡرًا  ؕ وَ  اِنۡ  یَّرَوۡا کُلَّ  اٰیَۃٍ  لَّا یُؤۡمِنُوۡا بِہَا ؕ حَتّٰۤی  اِذَا جَآءُوۡکَ یُجَادِلُوۡنَکَ یَقُوۡلُ  الَّذِیۡنَ کَفَرُوۡۤا اِنۡ ہٰذَاۤ  اِلَّاۤ  اَسَاطِیۡرُ الۡاَوَّلِیۡنَ ﴿۲۵﴾",
                    "وَ ہُمۡ یَنۡہَوۡنَ عَنۡہُ  وَ یَنۡـَٔوۡنَ عَنۡہُ ۚ وَ اِنۡ یُّہۡلِکُوۡنَ  اِلَّاۤ  اَنۡفُسَہُمۡ وَ مَا یَشۡعُرُوۡنَ ﴿۲۶﴾",
                    "وَ لَوۡ تَرٰۤی  اِذۡ  وُقِفُوۡا عَلَی النَّارِ فَقَالُوۡا یٰلَیۡتَنَا نُرَدُّ  وَ لَا  نُکَذِّبَ بِاٰیٰتِ رَبِّنَا وَ نَکُوۡنَ  مِنَ  الۡمُؤۡمِنِیۡنَ ﴿۲۷﴾",
                    "بَلۡ بَدَا لَہُمۡ مَّا کَانُوۡا یُخۡفُوۡنَ مِنۡ  قَبۡلُ ؕ وَ لَوۡ رُدُّوۡا لَعَادُوۡا لِمَا نُہُوۡا عَنۡہُ وَ اِنَّہُمۡ  لَکٰذِبُوۡنَ ﴿۲۸﴾",
                    "وَ قَالُوۡۤا اِنۡ ہِیَ  اِلَّا حَیَاتُنَا الدُّنۡیَا وَ مَا نَحۡنُ بِمَبۡعُوۡثِیۡنَ ﴿۲۹﴾",
                    "وَ لَوۡ تَرٰۤی اِذۡ  وُقِفُوۡا عَلٰی رَبِّہِمۡ ؕ قَالَ اَلَیۡسَ ہٰذَا بِالۡحَقِّ ؕ قَالُوۡا بَلٰی وَ رَبِّنَا ؕ قَالَ فَذُوۡقُوا الۡعَذَابَ بِمَا کُنۡتُمۡ تَکۡفُرُوۡنَ ﴿٪۳۰﴾",
                    "قَدۡ خَسِرَ الَّذِیۡنَ کَذَّبُوۡا بِلِقَآءِ اللّٰہِ ؕ حَتّٰۤی  اِذَا جَآءَتۡہُمُ السَّاعَۃُ  بَغۡتَۃً  قَالُوۡا یٰحَسۡرَتَنَا عَلٰی مَا فَرَّطۡنَا فِیۡہَا ۙ وَ ہُمۡ یَحۡمِلُوۡنَ اَوۡزَارَہُمۡ عَلٰی ظُہُوۡرِہِمۡ ؕ اَلَا سَآءَ  مَا یَزِرُوۡنَ ﴿۳۱﴾",
                    "وَ مَا الۡحَیٰوۃُ  الدُّنۡیَاۤ  اِلَّا  لَعِبٌ وَّ لَہۡوٌ ؕ وَ  لَلدَّارُ الۡاٰخِرَۃُ  خَیۡرٌ  لِّلَّذِیۡنَ  یَتَّقُوۡنَ ؕ اَفَلَا  تَعۡقِلُوۡنَ ﴿۳۲﴾",
                    "قَدۡ نَعۡلَمُ  اِنَّہٗ  لَیَحۡزُنُکَ الَّذِیۡ یَقُوۡلُوۡنَ فَاِنَّہُمۡ لَا یُکَذِّبُوۡنَکَ وَ لٰکِنَّ الظّٰلِمِیۡنَ  بِاٰیٰتِ  اللّٰہِ  یَجۡحَدُوۡنَ ﴿۳۳﴾",
                    "وَ  لَقَدۡ  کُذِّبَتۡ رُسُلٌ مِّنۡ قَبۡلِکَ فَصَبَرُوۡا عَلٰی مَا کُذِّبُوۡا وَ اُوۡذُوۡا حَتّٰۤی اَتٰہُمۡ  نَصۡرُنَا ۚ وَ لَا مُبَدِّلَ  لِکَلِمٰتِ اللّٰہِ ۚ وَ لَقَدۡ جَآءَکَ مِنۡ نَّبَاِی الۡمُرۡسَلِیۡنَ ﴿۳۴﴾",
                    "وَ اِنۡ کَانَ  کَبُرَ عَلَیۡکَ اِعۡرَاضُہُمۡ فَاِنِ اسۡتَطَعۡتَ اَنۡ تَبۡتَغِیَ نَفَقًا فِی الۡاَرۡضِ اَوۡ  سُلَّمًا فِی السَّمَآءِ  فَتَاۡتِیَہُمۡ  بِاٰیَۃٍ ؕ وَ لَوۡ شَآءَ اللّٰہُ  لَجَمَعَہُمۡ عَلَی الۡہُدٰی فَلَا تَکُوۡنَنَّ مِنَ  الۡجٰہِلِیۡنَ ﴿۳۵﴾",
                    "اِنَّمَا یَسۡتَجِیۡبُ الَّذِیۡنَ یَسۡمَعُوۡنَ  ؕؔ وَ الۡمَوۡتٰی یَبۡعَثُہُمُ اللّٰہُ  ثُمَّ  اِلَیۡہِ یُرۡجَعُوۡنَ ﴿؃ ۳۶﴾",
                    "وَ قَالُوۡا لَوۡ لَا نُزِّلَ عَلَیۡہِ  اٰیَۃٌ  مِّنۡ رَّبِّہٖ ؕ قُلۡ  اِنَّ اللّٰہَ  قَادِرٌ عَلٰۤی  اَنۡ یُّنَزِّلَ  اٰیَۃً  وَّ لٰکِنَّ  اَکۡثَرَ ہُمۡ  لَا  یَعۡلَمُوۡنَ ﴿۳۷﴾",
                    "وَ مَا مِنۡ  دَآبَّۃٍ  فِی الۡاَرۡضِ وَ لَا طٰٓئِرٍ یَّطِیۡرُ  بِجَنَاحَیۡہِ  اِلَّاۤ  اُمَمٌ  اَمۡثَالُکُمۡ ؕ مَا فَرَّطۡنَا فِی الۡکِتٰبِ مِنۡ شَیۡءٍ  ثُمَّ   اِلٰی رَبِّہِمۡ  یُحۡشَرُوۡنَ ﴿۳۸﴾",
                    "وَ الَّذِیۡنَ کَذَّبُوۡا بِاٰیٰتِنَا صُمٌّ  وَّ بُکۡمٌ  فِی الظُّلُمٰتِ ؕ مَنۡ  یَّشَاِ اللّٰہُ  یُضۡلِلۡہُ ؕ وَ مَنۡ یَّشَاۡ  یَجۡعَلۡہُ  عَلٰی  صِرَاطٍ مُّسۡتَقِیۡمٍ ﴿۳۹﴾",
                    "قُلۡ  اَرَءَیۡتَکُمۡ   اِنۡ  اَتٰٮکُمۡ عَذَابُ اللّٰہِ اَوۡ اَتَتۡکُمُ السَّاعَۃُ  اَغَیۡرَ اللّٰہِ تَدۡعُوۡنَ ۚ اِنۡ  کُنۡتُمۡ  صٰدِقِیۡنَ ﴿۴۰﴾",
                    "بَلۡ اِیَّاہُ  تَدۡعُوۡنَ فَیَکۡشِفُ مَا تَدۡعُوۡنَ اِلَیۡہِ  اِنۡ شَآءَ وَ تَنۡسَوۡنَ مَا تُشۡرِکُوۡنَ ﴿٪۴۱﴾",
                    "وَ لَقَدۡ اَرۡسَلۡنَاۤ  اِلٰۤی  اُمَمٍ مِّنۡ قَبۡلِکَ فَاَخَذۡنٰہُمۡ بِالۡبَاۡسَآءِ وَ الضَّرَّآءِ لَعَلَّہُمۡ یَتَضَرَّعُوۡنَ ﴿۴۲﴾",
                    "فَلَوۡلَاۤ  اِذۡ جَآءَہُمۡ بَاۡسُنَا تَضَرَّعُوۡا وَ لٰکِنۡ  قَسَتۡ قُلُوۡبُہُمۡ وَ زَیَّنَ لَہُمُ الشَّیۡطٰنُ  مَا  کَانُوۡا  یَعۡمَلُوۡنَ ﴿۴۳﴾",
                    "فَلَمَّا نَسُوۡا مَا  ذُکِّرُوۡا بِہٖ  فَتَحۡنَا عَلَیۡہِمۡ  اَبۡوَابَ کُلِّ شَیۡءٍ ؕ حَتّٰۤی  اِذَا فَرِحُوۡا بِمَاۤ  اُوۡتُوۡۤا اَخَذۡنٰہُمۡ بَغۡتَۃً  فَاِذَا ہُمۡ مُّبۡلِسُوۡنَ ﴿۴۴﴾",
                    "فَقُطِعَ   دَابِرُ الۡقَوۡمِ الَّذِیۡنَ ظَلَمُوۡا ؕ وَ الۡحَمۡدُ  لِلّٰہِ  رَبِّ الۡعٰلَمِیۡنَ ﴿۴۵﴾",
                    "قُلۡ  اَرَءَیۡتُمۡ  اِنۡ  اَخَذَ اللّٰہُ سَمۡعَکُمۡ وَ اَبۡصَارَکُمۡ  وَ خَتَمَ عَلٰی قُلُوۡبِکُمۡ مَّنۡ  اِلٰہٌ  غَیۡرُ  اللّٰہِ  یَاۡتِیۡکُمۡ  بِہٖ ؕ اُنۡظُرۡ  کَیۡفَ نُصَرِّفُ الۡاٰیٰتِ ثُمَّ ہُمۡ یَصۡدِفُوۡنَ ﴿۴۶﴾",
                    "قُلۡ  اَرَءَیۡتَکُمۡ   اِنۡ  اَتٰٮکُمۡ عَذَابُ اللّٰہِ بَغۡتَۃً  اَوۡ جَہۡرَۃً  ہَلۡ یُہۡلَکُ  اِلَّا الۡقَوۡمُ  الظّٰلِمُوۡنَ ﴿۴۷﴾",
                    "وَ مَا نُرۡسِلُ الۡمُرۡسَلِیۡنَ  اِلَّا مُبَشِّرِیۡنَ وَ مُنۡذِرِیۡنَ ۚ فَمَنۡ اٰمَنَ وَ اَصۡلَحَ فَلَا خَوۡفٌ عَلَیۡہِمۡ  وَ لَا  ہُمۡ  یَحۡزَنُوۡنَ ﴿۴۸﴾",
                    "وَ الَّذِیۡنَ کَذَّبُوۡا بِاٰیٰتِنَا یَمَسُّہُمُ الۡعَذَابُ بِمَا  کَانُوۡا یَفۡسُقُوۡنَ ﴿۴۹﴾",
                    "قُلۡ  لَّاۤ  اَقُوۡلُ لَکُمۡ عِنۡدِیۡ خَزَآئِنُ اللّٰہِ وَ لَاۤ  اَعۡلَمُ الۡغَیۡبَ وَ لَاۤ  اَقُوۡلُ لَکُمۡ  اِنِّیۡ مَلَکٌ ۚ اِنۡ  اَتَّبِعُ  اِلَّا مَا یُوۡحٰۤی  اِلَیَّ ؕ قُلۡ ہَلۡ  یَسۡتَوِی الۡاَعۡمٰی وَ الۡبَصِیۡرُ ؕ اَفَلَا  تَتَفَکَّرُوۡنَ ﴿٪۵۰﴾",
                    "وَ اَنۡذِرۡ بِہِ الَّذِیۡنَ یَخَافُوۡنَ  اَنۡ یُّحۡشَرُوۡۤا  اِلٰی رَبِّہِمۡ لَیۡسَ لَہُمۡ مِّنۡ دُوۡنِہٖ وَلِیٌّ  وَّ لَا شَفِیۡعٌ  لَّعَلَّہُمۡ  یَتَّقُوۡنَ ﴿۵۱﴾",
                    "وَ لَا تَطۡرُدِ الَّذِیۡنَ یَدۡعُوۡنَ رَبَّہُمۡ بِالۡغَدٰوۃِ  وَ الۡعَشِیِّ  یُرِیۡدُوۡنَ وَجۡہَہٗ ؕ مَا عَلَیۡکَ مِنۡ  حِسَابِہِمۡ  مِّنۡ شَیۡءٍ  وَّ مَا مِنۡ حِسَابِکَ عَلَیۡہِمۡ  مِّنۡ  شَیۡءٍ فَتَطۡرُدَہُمۡ  فَتَکُوۡنَ  مِنَ الظّٰلِمِیۡنَ ﴿۵۲﴾",
                    "وَ کَذٰلِکَ فَتَنَّا بَعۡضَہُمۡ بِبَعۡضٍ لِّیَقُوۡلُوۡۤا اَہٰۤؤُلَآءِ مَنَّ اللّٰہُ عَلَیۡہِمۡ مِّنۡۢ بَیۡنِنَا ؕ اَلَیۡسَ اللّٰہُ  بِاَعۡلَمَ بِالشّٰکِرِیۡنَ ﴿۵۳﴾",
                    "وَ  اِذَا جَآءَکَ الَّذِیۡنَ یُؤۡمِنُوۡنَ بِاٰیٰتِنَا فَقُلۡ سَلٰمٌ عَلَیۡکُمۡ  کَتَبَ رَبُّکُمۡ عَلٰی نَفۡسِہِ  الرَّحۡمَۃَ ۙ اَنَّہٗ  مَنۡ  عَمِلَ  مِنۡکُمۡ سُوۡٓءًۢ ابِجَہَالَۃٍ  ثُمَّ تَابَ مِنۡۢ  بَعۡدِہٖ  وَ  اَصۡلَحَ  فَاَنَّہٗ  غَفُوۡرٌ  رَّحِیۡمٌ ﴿۵۴﴾",
                    "وَ کَذٰلِکَ نُفَصِّلُ الۡاٰیٰتِ وَ لِتَسۡتَبِیۡنَ سَبِیۡلُ  الۡمُجۡرِمِیۡنَ ﴿٪۵۵﴾",
                    "قُلۡ  اِنِّیۡ نُہِیۡتُ اَنۡ اَعۡبُدَ الَّذِیۡنَ تَدۡعُوۡنَ مِنۡ دُوۡنِ اللّٰہِ ؕ قُلۡ  لَّاۤ  اَتَّبِعُ  اَہۡوَآءَکُمۡ ۙ  قَدۡ ضَلَلۡتُ اِذًا وَّ مَاۤ  اَنَا مِنَ  الۡمُہۡتَدِیۡنَ ﴿۵۶﴾",
                    "قُلۡ  اِنِّیۡ عَلٰی بَیِّنَۃٍ  مِّنۡ رَّبِّیۡ وَ  کَذَّبۡتُمۡ  بِہٖ ؕ مَا عِنۡدِیۡ مَا تَسۡتَعۡجِلُوۡنَ بِہٖ ؕ اِنِ الۡحُکۡمُ  اِلَّا لِلّٰہِ ؕ یَقُصُّ الۡحَقَّ وَ ہُوَ  خَیۡرُ الۡفٰصِلِیۡنَ ﴿۵۷﴾",
                    "قُلۡ لَّوۡ اَنَّ عِنۡدِیۡ مَا تَسۡتَعۡجِلُوۡنَ بِہٖ لَقُضِیَ الۡاَمۡرُ بَیۡنِیۡ وَ بَیۡنَکُمۡ ؕ وَ اللّٰہُ اَعۡلَمُ  بِالظّٰلِمِیۡنَ ﴿۵۸﴾",
                    "وَ عِنۡدَہٗ مَفَاتِحُ الۡغَیۡبِ لَا  یَعۡلَمُہَاۤ  اِلَّا ہُوَ ؕ وَ یَعۡلَمُ مَا فِی الۡبَرِّ  وَ الۡبَحۡرِ ؕ وَ مَا تَسۡقُطُ مِنۡ وَّرَقَۃٍ  اِلَّا یَعۡلَمُہَا وَ لَا حَبَّۃٍ  فِیۡ ظُلُمٰتِ الۡاَرۡضِ وَ لَا رَطۡبٍ وَّ لَا یَابِسٍ  اِلَّا فِیۡ  کِتٰبٍ مُّبِیۡنٍ ﴿۵۹﴾",
                    "وَ ہُوَ الَّذِیۡ یَتَوَفّٰٮکُمۡ بِالَّیۡلِ وَ یَعۡلَمُ مَا جَرَحۡتُمۡ بِالنَّہَارِ ثُمَّ یَبۡعَثُکُمۡ فِیۡہِ لِیُقۡضٰۤی  اَجَلٌ مُّسَمًّی ۚ ثُمَّ  اِلَیۡہِ مَرۡجِعُکُمۡ  ثُمَّ یُنَبِّئُکُمۡ بِمَا کُنۡتُمۡ تَعۡمَلُوۡنَ ﴿٪۶۰﴾",
                    "وَ ہُوَ الۡقَاہِرُ فَوۡقَ عِبَادِہٖ وَ یُرۡسِلُ عَلَیۡکُمۡ حَفَظَۃً ؕ حَتّٰۤی  اِذَا جَآءَ  اَحَدَکُمُ  الۡمَوۡتُ  تَوَفَّتۡہُ  رُسُلُنَا وَ ہُمۡ لَا  یُفَرِّطُوۡنَ ﴿۶۱﴾",
                    "ثُمَّ  رُدُّوۡۤا  اِلَی اللّٰہِ مَوۡلٰٮہُمُ  الۡحَقِّ ؕ اَلَا لَہُ  الۡحُکۡمُ ۟ وَ ہُوَ  اَسۡرَعُ  الۡحٰسِبِیۡنَ ﴿۶۲﴾",
                    "قُلۡ مَنۡ یُّنَجِّیۡکُمۡ مِّنۡ ظُلُمٰتِ الۡبَرِّ وَ الۡبَحۡرِ تَدۡعُوۡنَہٗ  تَضَرُّعًا وَّ  خُفۡیَۃً ۚ لَئِنۡ اَنۡجٰٮنَا مِنۡ ہٰذِہٖ  لَنَکُوۡنَنَّ مِنَ الشّٰکِرِیۡنَ ﴿۶۳﴾",
                    "قُلِ اللّٰہُ یُنَجِّیۡکُمۡ مِّنۡہَا وَ مِنۡ کُلِّ کَرۡبٍ ثُمَّ  اَنۡتُمۡ  تُشۡرِکُوۡنَ ﴿۶۴﴾",
                    "قُلۡ ہُوَ  الۡقَادِرُ عَلٰۤی  اَنۡ یَّبۡعَثَ عَلَیۡکُمۡ عَذَابًا مِّنۡ فَوۡقِکُمۡ اَوۡ مِنۡ تَحۡتِ اَرۡجُلِکُمۡ اَوۡ یَلۡبِسَکُمۡ شِیَعًا وَّ یُذِیۡقَ بَعۡضَکُمۡ بَاۡسَ بَعۡضٍ ؕ اُنۡظُرۡ کَیۡفَ نُصَرِّفُ الۡاٰیٰتِ لَعَلَّہُمۡ یَفۡقَہُوۡنَ ﴿۶۵﴾",
                    "وَ کَذَّبَ بِہٖ قَوۡمُکَ وَ ہُوَ الۡحَقُّ ؕ قُلۡ لَّسۡتُ عَلَیۡکُمۡ  بِوَکِیۡلٍ ﴿ؕ۶۶﴾",
                    "لِکُلِّ نَبَاٍ  مُّسۡتَقَرٌّ ۫ وَّ سَوۡفَ تَعۡلَمُوۡنَ ﴿۶۷﴾",
                    "وَ اِذَا  رَاَیۡتَ الَّذِیۡنَ  یَخُوۡضُوۡنَ فِیۡۤ  اٰیٰتِنَا فَاَعۡرِضۡ عَنۡہُمۡ حَتّٰی یَخُوۡضُوۡا فِیۡ حَدِیۡثٍ غَیۡرِہٖ ؕ وَ اِمَّا یُنۡسِیَنَّکَ الشَّیۡطٰنُ  فَلَا تَقۡعُدۡ بَعۡدَ  الذِّکۡرٰی  مَعَ الۡقَوۡمِ  الظّٰلِمِیۡنَ ﴿۶۸﴾",
                    "وَ  مَا عَلَی الَّذِیۡنَ یَتَّقُوۡنَ مِنۡ حِسَابِہِمۡ مِّنۡ شَیۡءٍ وَّ لٰکِنۡ ذِکۡرٰی لَعَلَّہُمۡ یَتَّقُوۡنَ ﴿۶۹﴾",
                    "وَ ذَرِ الَّذِیۡنَ اتَّخَذُوۡا دِیۡنَہُمۡ لَعِبًا وَّ لَہۡوًا وَّ غَرَّتۡہُمُ الۡحَیٰوۃُ  الدُّنۡیَا وَ ذَکِّرۡ بِہٖۤ  اَنۡ تُبۡسَلَ نَفۡسٌۢ بِمَا کَسَبَتۡ ٭ۖ  لَیۡسَ لَہَا مِنۡ  دُوۡنِ اللّٰہِ وَلِیٌّ  وَّ لَا شَفِیۡعٌ ۚ وَ اِنۡ تَعۡدِلۡ کُلَّ عَدۡلٍ لَّا یُؤۡخَذۡ مِنۡہَا ؕ اُولٰٓئِکَ  الَّذِیۡنَ  اُبۡسِلُوۡا بِمَا کَسَبُوۡا ۚ لَہُمۡ شَرَابٌ مِّنۡ حَمِیۡمٍ  وَّ عَذَابٌ اَلِیۡمٌۢ بِمَا کَانُوۡا یَکۡفُرُوۡنَ ﴿٪۷۰﴾",
                    "قُلۡ  اَنَدۡعُوۡا  مِنۡ دُوۡنِ اللّٰہِ مَا لَا یَنۡفَعُنَا وَ لَا یَضُرُّنَا وَ نُرَدُّ عَلٰۤی اَعۡقَابِنَا بَعۡدَ اِذۡ ہَدٰٮنَا اللّٰہُ کَالَّذِی اسۡتَہۡوَتۡہُ الشَّیٰطِیۡنُ فِی الۡاَرۡضِ حَیۡرَانَ ۪ لَہٗۤ  اَصۡحٰبٌ یَّدۡعُوۡنَہٗۤ  اِلَی الۡہُدَی ائۡتِنَا ؕ قُلۡ  اِنَّ ہُدَی اللّٰہِ ہُوَ الۡہُدٰی ؕ وَ اُمِرۡنَا لِنُسۡلِمَ لِرَبِّ الۡعٰلَمِیۡنَ ﴿ۙ۷۱﴾",
                    "وَ اَنۡ  اَقِیۡمُوا الصَّلٰوۃَ وَ اتَّقُوۡہُ ؕ وَ ہُوَ الَّذِیۡۤ  اِلَیۡہِ تُحۡشَرُوۡنَ ﴿۷۲﴾",
                    "وَ ہُوَ الَّذِیۡ خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ بِالۡحَقِّ ؕ وَ یَوۡمَ یَقُوۡلُ  کُنۡ فَیَکُوۡنُ ۬ؕ قَوۡلُہُ  الۡحَقُّ ؕ وَ لَہُ  الۡمُلۡکُ یَوۡمَ  یُنۡفَخُ فِی الصُّوۡرِ ؕ عٰلِمُ  الۡغَیۡبِ وَ الشَّہَادَۃِ ؕ وَ ہُوَ الۡحَکِیۡمُ  الۡخَبِیۡرُ ﴿۷۳﴾",
                    "وَ اِذۡ  قَالَ  اِبۡرٰہِیۡمُ لِاَبِیۡہِ  اٰزَرَ اَتَتَّخِذُ  اَصۡنَامًا  اٰلِہَۃً ۚ اِنِّیۡۤ   اَرٰٮکَ وَ قَوۡمَکَ فِیۡ ضَلٰلٍ مُّبِیۡنٍ ﴿۷۴﴾",
                    "وَ کَذٰلِکَ نُرِیۡۤ  اِبۡرٰہِیۡمَ مَلَکُوۡتَ السَّمٰوٰتِ وَ الۡاَرۡضِ وَ لِیَکُوۡنَ مِنَ الۡمُوۡقِنِیۡنَ ﴿۷۵﴾",
                    "فَلَمَّا جَنَّ عَلَیۡہِ الَّیۡلُ  رَاٰ کَوۡکَبًا ۚ قَالَ ہٰذَا  رَبِّیۡ ۚ فَلَمَّاۤ  اَفَلَ  قَالَ لَاۤ  اُحِبُّ  الۡاٰفِلِیۡنَ ﴿۷۶﴾",
                    "فَلَمَّا رَاَ  الۡقَمَرَ بَازِغًا  قَالَ ہٰذَا رَبِّیۡ ۚ فَلَمَّاۤ  اَفَلَ قَالَ  لَئِنۡ  لَّمۡ  یَہۡدِنِیۡ رَبِّیۡ لَاَکُوۡنَنَّ مِنَ  الۡقَوۡمِ  الضَّآلِّیۡنَ ﴿۷۷﴾",
                    "فَلَمَّا رَاَ الشَّمۡسَ بَازِغَۃً  قَالَ ہٰذَا رَبِّیۡ ہٰذَاۤ  اَکۡبَرُ ۚ فَلَمَّاۤ  اَفَلَتۡ قَالَ یٰقَوۡمِ  اِنِّیۡ بَرِیۡٓءٌ  مِّمَّا تُشۡرِکُوۡنَ ﴿۷۸﴾",
                    "اِنِّیۡ وَجَّہۡتُ وَجۡہِیَ لِلَّذِیۡ فَطَرَ السَّمٰوٰتِ وَ الۡاَرۡضَ حَنِیۡفًا وَّ مَاۤ  اَنَا مِنَ  الۡمُشۡرِکِیۡنَ ﴿ۚ۷۹﴾",
                    "وَ حَآجَّہٗ  قَوۡمُہٗ ؕ قَالَ  اَتُحَآجُّوۡٓنِّیۡ  فِی اللّٰہِ وَ قَدۡ ہَدٰٮنِ ؕ وَ لَاۤ  اَخَافُ مَا تُشۡرِکُوۡنَ بِہٖۤ  اِلَّاۤ  اَنۡ یَّشَآءَ رَبِّیۡ شَیۡئًا ؕ وَسِعَ رَبِّیۡ کُلَّ شَیۡءٍ عِلۡمًا ؕ اَفَلَا تَتَذَکَّرُوۡنَ ﴿۸۰﴾",
                    "وَ کَیۡفَ اَخَافُ مَاۤ  اَشۡرَکۡتُمۡ وَ لَا  تَخَافُوۡنَ  اَنَّکُمۡ  اَشۡرَکۡتُمۡ بِاللّٰہِ مَا لَمۡ یُنَزِّلۡ بِہٖ عَلَیۡکُمۡ سُلۡطٰنًا ؕ فَاَیُّ الۡفَرِیۡقَیۡنِ  اَحَقُّ  بِالۡاَمۡنِ ۚ اِنۡ  کُنۡتُمۡ  تَعۡلَمُوۡنَ ﴿ۘ۸۱﴾",
                    "اَلَّذِیۡنَ اٰمَنُوۡا وَ لَمۡ یَلۡبِسُوۡۤا اِیۡمَانَہُمۡ بِظُلۡمٍ  اُولٰٓئِکَ لَہُمُ الۡاَمۡنُ وَ ہُمۡ مُّہۡتَدُوۡنَ ﴿٪۸۲﴾",
                    "وَ تِلۡکَ حُجَّتُنَاۤ  اٰتَیۡنٰہَاۤ  اِبۡرٰہِیۡمَ عَلٰی قَوۡمِہٖ ؕ نَرۡفَعُ دَرَجٰتٍ مَّنۡ نَّشَآءُ ؕ اِنَّ رَبَّکَ حَکِیۡمٌ  عَلِیۡمٌ ﴿۸۳﴾",
                    "وَ وَہَبۡنَا لَہٗۤ  اِسۡحٰقَ وَ یَعۡقُوۡبَ ؕ کُلًّا ہَدَیۡنَا ۚ وَ نُوۡحًا ہَدَیۡنَا مِنۡ قَبۡلُ وَ مِنۡ ذُرِّیَّتِہٖ دَاوٗدَ  وَ سُلَیۡمٰنَ وَ اَیُّوۡبَ وَ یُوۡسُفَ وَ مُوۡسٰی وَ ہٰرُوۡنَ ؕ وَ کَذٰلِکَ نَجۡزِی الۡمُحۡسِنِیۡنَ ﴿ۙ۸۴﴾",
                    "وَ زَکَرِیَّا وَ یَحۡیٰی وَ عِیۡسٰی وَ اِلۡیَاسَ ؕ کُلٌّ  مِّنَ الصّٰلِحِیۡنَ ﴿ۙ۸۵﴾",
                    "وَ اِسۡمٰعِیۡلَ وَ الۡیَسَعَ وَ یُوۡنُسَ وَ لُوۡطًا ؕ وَ کُلًّا فَضَّلۡنَا عَلَی  الۡعٰلَمِیۡنَ ﴿ۙ۸۶﴾",
                    "وَ مِنۡ اٰبَآئِہِمۡ وَ ذُرِّیّٰتِہِمۡ وَ  اِخۡوَانِہِمۡ ۚ وَ اجۡتَبَیۡنٰہُمۡ وَ ہَدَیۡنٰہُمۡ  اِلٰی صِرَاطٍ مُّسۡتَقِیۡمٍ ﴿۸۷﴾",
                    "ذٰلِکَ ہُدَی اللّٰہِ یَہۡدِیۡ بِہٖ مَنۡ یَّشَآءُ مِنۡ عِبَادِہٖ ؕ وَ لَوۡ اَشۡرَکُوۡا لَحَبِطَ عَنۡہُمۡ  مَّا  کَانُوۡا  یَعۡمَلُوۡنَ ﴿۸۸﴾",
                    "اُولٰٓئِکَ الَّذِیۡنَ اٰتَیۡنٰہُمُ الۡکِتٰبَ وَ الۡحُکۡمَ وَ النُّبُوَّۃَ ۚ فَاِنۡ یَّکۡفُرۡ بِہَا ہٰۤؤُلَآءِ  فَقَدۡ وَکَّلۡنَا بِہَا قَوۡمًا لَّیۡسُوۡا بِہَا بِکٰفِرِیۡنَ ﴿۸۹﴾",
                    "اُولٰٓئِکَ الَّذِیۡنَ ہَدَی اللّٰہُ  فَبِہُدٰٮہُمُ اقۡتَدِہۡ ؕ قُلۡ  لَّاۤ  اَسۡـَٔلُکُمۡ عَلَیۡہِ  اَجۡرًا ؕ اِنۡ  ہُوَ   اِلَّا  ذِکۡرٰی لِلۡعٰلَمِیۡنَ ﴿٪۹۰﴾",
                    "وَ مَا  قَدَرُوا اللّٰہَ حَقَّ قَدۡرِہٖۤ  اِذۡ قَالُوۡا مَاۤ اَنۡزَلَ اللّٰہُ  عَلٰی بَشَرٍ مِّنۡ  شَیۡءٍ ؕ قُلۡ مَنۡ اَنۡزَلَ  الۡکِتٰبَ الَّذِیۡ جَآءَ بِہٖ مُوۡسٰی نُوۡرًا وَّ  ہُدًی لِّلنَّاسِ تَجۡعَلُوۡنَہٗ قَرَاطِیۡسَ تُبۡدُوۡنَہَا وَ تُخۡفُوۡنَ  کَثِیۡرًا ۚ وَ  عُلِّمۡتُمۡ  مَّا لَمۡ تَعۡلَمُوۡۤا  اَنۡتُمۡ وَ لَاۤ  اٰبَآؤُکُمۡ ؕ قُلِ  اللّٰہُ ۙ ثُمَّ  ذَرۡہُمۡ  فِیۡ  خَوۡضِہِمۡ  یَلۡعَبُوۡنَ  ﴿۹۱﴾",
                    "وَ ہٰذَا کِتٰبٌ اَنۡزَلۡنٰہُ  مُبٰرَکٌ مُّصَدِّقُ الَّذِیۡ  بَیۡنَ  یَدَیۡہِ  وَ لِتُنۡذِرَ اُمَّ الۡقُرٰی وَ مَنۡ حَوۡلَہَا ؕ وَ الَّذِیۡنَ یُؤۡمِنُوۡنَ بِالۡاٰخِرَۃِ  یُؤۡمِنُوۡنَ بِہٖ وَ ہُمۡ عَلٰی صَلَاتِہِمۡ  یُحَافِظُوۡنَ ﴿۹۲﴾",
                    "وَ مَنۡ اَظۡلَمُ مِمَّنِ افۡتَرٰی عَلَی اللّٰہِ  کَذِبًا اَوۡ قَالَ اُوۡحِیَ  اِلَیَّ  وَ لَمۡ  یُوۡحَ  اِلَیۡہِ شَیۡءٌ وَّ  مَنۡ قَالَ سَاُنۡزِلُ مِثۡلَ مَاۤ  اَنۡزَلَ اللّٰہُ ؕ وَ لَوۡ تَرٰۤی  اِذِ الظّٰلِمُوۡنَ فِیۡ غَمَرٰتِ الۡمَوۡتِ وَ الۡمَلٰٓئِکَۃُ بَاسِطُوۡۤا  اَیۡدِیۡہِمۡ ۚ اَخۡرِجُوۡۤا اَنۡفُسَکُمۡ ؕ اَلۡیَوۡمَ تُجۡزَوۡنَ عَذَابَ الۡہُوۡنِ بِمَا کُنۡتُمۡ تَقُوۡلُوۡنَ عَلَی اللّٰہِ غَیۡرَ الۡحَقِّ وَ کُنۡتُمۡ عَنۡ اٰیٰتِہٖ تَسۡتَکۡبِرُوۡنَ  ﴿۹۳﴾",
                    "وَ لَقَدۡ جِئۡتُمُوۡنَا فُرَادٰی کَمَا خَلَقۡنٰکُمۡ  اَوَّلَ مَرَّۃٍ  وَّ تَرَکۡتُمۡ مَّا خَوَّلۡنٰکُمۡ  وَرَآءَ  ظُہُوۡرِکُمۡ ۚ وَ مَا نَرٰی مَعَکُمۡ شُفَعَآءَکُمُ  الَّذِیۡنَ زَعَمۡتُمۡ  اَنَّہُمۡ فِیۡکُمۡ شُرَکٰٓؤُا ؕ  لَقَدۡ تَّقَطَّعَ بَیۡنَکُمۡ  وَ ضَلَّ عَنۡکُمۡ  مَّا کُنۡتُمۡ تَزۡعُمُوۡنَ ﴿٪۹۴﴾",
                    "اِنَّ  اللّٰہَ  فَالِقُ الۡحَبِّ وَ النَّوٰی ؕ یُخۡرِجُ الۡحَیَّ مِنَ الۡمَیِّتِ وَ مُخۡرِجُ الۡمَیِّتِ مِنَ الۡحَیِّ ؕ ذٰلِکُمُ اللّٰہُ  فَاَنّٰی تُؤۡفَکُوۡنَ ﴿۹۵﴾",
                    "فَالِقُ الۡاِصۡبَاحِ ۚ وَ  جَعَلَ الَّیۡلَ سَکَنًا وَّ الشَّمۡسَ وَ الۡقَمَرَ حُسۡبَانًا ؕ ذٰلِکَ تَقۡدِیۡرُ الۡعَزِیۡزِ  الۡعَلِیۡمِ ﴿۹۶﴾",
                    "وَ ہُوَ الَّذِیۡ جَعَلَ لَکُمُ النُّجُوۡمَ لِتَہۡتَدُوۡا بِہَا فِیۡ  ظُلُمٰتِ الۡبَرِّ  وَ الۡبَحۡرِ ؕ قَدۡ فَصَّلۡنَا الۡاٰیٰتِ لِقَوۡمٍ یَّعۡلَمُوۡنَ ﴿۹۷﴾",
                    "وَ ہُوَ الَّذِیۡۤ  اَنۡشَاَکُمۡ مِّنۡ نَّفۡسٍ وَّاحِدَۃٍ  فَمُسۡتَقَرٌّ وَّ مُسۡتَوۡدَعٌ ؕ قَدۡ فَصَّلۡنَا الۡاٰیٰتِ لِقَوۡمٍ  یَّفۡقَہُوۡنَ ﴿۹۸﴾",
                    "وَ ہُوَ الَّذِیۡۤ  اَنۡزَلَ مِنَ السَّمَآءِ مَآءً ۚ فَاَخۡرَجۡنَا بِہٖ  نَبَاتَ کُلِّ شَیۡءٍ فَاَخۡرَجۡنَا مِنۡہُ خَضِرًا نُّخۡرِجُ مِنۡہُ حَبًّا مُّتَرَاکِبًا ۚ وَ مِنَ النَّخۡلِ مِنۡ طَلۡعِہَا قِنۡوَانٌ دَانِیَۃٌ  وَّ جَنّٰتٍ مِّنۡ اَعۡنَابٍ وَّ الزَّیۡتُوۡنَ  وَ الرُّمَّانَ  مُشۡتَبِہًا وَّ غَیۡرَ مُتَشَابِہٍ ؕ اُنۡظُرُوۡۤا اِلٰی ثَمَرِہٖۤ  اِذَاۤ  اَثۡمَرَ  وَ یَنۡعِہٖ ؕ اِنَّ  فِیۡ ذٰلِکُمۡ  لَاٰیٰتٍ  لِّقَوۡمٍ  یُّؤۡمِنُوۡنَ ﴿۹۹﴾",
                    "وَ جَعَلُوۡا لِلّٰہِ شُرَکَآءَ الۡجِنَّ وَ خَلَقَہُمۡ وَ خَرَقُوۡا لَہٗ  بَنِیۡنَ وَ بَنٰتٍۭ بِغَیۡرِ عِلۡمٍ ؕ سُبۡحٰنَہٗ وَ تَعٰلٰی عَمَّا یَصِفُوۡنَ ﴿۱۰۰﴾٪",
                    "بَدِیۡعُ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ اَنّٰی  یَکُوۡنُ  لَہٗ  وَلَدٌ وَّ لَمۡ تَکُنۡ لَّہٗ صَاحِبَۃٌ ؕ وَ خَلَقَ کُلَّ  شَیۡءٍ ۚ وَ ہُوَ بِکُلِّ شَیۡءٍ عَلِیۡمٌ ﴿۱۰۱﴾",
                    "ذٰلِکُمُ اللّٰہُ رَبُّکُمۡ ۚ  لَاۤ  اِلٰہَ  اِلَّا ہُوَ ۚ خَالِقُ کُلِّ شَیۡءٍ  فَاعۡبُدُوۡہُ ۚ  وَ  ہُوَ  عَلٰی کُلِّ  شَیۡءٍ   وَّکِیۡلٌ ﴿۱۰۲﴾",
                    "لَا تُدۡرِکُہُ  الۡاَبۡصَارُ ۫ وَ ہُوَ یُدۡرِکُ الۡاَبۡصَارَ ۚ وَ  ہُوَ  اللَّطِیۡفُ الۡخَبِیۡرُ ﴿۱۰۳﴾",
                    "قَدۡ جَآءَکُمۡ بَصَآئِرُ مِنۡ رَّبِّکُمۡ ۚ فَمَنۡ اَبۡصَرَ فَلِنَفۡسِہٖ ۚ وَ مَنۡ عَمِیَ  فَعَلَیۡہَا ؕ وَ مَاۤ   اَنَا عَلَیۡکُمۡ  بِحَفِیۡظٍ ﴿۱۰۴﴾",
                    "وَ کَذٰلِکَ نُصَرِّفُ الۡاٰیٰتِ وَ لِیَقُوۡلُوۡا دَرَسۡتَ وَ لِنُبَیِّنَہٗ  لِقَوۡمٍ یَّعۡلَمُوۡنَ ﴿۱۰۵﴾",
                    "اِتَّبِعۡ مَاۤ  اُوۡحِیَ  اِلَیۡکَ مِنۡ رَّبِّکَ ۚ لَاۤ  اِلٰہَ  اِلَّا ہُوَ ۚ وَ اَعۡرِضۡ عَنِ الۡمُشۡرِکِیۡنَ ﴿۱۰۶﴾",
                    "وَ لَوۡ شَآءَ اللّٰہُ مَاۤ  اَشۡرَکُوۡا ؕ وَ مَا جَعَلۡنٰکَ عَلَیۡہِمۡ حَفِیۡظًا ۚ وَ مَاۤ  اَنۡتَ عَلَیۡہِمۡ  بِوَکِیۡلٍ ﴿۱۰۷﴾",
                    "وَ لَا تَسُبُّوا الَّذِیۡنَ یَدۡعُوۡنَ مِنۡ دُوۡنِ اللّٰہِ فَیَسُبُّوا اللّٰہَ عَدۡوًۢا بِغَیۡرِ عِلۡمٍ ؕ کَذٰلِکَ زَیَّنَّا لِکُلِّ  اُمَّۃٍ  عَمَلَہُمۡ ۪ ثُمَّ   اِلٰی رَبِّہِمۡ مَّرۡجِعُہُمۡ فَیُنَبِّئُہُمۡ بِمَا کَانُوۡا یَعۡمَلُوۡنَ ﴿۱۰۸﴾",
                    "وَ اَقۡسَمُوۡا بِاللّٰہِ جَہۡدَ  اَیۡمَانِہِمۡ لَئِنۡ جَآءَتۡہُمۡ  اٰیَۃٌ  لَّیُؤۡمِنُنَّ بِہَا ؕ قُلۡ  اِنَّمَا الۡاٰیٰتُ عِنۡدَ اللّٰہِ وَ مَا یُشۡعِرُکُمۡ ۙ اَنَّہَاۤ اِذَا جَآءَتۡ  لَا  یُؤۡمِنُوۡنَ ﴿۱۰۹﴾",
                    "وَ نُقَلِّبُ اَفۡـِٕدَتَہُمۡ وَ اَبۡصَارَہُمۡ کَمَا لَمۡ یُؤۡمِنُوۡا بِہٖۤ  اَوَّلَ مَرَّۃٍ  وَّ نَذَرُہُمۡ فِیۡ طُغۡیَانِہِمۡ یَعۡمَہُوۡنَ ﴿۱۱۰﴾٪",
                    "وَ لَوۡ اَنَّنَا نَزَّلۡنَاۤ  اِلَیۡہِمُ الۡمَلٰٓئِکَۃَ وَ کَلَّمَہُمُ الۡمَوۡتٰی وَ حَشَرۡنَا عَلَیۡہِمۡ کُلَّ شَیۡءٍ قُبُلًا مَّا کَانُوۡا لِیُؤۡمِنُوۡۤا اِلَّاۤ  اَنۡ یَّشَآءَ اللّٰہُ وَ لٰکِنَّ اَکۡثَرَہُمۡ یَجۡہَلُوۡنَ ﴿۱۱۱﴾",
                    "وَ کَذٰلِکَ جَعَلۡنَا لِکُلِّ نَبِیٍّ عَدُوًّا شَیٰطِیۡنَ الۡاِنۡسِ وَ  الۡجِنِّ  یُوۡحِیۡ بَعۡضُہُمۡ اِلٰی بَعۡضٍ زُخۡرُفَ الۡقَوۡلِ غُرُوۡرًا ؕ وَ لَوۡ شَآءَ رَبُّکَ مَا فَعَلُوۡہُ فَذَرۡہُمۡ وَ مَا یَفۡتَرُوۡنَ ﴿۱۱۲﴾",
                    "وَ لِتَصۡغٰۤی اِلَیۡہِ اَفۡـِٕدَۃُ الَّذِیۡنَ لَا یُؤۡمِنُوۡنَ بِالۡاٰخِرَۃِ وَ لِیَرۡضَوۡہُ وَ لِیَقۡتَرِفُوۡا  مَا  ہُمۡ  مُّقۡتَرِفُوۡنَ ﴿۱۱۳﴾",
                    "اَفَغَیۡرَ اللّٰہِ اَبۡتَغِیۡ حَکَمًا وَّ ہُوَ الَّذِیۡۤ اَنۡزَلَ  اِلَیۡکُمُ الۡکِتٰبَ مُفَصَّلًا ؕ وَ الَّذِیۡنَ اٰتَیۡنٰہُمُ الۡکِتٰبَ یَعۡلَمُوۡنَ اَنَّہٗ مُنَزَّلٌ مِّنۡ رَّبِّکَ بِالۡحَقِّ فَلَا تَکُوۡنَنَّ  مِنَ الۡمُمۡتَرِیۡنَ ﴿۱۱۴﴾",
                    "وَ تَمَّتۡ  کَلِمَتُ رَبِّکَ صِدۡقًا وَّ عَدۡلًا ؕ لَا مُبَدِّلَ لِکَلِمٰتِہٖ ۚ وَ ہُوَ السَّمِیۡعُ الۡعَلِیۡمُ ﴿۱۱۵﴾",
                    "وَ اِنۡ تُطِعۡ  اَکۡثَرَ مَنۡ  فِی الۡاَرۡضِ یُضِلُّوۡکَ عَنۡ سَبِیۡلِ اللّٰہِ ؕ اِنۡ یَّتَّبِعُوۡنَ اِلَّا الظَّنَّ  وَ اِنۡ  ہُمۡ  اِلَّا یَخۡرُصُوۡنَ ﴿۱۱۶﴾",
                    "اِنَّ  رَبَّکَ ہُوَ اَعۡلَمُ مَنۡ یَّضِلُّ عَنۡ سَبِیۡلِہٖ ۚ وَ ہُوَ اَعۡلَمُ بِالۡمُہۡتَدِیۡنَ ﴿۱۱۷﴾",
                    "فَکُلُوۡا مِمَّا ذُکِرَ اسۡمُ اللّٰہِ عَلَیۡہِ  اِنۡ کُنۡتُمۡ  بِاٰیٰتِہٖ  مُؤۡمِنِیۡنَ ﴿۱۱۸﴾",
                    "وَ مَا لَکُمۡ  اَلَّا تَاۡکُلُوۡا مِمَّا ذُکِرَ اسۡمُ اللّٰہِ عَلَیۡہِ  وَ قَدۡ فَصَّلَ لَکُمۡ مَّا حَرَّمَ عَلَیۡکُمۡ اِلَّا مَا اضۡطُرِرۡتُمۡ  اِلَیۡہِ ؕ وَ اِنَّ کَثِیۡرًا لَّیُضِلُّوۡنَ بِاَہۡوَآئِہِمۡ بِغَیۡرِ عِلۡمٍ ؕ اِنَّ رَبَّکَ ہُوَ اَعۡلَمُ  بِالۡمُعۡتَدِیۡنَ ﴿۱۱۹﴾",
                    "وَ ذَرُوۡا ظَاہِرَ الۡاِثۡمِ وَ بَاطِنَہٗ ؕ اِنَّ الَّذِیۡنَ یَکۡسِبُوۡنَ الۡاِثۡمَ  سَیُجۡزَوۡنَ بِمَا کَانُوۡا  یَقۡتَرِفُوۡنَ ﴿۱۲۰﴾",
                    "وَ لَا تَاۡکُلُوۡا مِمَّا لَمۡ یُذۡکَرِ اسۡمُ اللّٰہِ عَلَیۡہِ  وَ اِنَّہٗ لَفِسۡقٌ ؕ وَ  اِنَّ الشَّیٰطِیۡنَ لَیُوۡحُوۡنَ اِلٰۤی اَوۡلِیٰٓئِہِمۡ لِیُجَادِلُوۡکُمۡ ۚ وَ اِنۡ  اَطَعۡتُمُوۡہُمۡ  اِنَّکُمۡ  لَمُشۡرِکُوۡنَ ﴿۱۲۱﴾٪",
                    "اَوَ مَنۡ کَانَ مَیۡتًا فَاَحۡیَیۡنٰہُ وَ جَعَلۡنَا لَہٗ نُوۡرًا یَّمۡشِیۡ بِہٖ فِی النَّاسِ کَمَنۡ مَّثَلُہٗ فِی الظُّلُمٰتِ لَیۡسَ بِخَارِجٍ مِّنۡہَا ؕ کَذٰلِکَ زُیِّنَ لِلۡکٰفِرِیۡنَ مَا کَانُوۡا یَعۡمَلُوۡنَ ﴿۱۲۲﴾",
                    "وَ کَذٰلِکَ جَعَلۡنَا فِیۡ کُلِّ قَرۡیَۃٍ اَکٰبِرَ مُجۡرِمِیۡہَا لِیَمۡکُرُوۡا فِیۡہَا ؕ وَ مَا یَمۡکُرُوۡنَ  اِلَّا بِاَنۡفُسِہِمۡ وَ مَا یَشۡعُرُوۡنَ ﴿۱۲۳﴾",
                    "وَ اِذَا جَآءَتۡہُمۡ اٰیَۃٌ  قَالُوۡا لَنۡ نُّؤۡمِنَ حَتّٰی نُؤۡتٰی مِثۡلَ مَاۤ اُوۡتِیَ رُسُلُ اللّٰہِ ؕۘؔ اَللّٰہُ اَعۡلَمُ حَیۡثُ یَجۡعَلُ رِسَالَتَہٗ ؕ سَیُصِیۡبُ الَّذِیۡنَ اَجۡرَمُوۡا صَغَارٌ عِنۡدَ اللّٰہِ وَ عَذَابٌ شَدِیۡدٌۢ بِمَا کَانُوۡا یَمۡکُرُوۡنَ ﴿۱۲۴﴾",
                    "فَمَنۡ یُّرِدِ اللّٰہُ اَنۡ یَّہۡدِیَہٗ یَشۡرَحۡ صَدۡرَہٗ لِلۡاِسۡلَامِ ۚ وَ مَنۡ یُّرِدۡ  اَنۡ یُّضِلَّہٗ یَجۡعَلۡ صَدۡرَہٗ ضَیِّقًا حَرَجًا کَاَنَّمَا یَصَّعَّدُ فِی السَّمَآءِ ؕ کَذٰلِکَ یَجۡعَلُ اللّٰہُ الرِّجۡسَ عَلَی الَّذِیۡنَ لَا  یُؤۡمِنُوۡنَ ﴿۱۲۵﴾",
                    "وَ ہٰذَا صِرَاطُ رَبِّکَ مُسۡتَقِیۡمًا ؕ قَدۡ فَصَّلۡنَا الۡاٰیٰتِ  لِقَوۡمٍ  یَّذَّکَّرُوۡنَ ﴿۱۲۶﴾",
                    "لَہُمۡ دَارُ السَّلٰمِ عِنۡدَ رَبِّہِمۡ وَ ہُوَ وَلِیُّہُمۡ  بِمَا  کَانُوۡا  یَعۡمَلُوۡنَ ﴿۱۲۷﴾",
                    "وَ  یَوۡمَ یَحۡشُرُہُمۡ جَمِیۡعًا ۚ یٰمَعۡشَرَ   الۡجِنِّ قَدِ اسۡتَکۡثَرۡتُمۡ مِّنَ الۡاِنۡسِ ۚ وَ قَالَ اَوۡلِیٰٓؤُہُمۡ مِّنَ الۡاِنۡسِ رَبَّنَا اسۡتَمۡتَعَ بَعۡضُنَا بِبَعۡضٍ وَّ بَلَغۡنَاۤ  اَجَلَنَا الَّذِیۡۤ  اَجَّلۡتَ لَنَا ؕ قَالَ النَّارُ مَثۡوٰٮکُمۡ خٰلِدِیۡنَ فِیۡہَاۤ اِلَّا مَا شَآءَ اللّٰہُ ؕ اِنَّ رَبَّکَ حَکِیۡمٌ  عَلِیۡمٌ ﴿۱۲۸﴾",
                    "وَ  کَذٰلِکَ نُوَلِّیۡ بَعۡضَ الظّٰلِمِیۡنَ بَعۡضًۢا بِمَا  کَانُوۡا  یَکۡسِبُوۡنَ ﴿۱۲۹﴾٪",
                    "یٰمَعۡشَرَ الۡجِنِّ وَ الۡاِنۡسِ اَلَمۡ یَاۡتِکُمۡ رُسُلٌ مِّنۡکُمۡ  یَقُصُّوۡنَ عَلَیۡکُمۡ  اٰیٰتِیۡ  وَ یُنۡذِرُوۡنَکُمۡ  لِقَآءَ  یَوۡمِکُمۡ ہٰذَا ؕ قَالُوۡا شَہِدۡنَا عَلٰۤی اَنۡفُسِنَا وَ غَرَّتۡہُمُ الۡحَیٰوۃُ الدُّنۡیَا  وَ شَہِدُوۡا عَلٰۤی اَنۡفُسِہِمۡ  اَنَّہُمۡ  کَانُوۡا کٰفِرِیۡنَ ﴿۱۳۰﴾",
                    "ذٰلِکَ اَنۡ لَّمۡ یَکُنۡ رَّبُّکَ مُہۡلِکَ الۡقُرٰی بِظُلۡمٍ   وَّ  اَہۡلُہَا غٰفِلُوۡنَ ﴿۱۳۱﴾",
                    "وَ لِکُلٍّ دَرَجٰتٌ مِّمَّا عَمِلُوۡا ؕ وَ مَا رَبُّکَ بِغَافِلٍ عَمَّا  یَعۡمَلُوۡنَ ﴿۱۳۲﴾",
                    "وَ رَبُّکَ الۡغَنِیُّ ذُو الرَّحۡمَۃِ ؕ اِنۡ یَّشَاۡ یُذۡہِبۡکُمۡ وَ یَسۡتَخۡلِفۡ مِنۡۢ بَعۡدِکُمۡ  مَّا یَشَآءُ  کَمَاۤ   اَنۡشَاَکُمۡ  مِّنۡ ذُرِّیَّۃِ  قَوۡمٍ اٰخَرِیۡنَ ﴿۱۳۳﴾ؕ",
                    "اِنَّ مَا تُوۡعَدُوۡنَ لَاٰتٍ ۙ وَّ مَاۤ  اَنۡتُمۡ بِمُعۡجِزِیۡنَ ﴿۱۳۴﴾",
                    "قُلۡ یٰقَوۡمِ اعۡمَلُوۡا عَلٰی مَکَانَتِکُمۡ  اِنِّیۡ عَامِلٌ ۚ فَسَوۡفَ تَعۡلَمُوۡنَ ۙ مَنۡ تَکُوۡنُ لَہٗ عَاقِبَۃُ الدَّارِ ؕ اِنَّہٗ  لَا یُفۡلِحُ الظّٰلِمُوۡنَ ﴿۱۳۵﴾",
                    "وَ جَعَلُوۡا لِلّٰہِ مِمَّا ذَرَاَ مِنَ الۡحَرۡثِ وَ الۡاَنۡعَامِ نَصِیۡبًا فَقَالُوۡا ہٰذَا لِلّٰہِ بِزَعۡمِہِمۡ وَ ہٰذَا لِشُرَکَآئِنَا ۚ فَمَا کَانَ لِشُرَکَآئِہِمۡ  فَلَا یَصِلُ اِلَی اللّٰہِ ۚ وَ مَا کَانَ لِلّٰہِ  فَہُوَ  یَصِلُ  اِلٰی  شُرَکَآئِہِمۡ ؕ سَآءَ مَا  یَحۡکُمُوۡنَ ﴿۱۳۶﴾",
                    "وَ  کَذٰلِکَ  زَیَّنَ  لِکَثِیۡرٍ مِّنَ الۡمُشۡرِکِیۡنَ قَتۡلَ اَوۡلَادِہِمۡ شُرَکَآؤُہُمۡ لِیُرۡدُوۡہُمۡ وَ  لِیَلۡبِسُوۡا عَلَیۡہِمۡ  دِیۡنَہُمۡ ؕ وَ لَوۡ شَآءَ اللّٰہُ مَا فَعَلُوۡہُ فَذَرۡہُمۡ وَ مَا یَفۡتَرُوۡنَ ﴿۱۳۷﴾",
                    "وَ قَالُوۡا ہٰذِہٖۤ  اَنۡعَامٌ  وَّ  حَرۡثٌ حِجۡرٌ ٭ۖ لَّا یَطۡعَمُہَاۤ اِلَّا مَنۡ نَّشَآءُ بِزَعۡمِہِمۡ وَ اَنۡعَامٌ حُرِّمَتۡ ظُہُوۡرُہَا وَ اَنۡعَامٌ لَّا یَذۡکُرُوۡنَ اسۡمَ اللّٰہِ عَلَیۡہَا افۡتِرَآءً عَلَیۡہِ ؕ سَیَجۡزِیۡہِمۡ بِمَا کَانُوۡا یَفۡتَرُوۡنَ ﴿۱۳۸﴾",
                    "وَ قَالُوۡا مَا فِیۡ بُطُوۡنِ ہٰذِہِ الۡاَنۡعَامِ خَالِصَۃٌ  لِّذُکُوۡرِنَا وَ مُحَرَّمٌ عَلٰۤی اَزۡوَاجِنَا ۚ وَ  اِنۡ یَّکُنۡ  مَّیۡتَۃً فَہُمۡ فِیۡہِ  شُرَکَآءُ ؕ سَیَجۡزِیۡہِمۡ  وَصۡفَہُمۡ ؕ اِنَّہٗ حَکِیۡمٌ  عَلِیۡمٌ ﴿۱۳۹﴾",
                    "قَدۡ خَسِرَ الَّذِیۡنَ قَتَلُوۡۤا  اَوۡلَادَہُمۡ سَفَہًۢا بِغَیۡرِ عِلۡمٍ وَّ حَرَّمُوۡا مَا رَزَقَہُمُ اللّٰہُ افۡتِرَآءً  عَلَی اللّٰہِ ؕ قَدۡ ضَلُّوۡا وَ  مَا کَانُوۡا  مُہۡتَدِیۡنَ ﴿۱۴۰﴾٪",
                    "وَ ہُوَ الَّذِیۡۤ اَنۡشَاَ جَنّٰتٍ مَّعۡرُوۡشٰتٍ وَّ غَیۡرَ مَعۡرُوۡشٰتٍ وَّ النَّخۡلَ وَ الزَّرۡعَ مُخۡتَلِفًا اُکُلُہٗ  وَ الزَّیۡتُوۡنَ وَ الرُّمَّانَ مُتَشَابِہًا وَّ غَیۡرَ  مُتَشَابِہٍ ؕ کُلُوۡا  مِنۡ ثَمَرِہٖۤ  اِذَاۤ  اَثۡمَرَ وَ اٰتُوۡا حَقَّہٗ یَوۡمَ حَصَادِہٖ ۫ۖ وَ لَا تُسۡرِفُوۡا ؕ اِنَّہٗ لَا یُحِبُّ الۡمُسۡرِفِیۡنَ ﴿۱۴۱﴾ۙ",
                    "وَ مِنَ الۡاَنۡعَامِ حَمُوۡلَۃً  وَّ فَرۡشًا ؕ کُلُوۡا مِمَّا رَزَقَکُمُ اللّٰہُ وَ لَا تَتَّبِعُوۡا خُطُوٰتِ الشَّیۡطٰنِ ؕ اِنَّہٗ لَکُمۡ عَدُوٌّ مُّبِیۡنٌ ﴿۱۴۲﴾ۙ",
                    "ثَمٰنِیَۃَ اَزۡوَاجٍ ۚ مِنَ الضَّاۡنِ اثۡنَیۡنِ وَ مِنَ الۡمَعۡزِ اثۡنَیۡنِ ؕ   قُلۡ ءٰٓالذَّکَرَیۡنِ حَرَّمَ  اَمِ الۡاُنۡثَیَیۡنِ اَمَّا اشۡتَمَلَتۡ عَلَیۡہِ  اَرۡحَامُ الۡاُنۡثَیَیۡنِ ؕ نَبِّـُٔوۡنِیۡ بِعِلۡمٍ   اِنۡ  کُنۡتُمۡ  صٰدِقِیۡنَ ﴿۱۴۳﴾ۙ",
                    "وَ مِنَ الۡاِبِلِ اثۡنَیۡنِ وَ مِنَ الۡبَقَرِ اثۡنَیۡنِ ؕ قُلۡ ءٰٓالذَّکَرَیۡنِ حَرَّمَ  اَمِ الۡاُنۡثَیَیۡنِ اَمَّا اشۡتَمَلَتۡ عَلَیۡہِ اَرۡحَامُ  الۡاُنۡثَیَیۡنِ ؕ اَمۡ  کُنۡتُمۡ  شُہَدَآءَ اِذۡ  وَصّٰکُمُ اللّٰہُ بِہٰذَا ۚ فَمَنۡ اَظۡلَمُ مِمَّنِ افۡتَرٰی عَلَی اللّٰہِ کَذِبًا لِّیُضِلَّ النَّاسَ بِغَیۡرِ  عِلۡمٍ ؕ اِنَّ اللّٰہَ لَا یَہۡدِی الۡقَوۡمَ  الظّٰلِمِیۡنَ ﴿۱۴۴﴾٪",
                    "قُلۡ لَّاۤ  اَجِدُ فِیۡ مَاۤ   اُوۡحِیَ  اِلَیَّ  مُحَرَّمًا عَلٰی طَاعِمٍ یَّطۡعَمُہٗۤ اِلَّاۤ  اَنۡ یَّکُوۡنَ مَیۡتَۃً اَوۡ دَمًا مَّسۡفُوۡحًا اَوۡ لَحۡمَ  خِنۡزِیۡرٍ فَاِنَّہٗ رِجۡسٌ اَوۡ فِسۡقًا اُہِلَّ لِغَیۡرِ اللّٰہِ  بِہٖ ۚ فَمَنِ اضۡطُرَّ غَیۡرَ بَاغٍ  وَّ لَا عَادٍ  فَاِنَّ رَبَّکَ غَفُوۡرٌ  رَّحِیۡمٌ ﴿۱۴۵﴾",
                    "وَ عَلَی الَّذِیۡنَ ہَادُوۡا حَرَّمۡنَا کُلَّ ذِیۡ ظُفُرٍ ۚ وَ مِنَ الۡبَقَرِ وَ الۡغَنَمِ حَرَّمۡنَا عَلَیۡہِمۡ شُحُوۡمَہُمَاۤ اِلَّا مَا حَمَلَتۡ ظُہُوۡرُہُمَاۤ  اَوِ الۡحَوَایَاۤ  اَوۡ مَا اخۡتَلَطَ بِعَظۡمٍ ؕ ذٰلِکَ جَزَیۡنٰہُمۡ  بِبَغۡیِہِمۡ ۫ۖ وَ  اِنَّا لَصٰدِقُوۡنَ ﴿۱۴۶﴾",
                    "فَاِنۡ کَذَّبُوۡکَ فَقُلۡ رَّبُّکُمۡ ذُوۡ رَحۡمَۃٍ وَّاسِعَۃٍ ۚ وَ لَا یُرَدُّ بَاۡسُہٗ عَنِ الۡقَوۡمِ الۡمُجۡرِمِیۡنَ ﴿۱۴۷﴾",
                    "سَیَقُوۡلُ الَّذِیۡنَ اَشۡرَکُوۡا لَوۡ شَآءَ  اللّٰہُ مَاۤ اَشۡرَکۡنَا وَ لَاۤ  اٰبَآؤُنَا وَ لَا حَرَّمۡنَا مِنۡ شَیۡءٍ ؕ  کَذٰلِکَ  کَذَّبَ الَّذِیۡنَ مِنۡ قَبۡلِہِمۡ حَتّٰی ذَاقُوۡا بَاۡسَنَا ؕ قُلۡ ہَلۡ عِنۡدَکُمۡ مِّنۡ عِلۡمٍ فَتُخۡرِجُوۡہُ  لَنَا ؕ اِنۡ  تَتَّبِعُوۡنَ اِلَّا الظَّنَّ وَ  اِنۡ  اَنۡتُمۡ   اِلَّا  تَخۡرُصُوۡنَ ﴿۱۴۸﴾",
                    "قُلۡ فَلِلّٰہِ الۡحُجَّۃُ الۡبَالِغَۃُ ۚ فَلَوۡ شَآءَ لَہَدٰٮکُمۡ  اَجۡمَعِیۡنَ ﴿۱۴۹﴾",
                    "قُلۡ ہَلُمَّ  شُہَدَآءَکُمُ  الَّذِیۡنَ یَشۡہَدُوۡنَ اَنَّ اللّٰہَ  حَرَّمَ  ہٰذَا ۚ فَاِنۡ شَہِدُوۡا فَلَا تَشۡہَدۡ مَعَہُمۡ ۚ وَ لَا تَتَّبِعۡ  اَہۡوَآءَ  الَّذِیۡنَ کَذَّبُوۡا بِاٰیٰتِنَا وَ الَّذِیۡنَ لَا یُؤۡمِنُوۡنَ بِالۡاٰخِرَۃِ وَ ہُمۡ بِرَبِّہِمۡ یَعۡدِلُوۡنَ ﴿۱۵۰﴾٪",
                    "قُلۡ تَعَالَوۡا اَتۡلُ مَا حَرَّمَ  رَبُّکُمۡ عَلَیۡکُمۡ  اَلَّا تُشۡرِکُوۡا بِہٖ شَیۡئًا وَّ بِالۡوَالِدَیۡنِ اِحۡسَانًا ۚ وَ لَا تَقۡتُلُوۡۤا اَوۡلَادَکُمۡ   مِّنۡ  اِمۡلَاقٍ ؕ نَحۡنُ  نَرۡزُقُکُمۡ وَ اِیَّاہُمۡ ۚ وَ لَا تَقۡرَبُوا الۡفَوَاحِشَ مَا ظَہَرَ  مِنۡہَا وَ مَا بَطَنَ ۚ وَ لَا تَقۡتُلُوا النَّفۡسَ الَّتِیۡ حَرَّمَ اللّٰہُ  اِلَّا بِالۡحَقِّ ؕ ذٰلِکُمۡ وَصّٰکُمۡ بِہٖ لَعَلَّکُمۡ تَعۡقِلُوۡنَ ﴿۱۵۱﴾",
                    "وَ لَا تَقۡرَبُوۡا مَالَ الۡیَتِیۡمِ  اِلَّا بِالَّتِیۡ  ہِیَ اَحۡسَنُ حَتّٰی یَبۡلُغَ اَشُدَّہٗ ۚ وَ اَوۡفُوا الۡکَیۡلَ وَ الۡمِیۡزَانَ بِالۡقِسۡطِ ۚ لَا نُکَلِّفُ نَفۡسًا اِلَّا وُسۡعَہَا ۚ وَ اِذَا قُلۡتُمۡ فَاعۡدِلُوۡا وَ لَوۡ کَانَ ذَا قُرۡبٰی ۚ وَ بِعَہۡدِ اللّٰہِ اَوۡفُوۡا ؕ ذٰلِکُمۡ  وَصّٰکُمۡ بِہٖ لَعَلَّکُمۡ  تَذَکَّرُوۡنَ ﴿۱۵۲﴾ۙ",
                    "وَ  اَنَّ  ہٰذَا صِرَاطِیۡ مُسۡتَقِیۡمًا فَاتَّبِعُوۡہُ ۚ وَ لَا تَتَّبِعُوا السُّبُلَ  فَتَفَرَّقَ  بِکُمۡ عَنۡ سَبِیۡلِہٖ ؕ ذٰلِکُمۡ  وَصّٰکُمۡ بِہٖ لَعَلَّکُمۡ تَتَّقُوۡنَ ﴿۱۵۳﴾",
                    "ثُمَّ اٰتَیۡنَا مُوۡسَی الۡکِتٰبَ تَمَامًا عَلَی الَّذِیۡۤ اَحۡسَنَ وَ تَفۡصِیۡلًا لِّکُلِّ شَیۡءٍ وَّ ہُدًی وَّ رَحۡمَۃً  لَّعَلَّہُمۡ بِلِقَآءِ  رَبِّہِمۡ یُؤۡمِنُوۡنَ ﴿۱۵۴﴾٪",
                    "وَ ہٰذَا کِتٰبٌ اَنۡزَلۡنٰہُ مُبٰرَکٌ فَاتَّبِعُوۡہُ وَ اتَّقُوۡا لَعَلَّکُمۡ تُرۡحَمُوۡنَ ﴿۱۵۵﴾ۙ",
                    "اَنۡ تَقُوۡلُوۡۤا اِنَّمَاۤ  اُنۡزِلَ الۡکِتٰبُ عَلٰی طَآئِفَتَیۡنِ مِنۡ قَبۡلِنَا ۪ وَ  اِنۡ  کُنَّا عَنۡ دِرَاسَتِہِمۡ  لَغٰفِلِیۡنَ ﴿۱۵۶﴾ۙ",
                    "اَوۡ تَقُوۡلُوۡا لَوۡ اَنَّاۤ  اُنۡزِلَ عَلَیۡنَا الۡکِتٰبُ لَکُنَّاۤ  اَہۡدٰی مِنۡہُمۡ ۚ فَقَدۡ جَآءَکُمۡ بَیِّنَۃٌ مِّنۡ  رَّبِّکُمۡ   وَ ہُدًی وَّ رَحۡمَۃٌ ۚ فَمَنۡ  اَظۡلَمُ  مِمَّنۡ  کَذَّبَ بِاٰیٰتِ اللّٰہِ وَ صَدَفَ عَنۡہَا ؕ سَنَجۡزِی الَّذِیۡنَ یَصۡدِفُوۡنَ عَنۡ اٰیٰتِنَا سُوۡٓءَ الۡعَذَابِ  بِمَا  کَانُوۡا  یَصۡدِفُوۡنَ ﴿۱۵۷﴾",
                    "ہَلۡ یَنۡظُرُوۡنَ  اِلَّاۤ  اَنۡ تَاۡتِیَہُمُ الۡمَلٰٓئِکَۃُ اَوۡ  یَاۡتِیَ  رَبُّکَ اَوۡ  یَاۡتِیَ بَعۡضُ اٰیٰتِ رَبِّکَ ؕ یَوۡمَ  یَاۡتِیۡ  بَعۡضُ اٰیٰتِ  رَبِّکَ لَا یَنۡفَعُ نَفۡسًا اِیۡمَانُہَا لَمۡ تَکُنۡ اٰمَنَتۡ مِنۡ قَبۡلُ اَوۡ کَسَبَتۡ فِیۡۤ  اِیۡمَانِہَا خَیۡرًا ؕ قُلِ انۡتَظِرُوۡۤا  اِنَّا مُنۡتَظِرُوۡنَ ﴿۱۵۸﴾",
                    "اِنَّ الَّذِیۡنَ فَرَّقُوۡا دِیۡنَہُمۡ  وَ کَانُوۡا  شِیَعًا لَّسۡتَ مِنۡہُمۡ فِیۡ شَیۡءٍ ؕ اِنَّمَاۤ  اَمۡرُہُمۡ  اِلَی اللّٰہِ ثُمَّ یُنَبِّئُہُمۡ بِمَا کَانُوۡا یَفۡعَلُوۡنَ ﴿۱۵۹﴾",
                    "مَنۡ جَآءَ بِالۡحَسَنَۃِ فَلَہٗ عَشۡرُ اَمۡثَالِہَا ۚ وَ مَنۡ جَآءَ بِالسَّیِّئَۃِ فَلَا یُجۡزٰۤی اِلَّا مِثۡلَہَا وَ ہُمۡ لَا یُظۡلَمُوۡنَ ﴿۱۶۰﴾",
                    "قُلۡ  اِنَّنِیۡ ہَدٰٮنِیۡ رَبِّیۡۤ  اِلٰی صِرَاطٍ مُّسۡتَقِیۡمٍ ۬ۚ دِیۡنًا قِیَمًا مِّلَّۃَ  اِبۡرٰہِیۡمَ حَنِیۡفًا ۚ وَ مَا کَانَ مِنَ الۡمُشۡرِکِیۡنَ ﴿۱۶۱﴾",
                    "قُلۡ  اِنَّ صَلَاتِیۡ  وَ نُسُکِیۡ وَ مَحۡیَایَ وَ مَمَاتِیۡ   لِلّٰہِ   رَبِّ  الۡعٰلَمِیۡنَ ﴿۱۶۲﴾ۙ",
                    "لَا شَرِیۡکَ لَہٗ ۚ وَ بِذٰلِکَ اُمِرۡتُ وَ اَنَا  اَوَّلُ الۡمُسۡلِمِیۡنَ ﴿۱۶۳﴾",
                    "قُلۡ اَغَیۡرَ اللّٰہِ اَبۡغِیۡ رَبًّا وَّ ہُوَ رَبُّ کُلِّ شَیۡءٍ ؕ وَ لَا تَکۡسِبُ کُلُّ نَفۡسٍ  اِلَّا عَلَیۡہَا ۚ وَ لَا تَزِرُ وَازِرَۃٌ  وِّزۡرَ  اُخۡرٰی ۚ ثُمَّ اِلٰی رَبِّکُمۡ مَّرۡجِعُکُمۡ فَیُنَبِّئُکُمۡ بِمَا کُنۡتُمۡ  فِیۡہِ  تَخۡتَلِفُوۡنَ ﴿۱۶۴﴾",
                    "وَ ہُوَ الَّذِیۡ جَعَلَکُمۡ خَلٰٓئِفَ الۡاَرۡضِ وَ رَفَعَ بَعۡضَکُمۡ فَوۡقَ بَعۡضٍ دَرَجٰتٍ لِّیَبۡلُوَکُمۡ فِیۡ مَاۤ  اٰتٰکُمۡ ؕ اِنَّ رَبَّکَ سَرِیۡعُ  الۡعِقَابِ ۫ۖ وَ  اِنَّہٗ  لَغَفُوۡرٌ  رَّحِیۡمٌ ﴿۱۶۵﴾٪"      ] }]
