[{"number":"009",
  "name":"التوبة",
  "verse":[                    "بَرَآءَۃٌ  مِّنَ اللّٰہِ وَ رَسُوۡلِہٖۤ  اِلَی الَّذِیۡنَ عٰہَدۡتُّمۡ  مِّنَ  الۡمُشۡرِکِیۡنَ ؕ﴿۱﴾",
                    "فَسِیۡحُوۡا فِی الۡاَرۡضِ اَرۡبَعَۃَ  اَشۡہُرٍ وَّ اعۡلَمُوۡۤا  اَنَّکُمۡ غَیۡرُ مُعۡجِزِی اللّٰہِ ۙ وَ اَنَّ  اللّٰہَ  مُخۡزِی  الۡکٰفِرِیۡنَ ﴿۲﴾",
                    "وَ اَذَانٌ مِّنَ اللّٰہِ وَ رَسُوۡلِہٖۤ  اِلَی النَّاسِ یَوۡمَ الۡحَجِّ الۡاَکۡبَرِ اَنَّ اللّٰہَ  بَرِیۡٓءٌ  مِّنَ الۡمُشۡرِکِیۡنَ ۬ۙ وَ رَسُوۡلُہٗ ؕ فَاِنۡ تُبۡتُمۡ فَہُوَ خَیۡرٌ لَّکُمۡ ۚ وَ اِنۡ تَوَلَّیۡتُمۡ فَاعۡلَمُوۡۤا اَنَّکُمۡ غَیۡرُ مُعۡجِزِی اللّٰہِ ؕ وَ بَشِّرِ الَّذِیۡنَ  کَفَرُوۡا  بِعَذَابٍ  اَلِیۡمٍ ۙ﴿۳﴾",
                    "اِلَّا الَّذِیۡنَ عٰہَدۡتُّمۡ  مِّنَ الۡمُشۡرِکِیۡنَ ثُمَّ لَمۡ یَنۡقُصُوۡکُمۡ شَیۡئًا وَّ لَمۡ یُظَاہِرُوۡا عَلَیۡکُمۡ اَحَدًا فَاَتِمُّوۡۤا اِلَیۡہِمۡ عَہۡدَہُمۡ اِلٰی مُدَّتِہِمۡ ؕ اِنَّ اللّٰہَ یُحِبُّ  الۡمُتَّقِیۡنَ ﴿۴﴾",
                    "فَاِذَا انۡسَلَخَ الۡاَشۡہُرُ الۡحُرُمُ  فَاقۡتُلُوا الۡمُشۡرِکِیۡنَ حَیۡثُ وَجَدۡتُّمُوۡہُمۡ وَ خُذُوۡہُمۡ وَ احۡصُرُوۡہُمۡ وَ اقۡعُدُوۡا لَہُمۡ کُلَّ مَرۡصَدٍ ۚ فَاِنۡ تَابُوۡا وَ اَقَامُوا الصَّلٰوۃَ وَ اٰتَوُا الزَّکٰوۃَ  فَخَلُّوۡا سَبِیۡلَہُمۡ ؕ اِنَّ اللّٰہَ  غَفُوۡرٌ  رَّحِیۡمٌ ﴿۵﴾",
                    "وَ اِنۡ  اَحَدٌ مِّنَ الۡمُشۡرِکِیۡنَ اسۡتَجَارَکَ فَاَجِرۡہُ حَتّٰی یَسۡمَعَ کَلٰمَ اللّٰہِ ثُمَّ اَبۡلِغۡہُ مَاۡمَنَہٗ ؕ ذٰلِکَ بِاَنَّہُمۡ قَوۡمٌ لَّا یَعۡلَمُوۡنَ ٪﴿۶﴾",
                    "کَیۡفَ یَکُوۡنُ لِلۡمُشۡرِکِیۡنَ عَہۡدٌ عِنۡدَ اللّٰہِ  وَ عِنۡدَ رَسُوۡلِہٖۤ  اِلَّا الَّذِیۡنَ عٰہَدۡتُّمۡ  عِنۡدَ  الۡمَسۡجِدِ  الۡحَرَامِ ۚ فَمَا اسۡتَقَامُوۡا لَکُمۡ فَاسۡتَقِیۡمُوۡا لَہُمۡ ؕ اِنَّ اللّٰہَ  یُحِبُّ  الۡمُتَّقِیۡنَ ﴿۷﴾",
                    "کَیۡفَ وَ  اِنۡ  یَّظۡہَرُوۡا عَلَیۡکُمۡ  لَا یَرۡقُبُوۡا فِیۡکُمۡ  اِلًّا وَّ لَا ذِمَّۃً  ؕ یُرۡضُوۡنَکُمۡ  بِاَفۡوَاہِہِمۡ وَ تَاۡبٰی  قُلُوۡبُہُمۡ ۚ وَ اَکۡثَرُہُمۡ  فٰسِقُوۡنَ ۚ﴿۸﴾",
                    "اِشۡتَرَوۡا بِاٰیٰتِ اللّٰہِ ثَمَنًا قَلِیۡلًا فَصَدُّوۡا عَنۡ سَبِیۡلِہٖ ؕ اِنَّہُمۡ سَآءَ مَا کَانُوۡا  یَعۡمَلُوۡنَ ﴿۹﴾",
                    "لَا یَرۡقُبُوۡنَ فِیۡ مُؤۡمِنٍ اِلًّا وَّ لَا ذِمَّۃً ؕ وَ اُولٰٓئِکَ  ہُمُ  الۡمُعۡتَدُوۡنَ ﴿۱۰﴾",
                    "فَاِنۡ تَابُوۡا وَ اَقَامُوا الصَّلٰوۃَ وَ اٰتَوُا الزَّکٰوۃَ  فَاِخۡوَانُکُمۡ فِی الدِّیۡنِ ؕ وَ نُفَصِّلُ  الۡاٰیٰتِ  لِقَوۡمٍ  یَّعۡلَمُوۡنَ  ﴿۱۱﴾",
                    "وَ  اِنۡ نَّکَثُوۡۤا اَیۡمَانَہُمۡ  مِّنۡۢ بَعۡدِ عَہۡدِہِمۡ وَ طَعَنُوۡا فِیۡ دِیۡنِکُمۡ  فَقَاتِلُوۡۤا اَئِمَّۃَ الۡکُفۡرِ ۙ اِنَّہُمۡ لَاۤ اَیۡمَانَ لَہُمۡ لَعَلَّہُمۡ  یَنۡتَہُوۡنَ ﴿۱۲﴾",
                    "اَلَا تُقَاتِلُوۡنَ قَوۡمًا نَّکَثُوۡۤا اَیۡمَانَہُمۡ وَ ہَمُّوۡا بِاِخۡرَاجِ الرَّسُوۡلِ وَ ہُمۡ بَدَءُوۡکُمۡ اَوَّلَ مَرَّۃٍ ؕ اَتَخۡشَوۡنَہُمۡ ۚ فَاللّٰہُ  اَحَقُّ اَنۡ تَخۡشَوۡہُ  اِنۡ  کُنۡتُمۡ  مُّؤۡمِنِیۡنَ ﴿۱۳﴾",
                    "قَاتِلُوۡہُمۡ یُعَذِّبۡہُمُ اللّٰہُ بِاَیۡدِیۡکُمۡ وَ یُخۡزِہِمۡ وَ یَنۡصُرۡکُمۡ عَلَیۡہِمۡ وَ یَشۡفِ صُدُوۡرَ  قَوۡمٍ  مُّؤۡمِنِیۡنَ ﴿ۙ۱۴﴾",
                    "وَ یُذۡہِبۡ غَیۡظَ قُلُوۡبِہِمۡ ؕ وَ یَتُوۡبُ اللّٰہُ عَلٰی مَنۡ  یَّشَآءُ ؕ وَ اللّٰہُ عَلِیۡمٌ  حَکِیۡمٌ ﴿۱۵﴾",
                    "اَمۡ حَسِبۡتُمۡ  اَنۡ تُتۡرَکُوۡا وَ لَمَّا یَعۡلَمِ اللّٰہُ الَّذِیۡنَ جٰہَدُوۡا مِنۡکُمۡ وَ لَمۡ یَتَّخِذُوۡا مِنۡ دُوۡنِ اللّٰہِ وَ لَا رَسُوۡلِہٖ وَ لَا الۡمُؤۡمِنِیۡنَ  وَلِیۡجَۃً ؕ وَ اللّٰہُ  خَبِیۡرٌۢ  بِمَا تَعۡمَلُوۡنَ ﴿٪۱۶﴾",
                    "مَا کَانَ لِلۡمُشۡرِکِیۡنَ اَنۡ یَّعۡمُرُوۡا مَسٰجِدَ اللّٰہِ شٰہِدِیۡنَ عَلٰۤی اَنۡفُسِہِمۡ بِالۡکُفۡرِ ؕ اُولٰٓئِکَ حَبِطَتۡ اَعۡمَالُہُمۡ ۚۖ وَ فِی النَّارِ ہُمۡ  خٰلِدُوۡنَ ﴿۱۷﴾",
                    "اِنَّمَا یَعۡمُرُ مَسٰجِدَ اللّٰہِ مَنۡ اٰمَنَ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ وَ اَقَامَ الصَّلٰوۃَ  وَ اٰتَی الزَّکٰوۃَ وَ لَمۡ یَخۡشَ اِلَّا اللّٰہَ فَعَسٰۤی اُولٰٓئِکَ اَنۡ یَّکُوۡنُوۡا مِنَ الۡمُہۡتَدِیۡنَ ﴿۱۸﴾",
                    "اَجَعَلۡتُمۡ سِقَایَۃَ الۡحَآجِّ وَ عِمَارَۃَ الۡمَسۡجِدِ الۡحَرَامِ کَمَنۡ اٰمَنَ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ  وَ جٰہَدَ  فِیۡ سَبِیۡلِ اللّٰہِ ؕ لَا  یَسۡتَوٗنَ عِنۡدَ اللّٰہِ ؕ وَ اللّٰہُ  لَا  یَہۡدِی الۡقَوۡمَ  الظّٰلِمِیۡنَ ﴿ۘ۱۹﴾",
                    "اَلَّذِیۡنَ  اٰمَنُوۡا وَ ہَاجَرُوۡا وَ جٰہَدُوۡا  فِیۡ سَبِیۡلِ اللّٰہِ بِاَمۡوَالِہِمۡ وَ اَنۡفُسِہِمۡ ۙ اَعۡظَمُ  دَرَجَۃً  عِنۡدَ  اللّٰہِ ؕ وَ اُولٰٓئِکَ ہُمُ  الۡفَآئِزُوۡنَ ﴿۲۰﴾",
                    "یُبَشِّرُہُمۡ رَبُّہُمۡ بِرَحۡمَۃٍ مِّنۡہُ وَ رِضۡوَانٍ وَّ جَنّٰتٍ  لَّہُمۡ  فِیۡہَا نَعِیۡمٌ مُّقِیۡمٌ ﴿ۙ۲۱﴾",
                    "خٰلِدِیۡنَ فِیۡہَاۤ  اَبَدًا ؕ اِنَّ اللّٰہَ عِنۡدَہٗۤ  اَجۡرٌ  عَظِیۡمٌ ﴿۲۲﴾",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا لَا تَتَّخِذُوۡۤا اٰبَآءَکُمۡ وَ اِخۡوَانَکُمۡ اَوۡلِیَآءَ اِنِ اسۡتَحَبُّوا الۡکُفۡرَ عَلَی الۡاِیۡمَانِ ؕ وَ مَنۡ یَّتَوَلَّہُمۡ مِّنۡکُمۡ فَاُولٰٓئِکَ ہُمُ الظّٰلِمُوۡنَ ﴿۲۳﴾",
                    "قُلۡ اِنۡ کَانَ اٰبَآؤُکُمۡ وَ اَبۡنَآؤُکُمۡ وَ اِخۡوَانُکُمۡ وَ اَزۡوَاجُکُمۡ  وَ عَشِیۡرَتُکُمۡ وَ اَمۡوَالُۨ  اقۡتَرَفۡتُمُوۡہَا وَ تِجَارَۃٌ تَخۡشَوۡنَ  کَسَادَہَا وَ مَسٰکِنُ  تَرۡضَوۡنَہَاۤ  اَحَبَّ  اِلَیۡکُمۡ مِّنَ اللّٰہِ وَ رَسُوۡلِہٖ  وَ جِہَادٍ فِیۡ سَبِیۡلِہٖ فَتَرَبَّصُوۡا حَتّٰی یَاۡتِیَ اللّٰہُ بِاَمۡرِہٖ ؕ وَ اللّٰہُ  لَا یَہۡدِی الۡقَوۡمَ  الۡفٰسِقِیۡنَ ﴿٪۲۴﴾",
                    "لَقَدۡ نَصَرَکُمُ اللّٰہُ فِیۡ مَوَاطِنَ کَثِیۡرَۃٍ ۙ وَّ یَوۡمَ حُنَیۡنٍ ۙ اِذۡ  اَعۡجَبَتۡکُمۡ  کَثۡرَتُکُمۡ فَلَمۡ تُغۡنِ عَنۡکُمۡ شَیۡئًا وَّ ضَاقَتۡ عَلَیۡکُمُ الۡاَرۡضُ بِمَا رَحُبَتۡ ثُمَّ وَلَّیۡتُمۡ  مُّدۡبِرِیۡنَ ﴿ۚ۲۵﴾",
                    "ثُمَّ اَنۡزَلَ اللّٰہُ سَکِیۡنَتَہٗ عَلٰی رَسُوۡلِہٖ وَ عَلَی الۡمُؤۡمِنِیۡنَ وَ اَنۡزَلَ جُنُوۡدًا لَّمۡ تَرَوۡہَا وَ عَذَّبَ الَّذِیۡنَ  کَفَرُوۡا ؕ وَ ذٰلِکَ جَزَآءُ  الۡکٰفِرِیۡنَ ﴿۲۶﴾",
                    "ثُمَّ  یَتُوۡبُ اللّٰہُ مِنۡۢ  بَعۡدِ ذٰلِکَ عَلٰی مَنۡ یَّشَآءُ ؕ وَ اللّٰہُ  غَفُوۡرٌ  رَّحِیۡمٌ ﴿۲۷﴾",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِنَّمَا الۡمُشۡرِکُوۡنَ نَجَسٌ فَلَا یَقۡرَبُوا الۡمَسۡجِدَ الۡحَرَامَ بَعۡدَ عَامِہِمۡ ہٰذَا ۚ وَ اِنۡ خِفۡتُمۡ عَیۡلَۃً فَسَوۡفَ یُغۡنِیۡکُمُ اللّٰہُ مِنۡ فَضۡلِہٖۤ  اِنۡ شَآءَ ؕ اِنَّ  اللّٰہَ  عَلِیۡمٌ  حَکِیۡمٌ ﴿۲۸﴾",
                    "قَاتِلُوا الَّذِیۡنَ لَا یُؤۡمِنُوۡنَ بِاللّٰہِ وَ لَا بِالۡیَوۡمِ  الۡاٰخِرِ وَ لَا یُحَرِّمُوۡنَ مَا حَرَّمَ  اللّٰہُ  وَ رَسُوۡلُہٗ  وَ لَا  یَدِیۡنُوۡنَ دِیۡنَ  الۡحَقِّ مِنَ الَّذِیۡنَ اُوۡتُوا الۡکِتٰبَ  حَتّٰی یُعۡطُوا  الۡجِزۡیَۃَ  عَنۡ ‌یَّدٍ  وَّ ہُمۡ  صٰغِرُوۡنَ ﴿٪۲۹﴾",
                    "وَ قَالَتِ الۡیَہُوۡدُ عُزَیۡرُۨ  ابۡنُ اللّٰہِ وَ قَالَتِ النَّصٰرَی الۡمَسِیۡحُ  ابۡنُ  اللّٰہِ ؕ ذٰلِکَ قَوۡلُہُمۡ بِاَفۡوَاہِہِمۡ ۚ یُضَاہِـُٔوۡنَ  قَوۡلَ الَّذِیۡنَ کَفَرُوۡا مِنۡ قَبۡلُ ؕ قٰتَلَہُمُ اللّٰہُ ۚ۫ اَنّٰی  یُؤۡفَکُوۡنَ ﴿۳۰﴾",
                    "اِتَّخَذُوۡۤا اَحۡبَارَہُمۡ وَ رُہۡبَانَہُمۡ اَرۡبَابًا مِّنۡ دُوۡنِ اللّٰہِ وَ الۡمَسِیۡحَ ابۡنَ مَرۡیَمَ ۚ وَ مَاۤ  اُمِرُوۡۤا  اِلَّا  لِیَعۡبُدُوۡۤا  اِلٰـہًا  وَّاحِدًا ۚ لَاۤ اِلٰہَ  اِلَّا ہُوَ ؕ سُبۡحٰنَہٗ عَمَّا یُشۡرِکُوۡنَ ﴿۳۱﴾",
                    "یُرِیۡدُوۡنَ  اَنۡ یُّطۡفِـُٔوۡا نُوۡرَ اللّٰہِ بِاَفۡوَاہِہِمۡ وَ یَاۡبَی اللّٰہُ  اِلَّاۤ  اَنۡ  یُّتِمَّ  نُوۡرَہٗ وَ لَوۡ  کَرِہَ  الۡکٰفِرُوۡنَ ﴿۳۲﴾",
                    "ہُوَ الَّذِیۡۤ  اَرۡسَلَ رَسُوۡلَہٗ  بِالۡہُدٰی وَ دِیۡنِ الۡحَقِّ لِیُظۡہِرَہٗ عَلَی الدِّیۡنِ کُلِّہٖ ۙ وَ لَوۡ کَرِہَ  الۡمُشۡرِکُوۡنَ ﴿۳۳﴾",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡۤا اِنَّ کَثِیۡرًا مِّنَ الۡاَحۡبَارِ وَ الرُّہۡبَانِ  لَیَاۡکُلُوۡنَ اَمۡوَالَ النَّاسِ بِالۡبَاطِلِ وَ یَصُدُّوۡنَ عَنۡ سَبِیۡلِ اللّٰہِ ؕ وَ الَّذِیۡنَ یَکۡنِزُوۡنَ الذَّہَبَ وَ الۡفِضَّۃَ وَ لَا یُنۡفِقُوۡنَہَا فِیۡ سَبِیۡلِ اللّٰہِ ۙ فَبَشِّرۡہُمۡ  بِعَذَابٍ اَلِیۡمٍ ﴿ۙ۳۴﴾",
                    "یَّوۡمَ یُحۡمٰی عَلَیۡہَا فِیۡ نَارِ جَہَنَّمَ فَتُکۡوٰی بِہَا جِبَاہُہُمۡ وَ جُنُوۡبُہُمۡ وَ ظُہُوۡرُہُمۡ ؕ ہٰذَا مَا  کَنَزۡتُمۡ  لِاَنۡفُسِکُمۡ فَذُوۡقُوۡا  مَا کُنۡتُمۡ  تَکۡنِزُوۡنَ ﴿۳۵﴾",
                    "اِنَّ عِدَّۃَ الشُّہُوۡرِ عِنۡدَ اللّٰہِ اثۡنَا عَشَرَ شَہۡرًا فِیۡ  کِتٰبِ اللّٰہِ یَوۡمَ خَلَقَ السَّمٰوٰتِ وَ الۡاَرۡضَ مِنۡہَاۤ  اَرۡبَعَۃٌ  حُرُمٌ ؕ ذٰلِکَ الدِّیۡنُ الۡقَیِّمُ ۬ۙ  فَلَا تَظۡلِمُوۡا فِیۡہِنَّ اَنۡفُسَکُمۡ وَ قَاتِلُوا الۡمُشۡرِکِیۡنَ کَآفَّۃً کَمَا یُقَاتِلُوۡنَکُمۡ کَآفَّۃً ؕ وَ اعۡلَمُوۡۤا اَنَّ  اللّٰہَ  مَعَ الۡمُتَّقِیۡنَ ﴿۳۶﴾",
                    "اِنَّمَا النَّسِیۡٓءُ زِیَادَۃٌ فِی الۡکُفۡرِ  یُضَلُّ بِہِ الَّذِیۡنَ کَفَرُوۡا یُحِلُّوۡنَہٗ عَامًا وَّ یُحَرِّمُوۡنَہٗ عَامًا لِّیُوَاطِـُٔوۡا عِدَّۃَ مَا حَرَّمَ اللّٰہُ فَیُحِلُّوۡا مَا حَرَّمَ اللّٰہُ ؕ زُیِّنَ لَہُمۡ سُوۡٓءُ  اَعۡمَالِہِمۡ ؕ وَ اللّٰہُ  لَا یَہۡدِی الۡقَوۡمَ  الۡکٰفِرِیۡنَ ﴿٪۳۷﴾",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا مَا لَکُمۡ  اِذَا قِیۡلَ لَکُمُ انۡفِرُوۡا فِیۡ سَبِیۡلِ اللّٰہِ اثَّاقَلۡتُمۡ  اِلَی الۡاَرۡضِ ؕ اَرَضِیۡتُمۡ بِالۡحَیٰوۃِ الدُّنۡیَا مِنَ الۡاٰخِرَۃِ ۚ فَمَا مَتَاعُ الۡحَیٰوۃِ الدُّنۡیَا فِی الۡاٰخِرَۃِ  اِلَّا قَلِیۡلٌ ﴿۳۸﴾",
                    "اِلَّا تَنۡفِرُوۡا یُعَذِّبۡکُمۡ عَذَابًا اَلِیۡمًا ۬ۙ  وَّ یَسۡتَبۡدِلۡ قَوۡمًا غَیۡرَکُمۡ وَ لَا تَضُرُّوۡہُ شَیۡئًا ؕ وَ اللّٰہُ  عَلٰی  کُلِّ  شَیۡءٍ  قَدِیۡرٌ ﴿۳۹﴾",
                    "اِلَّا تَنۡصُرُوۡہُ فَقَدۡ  نَصَرَہُ  اللّٰہُ  اِذۡ اَخۡرَجَہُ الَّذِیۡنَ  کَفَرُوۡا ثَانِیَ اثۡنَیۡنِ اِذۡ ہُمَا فِی الۡغَارِ اِذۡ یَقُوۡلُ لِصَاحِبِہٖ لَا تَحۡزَنۡ اِنَّ اللّٰہَ مَعَنَا ۚ فَاَنۡزَلَ اللّٰہُ سَکِیۡنَتَہٗ عَلَیۡہِ وَ اَیَّدَہٗ  بِجُنُوۡدٍ لَّمۡ تَرَوۡہَا وَ جَعَلَ کَلِمَۃَ  الَّذِیۡنَ کَفَرُوا السُّفۡلٰی ؕ وَ کَلِمَۃُ  اللّٰہِ ہِیَ الۡعُلۡیَا ؕ وَ اللّٰہُ  عَزِیۡزٌ  حَکِیۡمٌ  ﴿۴۰﴾",
                    "اِنۡفِرُوۡا خِفَافًا وَّ ثِقَالًا وَّ جَاہِدُوۡا بِاَمۡوَالِکُمۡ وَ اَنۡفُسِکُمۡ فِیۡ سَبِیۡلِ اللّٰہِ ؕ ذٰلِکُمۡ خَیۡرٌ لَّکُمۡ اِنۡ  کُنۡتُمۡ تَعۡلَمُوۡنَ ﴿۴۱﴾",
                    "لَوۡ کَانَ عَرَضًا قَرِیۡبًا وَّ سَفَرًا قَاصِدًا لَّاتَّبَعُوۡکَ وَ لٰکِنۡۢ بَعُدَتۡ عَلَیۡہِمُ الشُّقَّۃُ ؕ وَ سَیَحۡلِفُوۡنَ بِاللّٰہِ لَوِ اسۡتَطَعۡنَا لَخَرَجۡنَا مَعَکُمۡ ۚ یُہۡلِکُوۡنَ اَنۡفُسَہُمۡ ۚ وَ اللّٰہُ یَعۡلَمُ   اِنَّہُمۡ لَکٰذِبُوۡنَ ﴿٪۴۲﴾",
                    "عَفَا اللّٰہُ عَنۡکَ ۚ لِمَ اَذِنۡتَ لَہُمۡ حَتّٰی یَتَبَیَّنَ لَکَ الَّذِیۡنَ صَدَقُوۡا وَ تَعۡلَمَ الۡکٰذِبِیۡنَ ﴿۴۳﴾",
                    "لَا یَسۡتَاۡذِنُکَ الَّذِیۡنَ یُؤۡمِنُوۡنَ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ  اَنۡ  یُّجَاہِدُوۡا  بِاَمۡوَالِہِمۡ وَ  اَنۡفُسِہِمۡ ؕ وَ اللّٰہُ  عَلِیۡمٌۢ بِالۡمُتَّقِیۡنَ ﴿۴۴﴾",
                    "اِنَّمَا یَسۡتَاۡذِنُکَ الَّذِیۡنَ لَا یُؤۡمِنُوۡنَ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ وَ ارۡتَابَتۡ قُلُوۡبُہُمۡ  فَہُمۡ  فِیۡ  رَیۡبِہِمۡ  یَتَرَدَّدُوۡنَ ﴿۴۵﴾",
                    "وَ لَوۡ  اَرَادُوا الۡخُرُوۡجَ لَاَعَدُّوۡا  لَہٗ  عُدَّۃً وَّ لٰکِنۡ  کَرِہَ  اللّٰہُ  انۡۢبِعَاثَہُمۡ  فَثَبَّطَہُمۡ وَ قِیۡلَ  اقۡعُدُوۡا مَعَ  الۡقٰعِدِیۡنَ ﴿۴۶﴾",
                    "لَوۡ خَرَجُوۡا فِیۡکُمۡ مَّا زَادُوۡکُمۡ  اِلَّا خَبَالًا وَّ لَا۠اَوۡضَعُوۡا خِلٰلَکُمۡ یَبۡغُوۡنَکُمُ الۡفِتۡنَۃَ ۚ وَ فِیۡکُمۡ سَمّٰعُوۡنَ لَہُمۡ ؕ وَ اللّٰہُ  عَلِیۡمٌۢ   بِالظّٰلِمِیۡنَ ﴿۴۷﴾",
                    "لَقَدِ ابۡتَغَوُا الۡفِتۡنَۃَ  مِنۡ  قَبۡلُ وَ قَلَّبُوۡا لَکَ الۡاُمُوۡرَ حَتّٰی جَآءَ الۡحَقُّ وَ ظَہَرَ  اَمۡرُ  اللّٰہِ  وَ ہُمۡ   کٰرِہُوۡنَ ﴿۴۸﴾",
                    "وَ مِنۡہُمۡ مَّنۡ یَّقُوۡلُ ائۡذَنۡ لِّیۡ وَ لَا تَفۡتِنِّیۡ ؕ اَلَا فِی الۡفِتۡنَۃِ سَقَطُوۡا ؕ وَ  اِنَّ جَہَنَّمَ  لَمُحِیۡطَۃٌۢ  بِالۡکٰفِرِیۡنَ ﴿۴۹﴾",
                    "اِنۡ تُصِبۡکَ حَسَنَۃٌ تَسُؤۡہُمۡ ۚ وَ اِنۡ تُصِبۡکَ مُصِیۡبَۃٌ یَّقُوۡلُوۡا قَدۡ اَخَذۡنَاۤ اَمۡرَنَا مِنۡ قَبۡلُ وَ یَتَوَلَّوۡا  وَّ ہُمۡ  فَرِحُوۡنَ ﴿۵۰﴾",
                    "قُلۡ لَّنۡ یُّصِیۡبَنَاۤ اِلَّا مَا کَتَبَ اللّٰہُ  لَنَا ۚ ہُوَ مَوۡلٰٮنَا ۚ وَ عَلَی اللّٰہِ  فَلۡیَتَوَکَّلِ  الۡمُؤۡمِنُوۡنَ ﴿۵۱﴾",
                    "قُلۡ ہَلۡ تَرَبَّصُوۡنَ بِنَاۤ اِلَّاۤ اِحۡدَی الۡحُسۡنَیَیۡنِ ؕ وَ نَحۡنُ نَتَرَبَّصُ بِکُمۡ  اَنۡ یُّصِیۡبَکُمُ اللّٰہُ بِعَذَابٍ مِّنۡ عِنۡدِہٖۤ  اَوۡ بِاَیۡدِیۡنَا ۫ۖ فَتَرَبَّصُوۡۤا اِنَّا مَعَکُمۡ مُّتَرَبِّصُوۡنَ ﴿۵۲﴾",
                    "قُلۡ اَنۡفِقُوۡا طَوۡعًا اَوۡ کَرۡہًا لَّنۡ یُّتَقَبَّلَ مِنۡکُمۡ ؕ اِنَّکُمۡ کُنۡتُمۡ قَوۡمًا فٰسِقِیۡنَ ﴿۵۳﴾",
                    "وَ مَا مَنَعَہُمۡ  اَنۡ تُقۡبَلَ مِنۡہُمۡ نَفَقٰتُہُمۡ   اِلَّاۤ   اَنَّہُمۡ کَفَرُوۡا بِاللّٰہِ وَ بِرَسُوۡلِہٖ وَ لَا یَاۡتُوۡنَ الصَّلٰوۃَ  اِلَّا وَ ہُمۡ کُسَالٰی وَ لَا یُنۡفِقُوۡنَ  اِلَّا وَ ہُمۡ کٰرِہُوۡنَ ﴿۵۴﴾",
                    "فَلَا تُعۡجِبۡکَ اَمۡوَالُہُمۡ وَ لَاۤ  اَوۡلَادُہُمۡ ؕ اِنَّمَا یُرِیۡدُ اللّٰہُ  لِیُعَذِّبَہُمۡ بِہَا فِی الۡحَیٰوۃِ الدُّنۡیَا وَ تَزۡہَقَ اَنۡفُسُہُمۡ وَ ہُمۡ کٰفِرُوۡنَ ﴿۵۵﴾",
                    "وَ یَحۡلِفُوۡنَ بِاللّٰہِ  اِنَّہُمۡ  لَمِنۡکُمۡ ؕ وَ مَا ہُمۡ مِّنۡکُمۡ  وَ  لٰکِنَّہُمۡ  قَوۡمٌ  یَّفۡرَقُوۡنَ ﴿۵۶﴾",
                    "لَوۡ  یَجِدُوۡنَ مَلۡجَاً  اَوۡ مَغٰرٰتٍ اَوۡ  مُدَّخَلًا لَّوَلَّوۡا  اِلَیۡہِ  وَ ہُمۡ  یَجۡمَحُوۡنَ ﴿۵۷﴾",
                    "وَ مِنۡہُمۡ مَّنۡ یَّلۡمِزُکَ فِی الصَّدَقٰتِ ۚ فَاِنۡ اُعۡطُوۡا مِنۡہَا رَضُوۡا وَ اِنۡ لَّمۡ یُعۡطَوۡا مِنۡہَاۤ   اِذَا  ہُمۡ  یَسۡخَطُوۡنَ ﴿۵۸﴾",
                    "وَ لَوۡ اَنَّہُمۡ رَضُوۡا مَاۤ  اٰتٰٮہُمُ اللّٰہُ وَ رَسُوۡلُہٗ ۙ وَ قَالُوۡا حَسۡبُنَا اللّٰہُ سَیُؤۡتِیۡنَا اللّٰہُ مِنۡ فَضۡلِہٖ وَ رَسُوۡلُہٗۤ  ۙ اِنَّاۤ  اِلَی  اللّٰہِ  رٰغِبُوۡنَ ﴿٪۵۹﴾",
                    "اِنَّمَا الصَّدَقٰتُ لِلۡفُقَرَآءِ وَ الۡمَسٰکِیۡنِ وَ  الۡعٰمِلِیۡنَ عَلَیۡہَا وَ الۡمُؤَلَّفَۃِ قُلُوۡبُہُمۡ وَ فِی الرِّقَابِ وَ الۡغٰرِمِیۡنَ وَ فِیۡ سَبِیۡلِ اللّٰہِ وَ ابۡنِ السَّبِیۡلِ ؕ فَرِیۡضَۃً مِّنَ  اللّٰہِ ؕ وَ اللّٰہُ  عَلِیۡمٌ  حَکِیۡمٌ ﴿۶۰﴾",
                    "وَ مِنۡہُمُ الَّذِیۡنَ یُؤۡذُوۡنَ النَّبِیَّ وَ یَقُوۡلُوۡنَ ہُوَ اُذُنٌ ؕ قُلۡ اُذُنُ خَیۡرٍ لَّکُمۡ یُؤۡمِنُ بِاللّٰہِ  وَ یُؤۡمِنُ لِلۡمُؤۡمِنِیۡنَ وَ رَحۡمَۃٌ  لِّلَّذِیۡنَ اٰمَنُوۡا مِنۡکُمۡ ؕ وَ الَّذِیۡنَ یُؤۡذُوۡنَ رَسُوۡلَ اللّٰہِ لَہُمۡ عَذَابٌ  اَلِیۡمٌ ﴿۶۱﴾",
                    "یَحۡلِفُوۡنَ بِاللّٰہِ لَکُمۡ لِیُرۡضُوۡکُمۡ ۚ وَ اللّٰہُ وَ رَسُوۡلُہٗۤ  اَحَقُّ اَنۡ یُّرۡضُوۡہُ  اِنۡ کَانُوۡا  مُؤۡمِنِیۡنَ ﴿۶۲﴾",
                    "اَلَمۡ یَعۡلَمُوۡۤا اَنَّہٗ مَنۡ یُّحَادِدِ اللّٰہَ وَ رَسُوۡلَہٗ  فَاَنَّ لَہٗ  نَارَ جَہَنَّمَ خَالِدًا فِیۡہَا ؕ ذٰلِکَ  الۡخِزۡیُ  الۡعَظِیۡمُ ﴿۶۳﴾",
                    "یَحۡذَرُ الۡمُنٰفِقُوۡنَ اَنۡ تُنَزَّلَ عَلَیۡہِمۡ سُوۡرَۃٌ  تُنَبِّئُہُمۡ بِمَا فِیۡ قُلُوۡبِہِمۡ ؕ قُلِ اسۡتَہۡزِءُوۡا ۚ اِنَّ اللّٰہَ  مُخۡرِجٌ مَّا تَحۡذَرُوۡنَ ﴿۶۴﴾",
                    "وَ لَئِنۡ سَاَلۡتَہُمۡ لَیَقُوۡلُنَّ اِنَّمَا کُنَّا نَخُوۡضُ وَ نَلۡعَبُ ؕ قُلۡ اَ بِاللّٰہِ وَ اٰیٰتِہٖ وَ رَسُوۡلِہٖ  کُنۡتُمۡ  تَسۡتَہۡزِءُوۡنَ ﴿۶۵﴾",
                    "لَا تَعۡتَذِرُوۡا قَدۡ کَفَرۡتُمۡ  بَعۡدَ  اِیۡمَانِکُمۡ ؕ اِنۡ نَّعۡفُ عَنۡ طَآئِفَۃٍ مِّنۡکُمۡ نُعَذِّبۡ طَآئِفَۃًۢ  بِاَنَّہُمۡ  کَانُوۡا  مُجۡرِمِیۡنَ ﴿٪۶۶﴾",
                    "اَلۡمُنٰفِقُوۡنَ وَ الۡمُنٰفِقٰتُ بَعۡضُہُمۡ مِّنۡۢ بَعۡضٍ ۘ یَاۡمُرُوۡنَ بِالۡمُنۡکَرِ وَ یَنۡہَوۡنَ عَنِ الۡمَعۡرُوۡفِ وَ یَقۡبِضُوۡنَ اَیۡدِیَہُمۡ ؕ نَسُوا اللّٰہَ  فَنَسِیَہُمۡ ؕ اِنَّ  الۡمُنٰفِقِیۡنَ ہُمُ  الۡفٰسِقُوۡنَ ﴿۶۷﴾",
                    "وَعَدَ اللّٰہُ الۡمُنٰفِقِیۡنَ وَ الۡمُنٰفِقٰتِ وَ الۡکُفَّارَ نَارَ جَہَنَّمَ خٰلِدِیۡنَ فِیۡہَا ؕ ہِیَ حَسۡبُہُمۡ ۚ وَ لَعَنَہُمُ اللّٰہُ ۚ وَ لَہُمۡ عَذَابٌ  مُّقِیۡمٌ ﴿ۙ۶۸﴾",
                    "کَالَّذِیۡنَ مِنۡ قَبۡلِکُمۡ کَانُوۡۤا اَشَدَّ مِنۡکُمۡ  قُوَّۃً  وَّ اَکۡثَرَ اَمۡوَالًا وَّ اَوۡلَادًا ؕ فَاسۡتَمۡتَعُوۡا بِخَلَاقِہِمۡ فَاسۡتَمۡتَعۡتُمۡ بِخَلَاقِکُمۡ  کَمَا اسۡتَمۡتَعَ الَّذِیۡنَ مِنۡ قَبۡلِکُمۡ بِخَلَاقِہِمۡ وَ خُضۡتُمۡ کَالَّذِیۡ خَاضُوۡا ؕ اُولٰٓئِکَ حَبِطَتۡ اَعۡمَالُہُمۡ  فِی الدُّنۡیَا وَ الۡاٰخِرَۃِ ۚ وَ اُولٰٓئِکَ ہُمُ  الۡخٰسِرُوۡنَ ﴿۶۹﴾",
                    "اَلَمۡ  یَاۡتِہِمۡ نَبَاُ الَّذِیۡنَ مِنۡ  قَبۡلِہِمۡ  قَوۡمِ نُوۡحٍ وَّ عَادٍ وَّ ثَمُوۡدَ ۬ۙ وَ قَوۡمِ  اِبۡرٰہِیۡمَ  وَ اَصۡحٰبِ  مَدۡیَنَ  وَ الۡمُؤۡتَفِکٰتِ ؕ اَتَتۡہُمۡ رُسُلُہُمۡ بِالۡبَیِّنٰتِ ۚ فَمَا کَانَ اللّٰہُ  لِیَظۡلِمَہُمۡ  وَ لٰکِنۡ  کَانُوۡۤا اَنۡفُسَہُمۡ  یَظۡلِمُوۡنَ ﴿۷۰﴾",
                    "وَ الۡمُؤۡمِنُوۡنَ وَ الۡمُؤۡمِنٰتُ بَعۡضُہُمۡ اَوۡلِیَآءُ بَعۡضٍ ۘ یَاۡمُرُوۡنَ بِالۡمَعۡرُوۡفِ وَ یَنۡہَوۡنَ عَنِ الۡمُنۡکَرِ وَ یُقِیۡمُوۡنَ الصَّلٰوۃَ  وَ یُؤۡتُوۡنَ الزَّکٰوۃَ وَ یُطِیۡعُوۡنَ اللّٰہَ وَ رَسُوۡلَہٗ ؕ اُولٰٓئِکَ سَیَرۡحَمُہُمُ اللّٰہُ ؕ اِنَّ اللّٰہَ عَزِیۡزٌ  حَکِیۡمٌ ﴿۷۱﴾",
                    "وَعَدَ اللّٰہُ الۡمُؤۡمِنِیۡنَ وَ الۡمُؤۡمِنٰتِ جَنّٰتٍ تَجۡرِیۡ مِنۡ تَحۡتِہَا الۡاَنۡہٰرُ خٰلِدِیۡنَ فِیۡہَا وَ مَسٰکِنَ طَیِّبَۃً فِیۡ جَنّٰتِ عَدۡنٍ ؕ وَ رِضۡوَانٌ مِّنَ اللّٰہِ اَکۡبَرُ ؕ ذٰلِکَ ہُوَ  الۡفَوۡزُ  الۡعَظِیۡمُ ﴿٪۷۲﴾",
                    "یٰۤاَیُّہَا النَّبِیُّ جَاہِدِ الۡکُفَّارَ وَ الۡمُنٰفِقِیۡنَ وَ اغۡلُظۡ عَلَیۡہِمۡ ؕ وَ مَاۡوٰٮہُمۡ جَہَنَّمُ ؕ وَ بِئۡسَ الۡمَصِیۡرُ ﴿۷۳﴾",
                    "یَحۡلِفُوۡنَ بِاللّٰہِ مَا قَالُوۡا ؕ وَ لَقَدۡ قَالُوۡا کَلِمَۃَ  الۡکُفۡرِ وَ کَفَرُوۡا بَعۡدَ اِسۡلَامِہِمۡ وَ ہَمُّوۡا بِمَا لَمۡ  یَنَالُوۡا ۚ وَ مَا نَقَمُوۡۤا  اِلَّاۤ   اَنۡ اَغۡنٰہُمُ اللّٰہُ وَ رَسُوۡلُہٗ  مِنۡ فَضۡلِہٖ ۚ فَاِنۡ یَّتُوۡبُوۡا یَکُ خَیۡرًا لَّہُمۡ ۚ وَ اِنۡ یَّتَوَلَّوۡا یُعَذِّبۡہُمُ اللّٰہُ عَذَابًا اَلِیۡمًا ۙ فِی الدُّنۡیَا وَ الۡاٰخِرَۃِ ۚ وَ مَا لَہُمۡ فِی الۡاَرۡضِ  مِنۡ  وَّلِیٍّ  وَّ لَا  نَصِیۡرٍ ﴿۷۴﴾",
                    "وَ مِنۡہُمۡ مَّنۡ عٰہَدَ اللّٰہَ  لَئِنۡ اٰتٰٮنَا مِنۡ فَضۡلِہٖ  لَنَصَّدَّقَنَّ وَ لَنَکُوۡنَنَّ مِنَ الصّٰلِحِیۡنَ ﴿۷۵﴾",
                    "فَلَمَّاۤ  اٰتٰہُمۡ مِّنۡ  فَضۡلِہٖ بَخِلُوۡا بِہٖ وَ تَوَلَّوۡا وَّ ہُمۡ  مُّعۡرِضُوۡنَ ﴿۷۶﴾",
                    "فَاَعۡقَبَہُمۡ نِفَاقًا فِیۡ قُلُوۡبِہِمۡ اِلٰی یَوۡمِ یَلۡقَوۡنَہٗ  بِمَاۤ  اَخۡلَفُوا اللّٰہَ مَا وَعَدُوۡہُ وَ بِمَا  کَانُوۡا  یَکۡذِبُوۡنَ ﴿۷۷﴾",
                    "اَلَمۡ یَعۡلَمُوۡۤا اَنَّ اللّٰہَ یَعۡلَمُ سِرَّہُمۡ وَ نَجۡوٰٮہُمۡ  وَ  اَنَّ اللّٰہَ  عَلَّامُ الۡغُیُوۡبِ ﴿ۚ۷۸﴾",
                    "اَلَّذِیۡنَ یَلۡمِزُوۡنَ الۡمُطَّوِّعِیۡنَ مِنَ الۡمُؤۡمِنِیۡنَ فِی الصَّدَقٰتِ وَ الَّذِیۡنَ لَا یَجِدُوۡنَ  اِلَّا جُہۡدَہُمۡ فَیَسۡخَرُوۡنَ مِنۡہُمۡ ؕ سَخِرَ  اللّٰہُ  مِنۡہُمۡ ۫ وَ لَہُمۡ عَذَابٌ  اَلِیۡمٌ ﴿۷۹﴾",
                    "اِسۡتَغۡفِرۡ لَہُمۡ اَوۡ لَا تَسۡتَغۡفِرۡ لَہُمۡ ؕ اِنۡ تَسۡتَغۡفِرۡ لَہُمۡ سَبۡعِیۡنَ مَرَّۃً  فَلَنۡ یَّغۡفِرَ اللّٰہُ  لَہُمۡ ؕ ذٰلِکَ بِاَنَّہُمۡ کَفَرُوۡا بِاللّٰہِ وَ رَسُوۡلِہٖ ؕ وَ اللّٰہُ  لَا یَہۡدِی الۡقَوۡمَ الۡفٰسِقِیۡنَ ﴿٪۸۰﴾",
                    "فَرِحَ الۡمُخَلَّفُوۡنَ بِمَقۡعَدِہِمۡ خِلٰفَ رَسُوۡلِ اللّٰہِ وَ کَرِہُوۡۤا اَنۡ یُّجَاہِدُوۡا بِاَمۡوَالِہِمۡ وَ اَنۡفُسِہِمۡ فِیۡ سَبِیۡلِ اللّٰہِ وَ قَالُوۡا لَا تَنۡفِرُوۡا فِی الۡحَرِّ ؕ قُلۡ نَارُ جَہَنَّمَ اَشَدُّ حَرًّا ؕ لَوۡ کَانُوۡا یَفۡقَہُوۡنَ ﴿۸۱﴾",
                    "فَلۡیَضۡحَکُوۡا قَلِیۡلًا وَّ لۡیَبۡکُوۡا کَثِیۡرًا ۚ جَزَآءًۢ بِمَا کَانُوۡا یَکۡسِبُوۡنَ ﴿۸۲﴾",
                    "فَاِنۡ رَّجَعَکَ اللّٰہُ اِلٰی طَآئِفَۃٍ مِّنۡہُمۡ فَاسۡتَاۡذَنُوۡکَ لِلۡخُرُوۡجِ فَقُلۡ لَّنۡ تَخۡرُجُوۡا مَعِیَ اَبَدًا وَّ لَنۡ تُقَاتِلُوۡا مَعِیَ عَدُوًّا ؕ اِنَّکُمۡ رَضِیۡتُمۡ بِالۡقُعُوۡدِ اَوَّلَ مَرَّۃٍ   فَاقۡعُدُوۡا  مَعَ  الۡخٰلِفِیۡنَ ﴿۸۳﴾",
                    "وَ لَا تُصَلِّ عَلٰۤی اَحَدٍ مِّنۡہُمۡ مَّاتَ اَبَدًا وَّ لَا تَقُمۡ عَلٰی قَبۡرِہٖ ؕ اِنَّہُمۡ کَفَرُوۡا بِاللّٰہِ وَ رَسُوۡلِہٖ  وَ مَا تُوۡا وَ ہُمۡ  فٰسِقُوۡنَ ﴿۸۴﴾",
                    "وَ لَا تُعۡجِبۡکَ اَمۡوَالُہُمۡ  وَ اَوۡلَادُہُمۡ ؕ اِنَّمَا یُرِیۡدُ اللّٰہُ  اَنۡ یُّعَذِّبَہُمۡ بِہَا فِی الدُّنۡیَا وَ تَزۡہَقَ  اَنۡفُسُہُمۡ  وَ ہُمۡ کٰفِرُوۡنَ ﴿۸۵﴾",
                    "وَ اِذَاۤ  اُنۡزِلَتۡ سُوۡرَۃٌ  اَنۡ اٰمِنُوۡا بِاللّٰہِ وَ جَاہِدُوۡا مَعَ  رَسُوۡلِہِ  اسۡتَاۡذَنَکَ اُولُوا الطَّوۡلِ  مِنۡہُمۡ وَ قَالُوۡا ذَرۡنَا نَکُنۡ  مَّعَ  الۡقٰعِدِیۡنَ ﴿۸۶﴾",
                    "رَضُوۡا بِاَنۡ یَّکُوۡنُوۡا مَعَ الۡخَوَالِفِ وَ طُبِعَ  عَلٰی  قُلُوۡبِہِمۡ فَہُمۡ لَا یَفۡقَہُوۡنَ ﴿۸۷﴾",
                    "لٰکِنِ الرَّسُوۡلُ وَ الَّذِیۡنَ اٰمَنُوۡا مَعَہٗ جٰہَدُوۡا بِاَمۡوَالِہِمۡ وَ اَنۡفُسِہِمۡ ؕ وَ اُولٰٓئِکَ لَہُمُ الۡخَیۡرٰتُ ۫ وَ اُولٰٓئِکَ ہُمُ الۡمُفۡلِحُوۡنَ ﴿۸۸﴾",
                    "اَعَدَّ اللّٰہُ  لَہُمۡ  جَنّٰتٍ تَجۡرِیۡ مِنۡ  تَحۡتِہَا الۡاَنۡہٰرُ خٰلِدِیۡنَ فِیۡہَا ؕ ذٰلِکَ الۡفَوۡزُ الۡعَظِیۡمُ ﴿٪۸۹﴾",
                    "وَ جَآءَ الۡمُعَذِّرُوۡنَ مِنَ الۡاَعۡرَابِ لِیُؤۡذَنَ لَہُمۡ وَ قَعَدَ الَّذِیۡنَ  کَذَبُوا اللّٰہَ وَ رَسُوۡلَہٗ ؕ سَیُصِیۡبُ الَّذِیۡنَ کَفَرُوۡا مِنۡہُمۡ  عَذَابٌ  اَلِیۡمٌ ﴿۹۰﴾",
                    "لَیۡسَ عَلَی الضُّعَفَآءِ وَ لَا عَلَی الۡمَرۡضٰی وَ لَا عَلَی الَّذِیۡنَ لَا  یَجِدُوۡنَ  مَا یُنۡفِقُوۡنَ حَرَجٌ  اِذَا نَصَحُوۡا لِلّٰہِ وَ رَسُوۡلِہٖ ؕ مَا عَلَی الۡمُحۡسِنِیۡنَ مِنۡ سَبِیۡلٍ ؕ وَ اللّٰہُ  غَفُوۡرٌ   رَّحِیۡمٌ ﴿ۙ۹۱﴾",
                    "وَّ لَا عَلَی الَّذِیۡنَ  اِذَا  مَاۤ   اَتَوۡکَ  لِتَحۡمِلَہُمۡ قُلۡتَ لَاۤ  اَجِدُ مَاۤ  اَحۡمِلُکُمۡ  عَلَیۡہِ ۪ تَوَلَّوۡا  وَّ  اَعۡیُنُہُمۡ تَفِیۡضُ مِنَ  الدَّمۡعِ حَزَنًا  اَلَّا  یَجِدُوۡا  مَا  یُنۡفِقُوۡنَ ﴿ؕ۹۲﴾",
                    "اِنَّمَا السَّبِیۡلُ عَلَی الَّذِیۡنَ یَسۡتَاۡذِنُوۡنَکَ وَ ہُمۡ اَغۡنِیَآءُ ۚ رَضُوۡا بِاَنۡ یَّکُوۡنُوۡا مَعَ الۡخَوَالِفِ ۙ وَ طَبَعَ اللّٰہُ  عَلٰی قُلُوۡبِہِمۡ  فَہُمۡ  لَا  یَعۡلَمُوۡنَ ﴿۹۳﴾",
                    "یَعۡتَذِرُوۡنَ  اِلَیۡکُمۡ   اِذَا رَجَعۡتُمۡ  اِلَیۡہِمۡ ؕ قُلۡ لَّا تَعۡتَذِرُوۡا لَنۡ  نُّؤۡمِنَ  لَکُمۡ  قَدۡ نَبَّاَنَا اللّٰہُ مِنۡ  اَخۡبَارِکُمۡ ؕ وَ سَیَرَی اللّٰہُ عَمَلَکُمۡ  وَ رَسُوۡلُہٗ  ثُمَّ تُرَدُّوۡنَ  اِلٰی عٰلِمِ الۡغَیۡبِ وَ الشَّہَادَۃِ فَیُنَبِّئُکُمۡ بِمَا کُنۡتُمۡ تَعۡمَلُوۡنَ ﴿۹۴﴾",
                    "سَیَحۡلِفُوۡنَ بِاللّٰہِ لَکُمۡ اِذَا انۡقَلَبۡتُمۡ اِلَیۡہِمۡ لِتُعۡرِضُوۡا عَنۡہُمۡ ؕ فَاَعۡرِضُوۡا عَنۡہُمۡ ؕ اِنَّہُمۡ  رِجۡسٌ ۫ وَّ مَاۡوٰٮہُمۡ  جَہَنَّمُ ۚ جَزَآءًۢ  بِمَا کَانُوۡا یَکۡسِبُوۡنَ ﴿۹۵﴾",
                    "یَحۡلِفُوۡنَ لَکُمۡ  لِتَرۡضَوۡا عَنۡہُمۡ ۚ فَاِنۡ تَرۡضَوۡا عَنۡہُمۡ فَاِنَّ اللّٰہَ  لَا  یَرۡضٰی عَنِ الۡقَوۡمِ  الۡفٰسِقِیۡنَ ﴿۹۶﴾",
                    "اَلۡاَعۡرَابُ اَشَدُّ کُفۡرًا وَّ نِفَاقًا وَّ اَجۡدَرُ اَلَّا یَعۡلَمُوۡا حُدُوۡدَ  مَاۤ  اَنۡزَلَ اللّٰہُ عَلٰی رَسُوۡلِہٖ ؕ وَ اللّٰہُ  عَلِیۡمٌ  حَکِیۡمٌ ﴿۹۷﴾",
                    "وَ مِنَ الۡاَعۡرَابِ مَنۡ یَّتَّخِذُ مَا یُنۡفِقُ مَغۡرَمًا وَّ یَتَرَبَّصُ بِکُمُ الدَّوَآئِرَ ؕ عَلَیۡہِمۡ دَآئِرَۃُ  السَّوۡءِ ؕ وَ اللّٰہُ سَمِیۡعٌ عَلِیۡمٌ ﴿۹۸﴾",
                    "وَ مِنَ الۡاَعۡرَابِ مَنۡ یُّؤۡمِنُ بِاللّٰہِ وَ الۡیَوۡمِ الۡاٰخِرِ  وَ یَتَّخِذُ مَا یُنۡفِقُ قُرُبٰتٍ عِنۡدَ اللّٰہِ وَ صَلَوٰتِ الرَّسُوۡلِ ؕ اَلَاۤ اِنَّہَا قُرۡبَۃٌ  لَّہُمۡ ؕ سَیُدۡخِلُہُمُ اللّٰہُ  فِیۡ رَحۡمَتِہٖ ؕ اِنَّ اللّٰہَ  غَفُوۡرٌ  رَّحِیۡمٌ  ﴿٪۹۹﴾",
                    "وَ السّٰبِقُوۡنَ الۡاَوَّلُوۡنَ  مِنَ الۡمُہٰجِرِیۡنَ وَ الۡاَنۡصَارِ وَ الَّذِیۡنَ اتَّبَعُوۡہُمۡ بِاِحۡسَانٍ ۙ رَّضِیَ اللّٰہُ عَنۡہُمۡ وَ رَضُوۡا عَنۡہُ وَ اَعَدَّ لَہُمۡ جَنّٰتٍ تَجۡرِیۡ تَحۡتَہَا الۡاَنۡہٰرُ خٰلِدِیۡنَ فِیۡہَاۤ  اَبَدًا ؕ ذٰلِکَ الۡفَوۡزُ الۡعَظِیۡمُ ﴿۱۰۰﴾",
                    "وَ مِمَّنۡ حَوۡلَکُمۡ مِّنَ الۡاَعۡرَابِ مُنٰفِقُوۡنَ ؕۛ وَ مِنۡ اَہۡلِ الۡمَدِیۡنَۃِ ۟ۛؔ مَرَدُوۡا عَلَی النِّفَاقِ ۟ لَا  تَعۡلَمُہُمۡ ؕ نَحۡنُ نَعۡلَمُہُمۡ ؕ سَنُعَذِّبُہُمۡ مَّرَّتَیۡنِ ثُمَّ  یُرَدُّوۡنَ  اِلٰی  عَذَابٍ  عَظِیۡمٍ ﴿۱۰۱﴾ۚ",
                    "وَ اٰخَرُوۡنَ اعۡتَرَفُوۡا بِذُنُوۡبِہِمۡ خَلَطُوۡا عَمَلًا صَالِحًا وَّ اٰخَرَ  سَیِّئًا ؕ عَسَی اللّٰہُ اَنۡ یَّتُوۡبَ عَلَیۡہِمۡ ؕ اِنَّ اللّٰہَ غَفُوۡرٌ رَّحِیۡمٌ ﴿۱۰۲﴾",
                    "خُذۡ مِنۡ اَمۡوَالِہِمۡ صَدَقَۃً  تُطَہِّرُہُمۡ وَ تُزَکِّیۡہِمۡ بِہَا وَ صَلِّ عَلَیۡہِمۡ ؕ اِنَّ صَلٰوتَکَ سَکَنٌ لَّہُمۡ ؕ وَ اللّٰہُ سَمِیۡعٌ عَلِیۡمٌ ﴿۱۰۳﴾",
                    "اَلَمۡ  یَعۡلَمُوۡۤا اَنَّ اللّٰہَ ہُوَ  یَقۡبَلُ التَّوۡبَۃَ عَنۡ عِبَادِہٖ وَ یَاۡخُذُ الصَّدَقٰتِ وَ اَنَّ اللّٰہَ ہُوَ  التَّوَّابُ  الرَّحِیۡمُ ﴿۱۰۴﴾",
                    "وَ قُلِ اعۡمَلُوۡا فَسَیَرَی اللّٰہُ عَمَلَکُمۡ وَ رَسُوۡلُہٗ  وَ الۡمُؤۡمِنُوۡنَ ؕ وَ سَتُرَدُّوۡنَ  اِلٰی عٰلِمِ الۡغَیۡبِ وَ الشَّہَادَۃِ فَیُنَبِّئُکُمۡ بِمَا کُنۡتُمۡ  تَعۡمَلُوۡنَ ﴿۱۰۵﴾ۚ",
                    "وَ اٰخَرُوۡنَ مُرۡجَوۡنَ لِاَمۡرِ اللّٰہِ اِمَّا یُعَذِّبُہُمۡ وَ اِمَّا یَتُوۡبُ عَلَیۡہِمۡ ؕ وَ اللّٰہُ عَلِیۡمٌ  حَکِیۡمٌ ﴿۱۰۶﴾",
                    "وَ الَّذِیۡنَ اتَّخَذُوۡا مَسۡجِدًا ضِرَارًا وَّ کُفۡرًا وَّ تَفۡرِیۡقًۢا بَیۡنَ الۡمُؤۡمِنِیۡنَ وَ اِرۡصَادًا لِّمَنۡ حَارَبَ اللّٰہَ وَ رَسُوۡلَہٗ  مِنۡ قَبۡلُ ؕ وَ لَیَحۡلِفُنَّ اِنۡ اَرَدۡنَاۤ اِلَّا الۡحُسۡنٰی ؕ وَ اللّٰہُ یَشۡہَدُ  اِنَّہُمۡ  لَکٰذِبُوۡنَ ﴿۱۰۷﴾",
                    "لَا تَقُمۡ  فِیۡہِ اَبَدًا ؕ لَمَسۡجِدٌ اُسِّسَ عَلَی التَّقۡوٰی مِنۡ اَوَّلِ  یَوۡمٍ اَحَقُّ  اَنۡ تَقُوۡمَ فِیۡہِ ؕ فِیۡہِ  رِجَالٌ یُّحِبُّوۡنَ اَنۡ یَّتَطَہَّرُوۡا ؕ وَ اللّٰہُ یُحِبُّ الۡمُطَّہِّرِیۡنَ ﴿۱۰۸﴾",
                    "اَفَمَنۡ اَسَّسَ بُنۡیَانَہٗ عَلٰی تَقۡوٰی مِنَ اللّٰہِ وَ رِضۡوَانٍ خَیۡرٌ اَمۡ مَّنۡ اَسَّسَ بُنۡیَانَہٗ عَلٰی شَفَا جُرُفٍ ہَارٍ فَانۡہَارَ بِہٖ فِیۡ نَارِ جَہَنَّمَ ؕ وَ اللّٰہُ  لَا یَہۡدِی الۡقَوۡمَ  الظّٰلِمِیۡنَ ﴿۱۰۹﴾",
                    "لَا یَزَالُ بُنۡیَانُہُمُ الَّذِیۡ بَنَوۡا رِیۡبَۃً  فِیۡ قُلُوۡبِہِمۡ  اِلَّاۤ  اَنۡ تَقَطَّعَ قُلُوۡبُہُمۡ ؕ وَ اللّٰہُ عَلِیۡمٌ  حَکِیۡمٌ ﴿۱۱۰﴾٪",
                    "اِنَّ اللّٰہَ اشۡتَرٰی مِنَ الۡمُؤۡمِنِیۡنَ اَنۡفُسَہُمۡ وَ اَمۡوَالَہُمۡ بِاَنَّ لَہُمُ الۡجَنَّۃَ ؕ یُقَاتِلُوۡنَ فِیۡ سَبِیۡلِ اللّٰہِ فَیَقۡتُلُوۡنَ وَ یُقۡتَلُوۡنَ ۟ وَعۡدًا عَلَیۡہِ حَقًّا فِی التَّوۡرٰٮۃِ وَ الۡاِنۡجِیۡلِ وَ الۡقُرۡاٰنِ ؕ وَ مَنۡ اَوۡفٰی بِعَہۡدِہٖ مِنَ اللّٰہِ فَاسۡتَبۡشِرُوۡا بِبَیۡعِکُمُ الَّذِیۡ بَایَعۡتُمۡ بِہٖ ؕ وَ  ذٰلِکَ ہُوَ الۡفَوۡزُ  الۡعَظِیۡمُ ﴿۱۱۱﴾",
                    "اَلتَّآئِبُوۡنَ الۡعٰبِدُوۡنَ الۡحٰمِدُوۡنَ السَّآئِحُوۡنَ الرّٰکِعُوۡنَ السّٰجِدُوۡنَ الۡاٰمِرُوۡنَ بِالۡمَعۡرُوۡفِ وَ النَّاہُوۡنَ عَنِ الۡمُنۡکَرِ وَ الۡحٰفِظُوۡنَ لِحُدُوۡدِ اللّٰہِ ؕ وَ بَشِّرِ  الۡمُؤۡمِنِیۡنَ ﴿۱۱۲﴾",
                    "مَا کَانَ لِلنَّبِیِّ وَ الَّذِیۡنَ اٰمَنُوۡۤا اَنۡ یَّسۡتَغۡفِرُوۡا لِلۡمُشۡرِکِیۡنَ وَ لَوۡ  کَانُوۡۤا  اُولِیۡ  قُرۡبٰی مِنۡۢ بَعۡدِ مَا تَبَیَّنَ لَہُمۡ اَنَّہُمۡ اَصۡحٰبُ  الۡجَحِیۡمِ ﴿۱۱۳﴾",
                    "وَ مَا کَانَ اسۡتِغۡفَارُ  اِبۡرٰہِیۡمَ لِاَبِیۡہِ  اِلَّا عَنۡ مَّوۡعِدَۃٍ  وَّعَدَہَاۤ اِیَّاہُ ۚ فَلَمَّا تَبَیَّنَ لَہٗۤ  اَنَّہٗ عَدُوٌّ  لِّلّٰہِ  تَبَرَّاَ  مِنۡہُ ؕ اِنَّ اِبۡرٰہِیۡمَ  لَاَوَّاہٌ  حَلِیۡمٌ ﴿۱۱۴﴾",
                    "وَ مَا کَانَ اللّٰہُ لِیُضِلَّ قَوۡمًۢا بَعۡدَ اِذۡ ہَدٰٮہُمۡ حَتّٰی  یُبَیِّنَ  لَہُمۡ مَّا یَتَّقُوۡنَ ؕ اِنَّ  اللّٰہَ  بِکُلِّ  شَیۡءٍ عَلِیۡمٌ ﴿۱۱۵﴾",
                    "اِنَّ اللّٰہَ لَہٗ  مُلۡکُ السَّمٰوٰتِ وَ الۡاَرۡضِ ؕ یُحۡیٖ وَ یُمِیۡتُ ؕ وَ مَا لَکُمۡ مِّنۡ دُوۡنِ اللّٰہِ  مِنۡ  وَّلِیٍّ  وَّ لَا  نَصِیۡرٍ ﴿۱۱۶﴾",
                    "لَقَدۡ تَّابَ اللّٰہُ عَلَی النَّبِیِّ وَ الۡمُہٰجِرِیۡنَ وَ الۡاَنۡصَارِ الَّذِیۡنَ اتَّبَعُوۡہُ فِیۡ سَاعَۃِ الۡعُسۡرَۃِ مِنۡۢ بَعۡدِ مَا کَادَ یَزِیۡغُ قُلُوۡبُ فَرِیۡقٍ مِّنۡہُمۡ ثُمَّ  تَابَ عَلَیۡہِمۡ ؕ اِنَّہٗ بِہِمۡ رَءُوۡفٌ  رَّحِیۡمٌ ﴿۱۱۷﴾ۙ",
                    "وَّ عَلَی الثَّلٰثَۃِ الَّذِیۡنَ خُلِّفُوۡا ؕ حَتّٰۤی اِذَا ضَاقَتۡ عَلَیۡہِمُ الۡاَرۡضُ بِمَا رَحُبَتۡ وَ ضَاقَتۡ عَلَیۡہِمۡ اَنۡفُسُہُمۡ وَ ظَنُّوۡۤا اَنۡ لَّا مَلۡجَاَ مِنَ اللّٰہِ  اِلَّاۤ  اِلَیۡہِ ؕ ثُمَّ تَابَ عَلَیۡہِمۡ لِیَتُوۡبُوۡا ؕ اِنَّ اللّٰہَ ہُوَ التَّوَّابُ  الرَّحِیۡمُ ﴿۱۱۸﴾٪",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوا اتَّقُوا اللّٰہَ وَ کُوۡنُوۡا مَعَ  الصّٰدِقِیۡنَ ﴿۱۱۹﴾",
                    "مَا کَانَ لِاَہۡلِ الۡمَدِیۡنَۃِ وَ مَنۡ حَوۡلَہُمۡ مِّنَ الۡاَعۡرَابِ اَنۡ یَّتَخَلَّفُوۡا عَنۡ رَّسُوۡلِ اللّٰہِ  وَ لَا یَرۡغَبُوۡا بِاَنۡفُسِہِمۡ عَنۡ نَّفۡسِہٖ ؕ  ذٰلِکَ بِاَنَّہُمۡ لَا یُصِیۡبُہُمۡ ظَمَاٌ وَّ لَا نَصَبٌ وَّ لَا مَخۡمَصَۃٌ  فِیۡ سَبِیۡلِ اللّٰہِ وَ لَا یَطَـُٔوۡنَ مَوۡطِئًا یَّغِیۡظُ الۡکُفَّارَ وَ لَا یَنَالُوۡنَ مِنۡ عَدُوٍّ نَّیۡلًا اِلَّا کُتِبَ لَہُمۡ بِہٖ عَمَلٌ صَالِحٌ ؕ اِنَّ اللّٰہَ  لَا یُضِیۡعُ  اَجۡرَ  الۡمُحۡسِنِیۡنَ ﴿۱۲۰﴾ۙ",
                    "وَ لَا یُنۡفِقُوۡنَ نَفَقَۃً صَغِیۡرَۃً وَّ لَا کَبِیۡرَۃً  وَّ لَا یَقۡطَعُوۡنَ وَادِیًا اِلَّا کُتِبَ لَہُمۡ لِیَجۡزِیَہُمُ اللّٰہُ  اَحۡسَنَ مَا کَانُوۡا یَعۡمَلُوۡنَ ﴿۱۲۱﴾",
                    "وَ مَا کَانَ الۡمُؤۡمِنُوۡنَ  لِیَنۡفِرُوۡا کَآفَّۃً ؕ فَلَوۡ لَا نَفَرَ مِنۡ کُلِّ فِرۡقَۃٍ مِّنۡہُمۡ طَآئِفَۃٌ  لِّیَتَفَقَّہُوۡا فِی الدِّیۡنِ وَ لِیُنۡذِرُوۡا قَوۡمَہُمۡ اِذَا رَجَعُوۡۤا اِلَیۡہِمۡ لَعَلَّہُمۡ  یَحۡذَرُوۡنَ ﴿۱۲۲﴾٪",
                    "یٰۤاَیُّہَا الَّذِیۡنَ اٰمَنُوۡا قَاتِلُوا الَّذِیۡنَ یَلُوۡنَکُمۡ مِّنَ الۡکُفَّارِ وَ لۡیَجِدُوۡا فِیۡکُمۡ  غِلۡظَۃً ؕ وَ اعۡلَمُوۡۤا  اَنَّ اللّٰہَ  مَعَ الۡمُتَّقِیۡنَ ﴿۱۲۳﴾",
                    "وَ اِذَا مَاۤ  اُنۡزِلَتۡ سُوۡرَۃٌ  فَمِنۡہُمۡ مَّنۡ یَّقُوۡلُ اَیُّکُمۡ زَادَتۡہُ ہٰذِہٖۤ  اِیۡمَانًا ۚ فَاَمَّا الَّذِیۡنَ  اٰمَنُوۡا  فَزَادَتۡہُمۡ   اِیۡمَانًا وَّ ہُمۡ  یَسۡتَبۡشِرُوۡنَ ﴿۱۲۴﴾",
                    "وَ اَمَّا الَّذِیۡنَ فِیۡ قُلُوۡبِہِمۡ مَّرَضٌ فَزَادَتۡہُمۡ رِجۡسًا اِلٰی رِجۡسِہِمۡ وَ مَا تُوۡا وَ ہُمۡ کٰفِرُوۡنَ ﴿۱۲۵﴾",
                    "اَوَ لَا  یَرَوۡنَ اَنَّہُمۡ یُفۡتَنُوۡنَ فِیۡ  کُلِّ عَامٍ مَّرَّۃً  اَوۡ مَرَّتَیۡنِ ثُمَّ لَا یَتُوۡبُوۡنَ وَ لَا ہُمۡ یَذَّکَّرُوۡنَ ﴿۱۲۶﴾",
                    "وَ  اِذَا مَاۤ  اُنۡزِلَتۡ سُوۡرَۃٌ  نَّظَرَ  بَعۡضُہُمۡ اِلٰی بَعۡضٍ ؕ ہَلۡ یَرٰٮکُمۡ مِّنۡ اَحَدٍ ثُمَّ انۡصَرَفُوۡا ؕ صَرَفَ اللّٰہُ  قُلُوۡبَہُمۡ بِاَنَّہُمۡ قَوۡمٌ  لَّا یَفۡقَہُوۡنَ ﴿۱۲۷﴾",
                    "لَقَدۡ جَآءَکُمۡ رَسُوۡلٌ مِّنۡ اَنۡفُسِکُمۡ عَزِیۡزٌ عَلَیۡہِ مَا عَنِتُّمۡ حَرِیۡصٌ عَلَیۡکُمۡ بِالۡمُؤۡمِنِیۡنَ رَءُوۡفٌ رَّحِیۡمٌ ﴿۱۲۸﴾",
                    "فَاِنۡ تَوَلَّوۡا فَقُلۡ حَسۡبِیَ اللّٰہُ ۫٭ۖ لَاۤ  اِلٰہَ  اِلَّا ہُوَ ؕ عَلَیۡہِ  تَوَکَّلۡتُ وَ ہُوَ رَبُّ الۡعَرۡشِ  الۡعَظِیۡمِ ﴿۱۲۹﴾٪" ]
  
 }]
